[
  {
    "date": "2026-2-23",
    "title": "WiFi-Based Assessment of Scoliosis-Related Spinal Postures",
    "authors": "Xichen Gao, Lei Wang, Jenhui Chen, Jiancheng Chi, Zhiyi Zhou",
    "publish": "ACM Transactions on Sensor Networks",
    "url": "https://doi.org/10.1145/3796238",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-23",
    "title": "Balancing Fairness and High Match Rates in Reciprocal Recommender Systems: A Nash Social Welfare Approach",
    "authors": "Yoji Tomita, Tomohiko Yokoyama",
    "publish": "ACM Transactions on Recommender Systems",
    "url": "https://doi.org/10.1145/3793538",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-23",
    "title": "TUG-IoT: A Mobile Integrated IoT based Timed Up and Go Test",
    "authors": "Moomal Farhad, Tanveer Choudhury, Bhavna J. Antony",
    "publish": "Proceedings of the 2025 18th Health Informatics Knowledge Management Conference",
    "url": "https://doi.org/10.1145/3774816.3774843",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-23",
    "title": "Reproducibility Report for ACM SIGMOD 2025 Paper: 'SuSe: Summary Selection for Regular Expression Subsequence Aggregation over Streams'",
    "authors": "Gianluca Rossi, Muhammad Farhan",
    "publish": "Reproducibility Reports of the 2025 International Conference on Management of Data",
    "url": "https://doi.org/10.1145/3785021.3788013",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-23",
    "title": "Cuffless Noninvasive Continuous Blood Pressure Monitoring Using Superficial Temporal Arterial Tonometry",
    "authors": "Ge Zhu, Zifan Jiang, Gary Strangman, Yihao Zheng, Quan Zhang",
    "publish": "IEEE Open Journal of Engineering in Medicine and Biology",
    "url": "https://doi.org/10.1109/ojemb.2026.3667451",
    "source": "IEEE",
    "abstract": "<italic xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">Objective:</i> Continuous monitoring of blood pressure (BP) is a key parameter for cardiovascular assessment and hemodynamics monitoring. Current noninvasive methods are limited by frequent calibration, motion and environmental artifacts, and delayed response to rapid BP changes. In perioperative and critical-care settings, even short-duration hypotensive episodes and rapid BP lability have been associated with adverse outcomes, motivating technologies with high temporal fidelity. This study introduces a noninvasive blood pressure monitoring technique using superficial temporal artery tonometry (STAT), which employs a biomechanics-based transfer function to improve accuracy, reduce calibration requirements, and detect rapid BP changes in dynamic conditions. <italic xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">Methods:</i> Twenty-nine recording sessions of continuous BP monitoring were collected in human subjects (<inline-formula xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\"><tex-math notation=\"LaTeX\">$n=10$</tex-math></inline-formula>) during rest and during handgrip-induced BP fluctuations. Measurements were recorded simultaneously using the STAT method and compared to a noninvasive reference device (Finapres/Finometer volume-clamp) and Pulse Transit Time (PTT) baseline (derived from timing features) method. <italic xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">Results:</i> Using the Finapres/Finometer as a noninvasive reference, our method achieved a mean absolute difference (MAD) of <inline-formula xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\"><tex-math notation=\"LaTeX\">$4.8 \\pm 2.2$</tex-math></inline-formula> mmHg during rest and <inline-formula xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\"><tex-math notation=\"LaTeX\">$6.5 \\pm 3.4$</tex-math></inline-formula> mmHg during handgrips, significantly outperforming PTT, especially under dynamic conditions. <italic xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">Conclusion:</i> BP monitoring with STAT and its biomechanics-based transfer function achieved improved detection of rapid BP fluctuations, and higher accuracy than PTT under dynamic conditions. <italic xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">Significance:</i> STAT with biomechanics-based modeling enables real-time, robust noninvasive BP monitoring, overcoming calibration, motion, and detection limitations of current methods."
  },
  {
    "date": "2026-2-23",
    "title": "A Tutorial on AI-Empowered Integrated Sensing and Communications",
    "authors": "Mojtaba Vaezi, Gayan Aruma Baduge, Esa Ollila, Sergiy A. Vorobyov",
    "publish": "IEEE Communications Surveys &amp; Tutorials",
    "url": "https://doi.org/10.1109/comst.2026.3665143",
    "source": "IEEE",
    "abstract": "Integrating sensing and communication (ISAC) can help overcome the challenges of limited spectrum and expensive hardware, leading to improved energy and cost efficiency. While full cooperation between sensing and communication can result in significant performance gains, achieving optimal performance requires efficient designs of unified waveforms and beamformers for joint sensing and communication. Sophisticated statistical signal processing and multi-objective optimization techniques are necessary to balance the competing design requirements of joint sensing and communication tasks. As model-based approaches can be suboptimal or too complex, deep learning offers a powerful data-driven alternative, especially when optimal algorithms are unknown or impractical for real-time use. Unified waveform and beamformer design problems for ISAC fall into this category, where fundamental design trade-offs exist between sensing and communication performance metrics, and the underlying models may be inadequate or incomplete. This tutorial paper explores the application of artificial intelligence (AI) to enhance efficiency or reduce complexity in ISAC designs. We emphasize the integration benefits through AI-driven ISAC designs, prioritizing the development of unified waveforms, constellations, and beamforming strategies for both sensing and communication. To illustrate the practical potential of AI-driven ISAC, we present three case studies on waveform, beamforming, and constellation design, demonstrating how unsupervised learning and neural network–based optimization can effectively balance performance, complexity, and implementation constraints."
  },
  {
    "date": "2026-2-23",
    "title": "Reconstructing Sparse-view Indoor Scenes in View Space with Global Monocular Prior Alignment",
    "authors": "Xiaotian Sun, Qingshan Xu, Mengyin Liu, Siqi Shen, Cheng Wang",
    "publish": "IEEE Transactions on Circuits and Systems for Video Technology",
    "url": "https://doi.org/10.1109/tcsvt.2026.3667058",
    "source": "IEEE",
    "abstract": "Although 3D Gaussian Splatting (3DGS) has greatly advanced the development of novel view synthesis (NVS) and surface reconstruction tasks, it still faces serious challenges in indoor scenes with only sparse views due to the lack of initialization point cloud. Existing GS-like methods are geometrically initialized using point clouds from Structure from Motion (SfM), and their performance is heavily limited by the point cloud quality. However, in indoor scenes containing large areas of textureless or weakly textured regions, the SfM algorithm struggles to generate point clouds in these areas, especially when only a limited number of input views are available. This situation can cause the GS optimization process to overfit the photometric error, resulting in severe geometric degradation in regions lacking proper initialization. To address the above problem, we propose a novel sparse-view 3DGS method using global scale-aligned monocular depth to initialize Gaussian primitives and optimize them in view space, named VGA-GS. First, we design a global scale-aligned monocular depth initialization strategy, which provides geometric priors in textureless or weakly textured regions while avoiding the local geometric distortions in vanilla alignments. Second, we propose a novel Gaussian primitive representation based on view space and a refinement strategy based on pixel errors, which can constrain each primitive to always be within the field of view where it is observed to be fully optimized. Finally, we extract the surface prior from monocular depth to regularize the rendering depth and normal, and further propagate the constraints of the training view to the neighboring pseudo-views via image warping. Our method achieves state-of-the-art reconstruction performance in both textureless regions and local details for indoor scenes with sparse views. Moreover, it is highly scalable, supporting integration with various 3DGS rasterizers and depth estimation methods. We release the code at https://github.com/XT5un/VGA-GS."
  },
  {
    "date": "2026-2-23",
    "title": "On the Mitigation of Dead Time With Photon-Counting Detector Arrays for FSO Inter-Satellite Links",
    "authors": "Heyou Liu, Muhammad Salman Bashir, Vuong Mai, Mohamed-Slim Alouini",
    "publish": "IEEE Transactions on Aerospace and Electronic Systems",
    "url": "https://doi.org/10.1109/taes.2026.3667118",
    "source": "IEEE",
    "abstract": "In December 2024, NASA's Deep Space Optical Communications (DSOC) Psyche Mission beamed laser encoded data from nearly 494 million kilometers away to the Hale Telescope at the Palomar Observatory housed in Caltech [1]. This feat could not have been achieved without the deployment of highly sensitive photon-counting detectors that can register as small as a single photon at the receiver. In the photon-counting regime, an array of detectors offers significant advantages instead of a single detector, particularly, to mitigate dead time, which is an inherent rate-limiting factor associated with photon counting detectors. Our results reveal that by optimizing one important system parameter—the signal spot size on the focal plane array— significant symbol error rate minimization and channel capacity maximization can be achieved. Using a programmable liquid lens, the Gaussian spot size can be dynamically adjusted in real time—based on the detected signal and noise photons during the observation interval—to optimize system performance under dead time."
  },
  {
    "date": "2026-2-23",
    "title": "A Learned-PPR Decoding Scheme for Partial Packet Recovery in Network Coding",
    "authors": "Han Shen, Qifu Tyler Sun, Zongpeng Li, Hao Qi, Yangxuan Cheng, Fanyang Meng, Ye Wang, Yongsheng Liang",
    "publish": "IEEE Internet of Things Journal",
    "url": "https://doi.org/10.1109/jiot.2026.3667346",
    "source": "IEEE",
    "abstract": "Network coding (NC) has proven to offer significant benefits in long-distance and broadcast transmissions, enhancing both throughput and energy efficiency. Recent studies have incorporated partial packet recovery (PPR) into packet-level NC, using syndromes from coded packets to correct bit errors and thereby reduce completion delay. Motivated by recent breakthroughs in deep learning, this paper introduces a novel neural networkbased decoding framework for packet-level NC, referred to as Learned-PPR. The proposed framework incorporates a Bilateral Efficient Self-Attention Network (Bi-ESANet) architecture, which leverages a bilateral network structure to effectively capture both inter- and intra-packet information. Furthermore, we introduce an ESA module to mitigate the GPU memory overhead compared with traditional Transformer attention modules. To handle rateless NC, we propose a “rateless masking” training strategy that enables efficient decoding of rateless codes within the Bi-ESANet framework. Simulation results across various transmission scenarios demonstrate that the proposed approach significantly outperforms existing PPR schemes, achieving lower completion delay. Specifically, compared to existing methods, the proposed approach reduces completion delay by more than 25%. However, the introduced framework incurs higher computational complexity due to the integration of the Bi-ESANet architecture."
  },
  {
    "date": "2026-2-23",
    "title": "Development of a Novel Synchronized Servo Control System for Lathe Machining of Globoid Worm Gears",
    "authors": "M. O. Guler, M. Soyaslan",
    "publish": "IEEE Access",
    "url": "https://doi.org/10.1109/access.2026.3667448",
    "source": "IEEE",
    "abstract": "This study presents the development of a novel servo-based synchronized control system designed to enhance the precision and productivity of lathe operations during the machining of globoid worm gears. To ensure high precision and compliance with quality standards, a servo motor and servo drive were integrated into the automation system, while a PLC and HMI were employed to synchronize the rotational speeds of the lathe chuck and the rotary table through the developed control software. Detailed engineering analyses were conducted to determine the appropriate specifications of the servo drive, servo motor, encoder, PLC, and HMI units. Based on a comprehensive literature review and feedback from end-users, system requirements were identified and a tailored control algorithm was developed. The control–automation panel, designed according to electrical schematics, was assembled and fully integrated into the lathe system. After commissioning, sample worm and gear components were produced from various materials, and their manufacturing data were analyzed and reported. Experimental results demonstrated that the proposed synchronized automation system significantly reduces manual adjustments and complex mechanical setups required in traditional machining. Operations such as threading, gear cutting, and worm grinding—previously demanding several hours of mechanical reconfiguration—were digitally executed within minutes. When production times were compared, the developed system achieved a 61.24% improvement in manufacturing efficiency over conventional methods. These findings confirm the system’s potential as a novel, high-precision, and productivity-oriented automation approach for advanced machining applications."
  },
  {
    "date": "2026-2-23",
    "title": "The Impact of Artificial Intelligence on the Quality of Strategic Decisions: The Mediating Role of Organizational Data Readiness",
    "authors": "Naif bin Sulaiman Al-Mutlaq, Nazem Mahmoud Malkawi",
    "publish": "IEEE Access",
    "url": "https://doi.org/10.1109/access.2026.3666947",
    "source": "IEEE",
    "abstract": "In the age of digital governance, Artificial Intelligence (AI) has become a key driver for improving strategic decision-making in public organizations. This study examines how AI adoption influences decision quality in Saudi public organizations, emphasizing the mediating role of organizational data readiness. Within the Vision 2030 transformation, effective AI use depends not only on technology but also on the organization’s ability to manage and govern data efficiently. Using a quantitative approach and data from senior and mid-level employees across multiple government entities, the study employed structural equation modeling (SEM) to test its hypotheses. Results revealed that AI adoption significantly enhances decision quality, and this effect is strengthened when organizations demonstrate high levels of data readiness, especially in governance, integration, and data quality. The findings align with recent research highlighting the importance of data maturity in public sector digital transformation. The study recommends training leaders in AI and data readiness, strengthening data-ecosystem capabilities, adopting AI decision-support tools, and regularly assessing data maturity for continuous improvement. So, this study is original in combining AI, data readiness, and strategic decision support into one framework, applied within Saudi organizations where such research is limited."
  },
  {
    "date": "2026-2-23",
    "title": "G-DMAD: Group-based Diverse Multi-Agent Debate for Robust Reasoning",
    "authors": "Sichao Chen, Deqiang Lian, Yiting Hong, Liguo Weng, Da Hong",
    "publish": "IEEE Access",
    "url": "https://doi.org/10.1109/access.2026.3667025",
    "source": "IEEE",
    "abstract": "Large Language Models excel at complex reasoning but suffer from single-agent limitations such as fixed reasoning patterns and hallucinations. While multi-agent debate frameworks can mitigate these issues through collaboration, existing approaches either employ homogeneous reasoning strategies or lack structured cross-agent coordination.We propose G-DMAD, a group-based debate framework that partitions agents into distinct groups, each employing a different reasoning strategy (e.g., Input-Output, Chain-of-Thought, Duty-Distinct CoT). Through intra-group iterative refinement and inter-group leader selection via a meta-evaluator LLM, G-DMAD enables broader exploration of reasoning paths while maintaining solution convergence. Extensive experiments on the MM-Vet and ScienceQA benchmarks demonstrate that G-DMAD achieves state-of-the-art results across diverse model families, reaching 73.07% accuracy on GPT-5-nano and 73.35% on GLM-4.1V-Thinking-Flash. Notably, G-DMAD delivers a significant performance leap of +8.53% on GPT-5-nano with only a marginal 5% increase in token consumption (3.73M → 3.92M), effectively bridging the performance gap between disparate model scales while maintaining high computational efficiency. The robust improvements in both accuracy and F1 scores on scientific reasoning tasks further underscore G-DMAD’s superior generalizability and its ability to mitigate \"cognitive fixation\" in complex multimodal environments."
  },
  {
    "date": "2026-2-23",
    "title": "Integrated Spherical Ray-Tracing and Spectral Guard-Band Analysis for K/Ka-Band Earth–Space Links",
    "authors": "Nezah Balal, Yael Balal",
    "publish": "IEEE Access",
    "url": "https://doi.org/10.1109/access.2026.3667323",
    "source": "IEEE",
    "abstract": "Modern K/Ka-band (18–40 GHz) satellite communication systems, particularly Low Earth Orbit (LEO) and non-geostationary (NGSO) constellations, require accurate elevation-dependent atmospheric propagation modeling to account for narrow beamwidths, stringent link budgets, and extended low-elevation passes where slant-path lengths increase substantially. This work presents an integrated propagation framework that combines ITU-R standardized models with spherical-coordinate ray tracing. The main contributions are the decomposition of total slant-path atmospheric attenuation into constituent physical mechanisms, the quantification of refraction-induced pointing bias (Δε) using Snell’s law in spherical geometry, and the determination of asymmetric frequency guardbands near the 22.235 GHz water-vapor absorption line. The framework is demonstrated using high resolution numerical integration of ITU-R standard atmospheric profiles for a representative mid-latitude coastal site. Results indicate a pointing bias of approximately 100 mdeg and a horizontal ray displacement of 8 km at ε = 5°. To maintain gaseous-absorption losses below 0.2 dB near 22.235 GHz, frequency offsets of 2.073 GHz (low-side) and 3.923 GHz (high-side) are required, recovering up to 1.8 GHz of usable spectrum compared to conventional symmetric guard-band allocations. By unifying geometric optics with physical-layer attenuation models, this framework provides a practical tool for spectral optimization and link budget analysis in next-generation NGSO systems."
  },
  {
    "date": "2026-2-23",
    "title": "Direction Prediction Error-Prioritized Experience Replay (DPE-PER) for Adversarial UAV Interception under Partial Observability",
    "authors": "Issaree Srisomboon, Sanghwan Lee",
    "publish": "IEEE Internet of Things Journal",
    "url": "https://doi.org/10.1109/jiot.2026.3667218",
    "source": "IEEE",
    "abstract": "Autonomous interception of unmanned aerial vehicles (UAVs) is a critical capability in modern defense, requiring agents to navigate adversarial maneuvers under environmental uncertainty. While conventional path planning often assumes full observability and static behaviors, this study addresses the complex challenge of intercepting an evasive target within a partially observable Markov decision process (POMDP) framework. We propose a deep Q-network (DQN) framework enhanced by a novel sampling strategy: direction prediction error–prioritized experience replay (DPE-PER). Unlike standard replay mechanisms, DPE-PER utilizes an auxiliary prediction task to prioritize transitions based on direction prediction (DP) error and directional uncertainty. By emphasizing experiences where the agent’s internal model fails to anticipate target maneuvers, DPE-PER focuses learning on the most informative adversarial interactions. Extensive simulations demonstrate that our approach achieves a 48.2% improvement in target interception rates and a 25.4% increase in average return compared to standard experience replay (ER) and prioritized experience replay (PER), highlighting the effectiveness of integrating predictive signals into experience selection for robust UAV autonomy in adversarial environments."
  },
  {
    "date": "2026-2-23",
    "title": "Carbon-Aware Dynamic Task Scheduling in Hierarchical Cloud–Edge Systems for IoT Devices",
    "authors": "Juncai Gao, Zhuoyue Chen, Zhihao Hu, Zhanqi Cui, Ying Chen, Jiwei Huang",
    "publish": "IEEE Internet of Things Journal",
    "url": "https://doi.org/10.1109/jiot.2026.3665092",
    "source": "IEEE",
    "abstract": "With the widespread application of the Internet of Things (IoT), computing tasks on the terminal side have surged. Traditional cloud computing models, constrained by high network latency and overloaded central servers, can no longer effectively meet the dual requirements of real-time responsiveness and energy efficiency. The cloud–edge–device collaborative architecture, by enabling distributed resource scheduling, offers a promising solution to reduce both latency and energy consumption. However, optimizing carbon emissions under dynamic operating conditions remains a pressing and unresolved challenge. This paper proposes a carbon-aware dynamic scheduling framework for cloud–edge–device systems, which accounts for the stochastic nature of task arrivals, heterogeneous computing capabilities, and varying carbon intensity across devices and locations. A multi-layer carbon emission model is developed, and the long-term carbon minimization objective is formulated as a stochastic optimization problem. Using the Lyapunov drift-plus-penalty method, the problem is transformed into a tractable deterministic optimization framework, upon which a Carbon-Efficient Computation Offloading (CECO) algorithm is designed. CECO jointly optimizes local computation frequency, data transmission rate, and edge resource allocation to dynamically balance task queue stability and carbon emission intensity. Theoretical analysis and simulation results validate that the proposed algorithm significantly reduces system-level carbon emissions while maintaining quality of service, demonstrating strong potential for enabling green computing in intelligent distributed environments."
  },
  {
    "date": "2026-2-23",
    "title": "AGRO-YOLO-V: Hybrid Instance Segmentation and Geometric Modeling for Single-View Orange Volume Estimation",
    "authors": "Arsanchai Sukkuea, Wattanapong Kurdthongmee, Korakot Suwannarat",
    "publish": "IEEE Access",
    "url": "https://doi.org/10.1109/access.2026.3667161",
    "source": "IEEE",
    "abstract": "In precision agriculture, accurately estimating the volume of fruits is critical for quality control, yield prediction, and post-harvest management. Current vision-based methods primarily rely on object detection or empirical regression, which inherently lack the necessary geometric accuracy for spherical objects like oranges. This paper presents AGRO-YOLO-V, a hybrid framework that combines pixel-accurate instance segmentation with analytical geometric modeling to achieve high-accuracy single-view volumetric estimation. The system utilizes a modified YOLO-based segmentation backbone to generate precise fruit masks, which are then scaled into a 3D volume using a statistically calibrated area-to-volume scaling law. This hybrid learning-geometry paradigm corrects the systematic errors of bounding-box methods. Tests on a custom orange dataset show that AGRO-YOLO-V achieves a Coefficient of Determination (<italic xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">R<sup>2</sup></i>) of 0.94 and estimates volume with a Mean Absolute Percentage Error (MAPE) of 7.39% on a held-out test set. This result represents a 1.66 improvement in error reduction over a rigorously calibrated Bounding-Box baseline (MAPE = 12.24%), confirming the method’s superiority. The suggested framework is a scalable and cost-effective solution for deploying intelligent fruit grading and automated agricultural inspection systems in real time."
  },
  {
    "date": "2026-2-23",
    "title": "A Spectral Clustering-Based Approach for Balancing Data in TF-Target Gene Interaction Prediction Using Heterogeneous Network Embedding",
    "authors": "Quoc Huy Dang, Thanh Tuoi Le, Thi Thu Hien Vu, Thi Tu Kien Le, Xuan Tho Dang",
    "publish": "IEEE Transactions on Computational Biology and Bioinformatics",
    "url": "https://doi.org/10.1109/tcbbio.2026.3666856",
    "source": "IEEE",
    "abstract": "Identifying transcription factors (TFs) interacting with target genes plays a crucial role in regulating gene expression, providing deep insights into the molecular mechanisms involved in biological processes and diseases, while also opening new opportunities for research and treatment, particularly in precision medicine. However, challenges arise from the high cost of experiments and biological complexity. Recent machine learning models show promise for predicting TF target gene interactions but struggle with data imbalance, as the number of known interactions is much smaller than unknown ones, reducing prediction performance. To address this challenge, we propose an approach that integrates sample selection from potential unknown interactions with spectral clustering to balance the dataset. We construct an adjacency matrix from known interactions, apply spectral clustering to partition the data, and select unknown interactions farthest from the cluster center for diversity. A deep learning method combining random walk sampling and skip-gram embeddings is used to learn representations of biological networks. Experimental results, evaluated via five-fold cross-validation, show an average AUC of 0.9575 ± 0.0044, outperforming existing methods. These findings validate our approach's efficacy in improving prediction accuracy and resolving data imbalance, offering a robust framework for discovering novel TF-target gene interactions in molecular biology and biomedical research."
  },
  {
    "date": "2026-2-23",
    "title": "Phase Shifted Quasi-Elliptical Fringe Patterns for Underwater 3D Imaging",
    "authors": "Domagoj Zoraja, Tomislav Petković, Josep Forest",
    "publish": "IEEE Transactions on Instrumentation and Measurement",
    "url": "https://doi.org/10.1109/tim.2026.3659593",
    "source": "IEEE",
    "abstract": "The development of robust fringe patterns for an underwater imaging is challenging due to the unique physical properties of the underwater environment. A line in the image plane, when projected through a flat refractive interface, deforms which introduces errors in both calibration and reconstruction procedures. In this paper, we present a novel image formation model, based on the axial camera model, which utilizes phase shifted quasi-elliptical fringe patterns for the underwater imaging. When projected through flat refractive interfaces, deformed elliptical fringe patterns produce concentric cones of camera rays in the outmost medium, each uniquely identified by its radius encoded in the phase. Triangulation is then achieved by computing ray-cone intersections, with extraneous solutions filtered out since more than one viable solutions exist. The proposed quasi-elliptical fringe pattern was experimentally evaluated by imaging calibration objects and performing 3D reconstruction, wherein quantitative results demonstrate the feasibility of the proposed method."
  },
  {
    "date": "2026-2-23",
    "title": "Polarization Reconfigurable Magnetoelectric Dipole Antenna with Broadband Stable Gain for Vehicular Satellite Communication System",
    "authors": "Zijian Xing, Pengyue Yang, Qianan Yu, Guangwei Yang, Ling Wang, Chow-Yen-Desmond Sim",
    "publish": "IEEE Transactions on Vehicular Technology",
    "url": "https://doi.org/10.1109/tvt.2026.3667046",
    "source": "IEEE",
    "abstract": "To provide stable satellite communication quality for vehicles moving at high speeds or in extreme environments, gain robustness antenna represents an innovative solution. A polarization reconfigurable magnetoelectric dipole (ME-dipole) antenna with wide impedance bandwidths, broad 3-dB axial ratio (AR) bandwidths, and stable gain across different polarization states is proposed. To ensure consistent axial directional gain over a wide bandwidth, a design method based on the negative correlation complementarity of directional patterns in frequency variation is proposed. The ME-dipole radiator pair is composed of four rotationally symmetric end shorted patches, where the axial directional gain of the patches and metal vias structures in the ME-dipole exhibits a negative correlation with increasing frequency. Polarization agility is achieved through a reconfigurable feeding network, which utilizes multiple resonances and is implemented using an orthogonal coupling slot loaded with a DC-blocking gap and PIN diodes. When switching between different circular polarization (CP) states, the measured 3-dB AR bandwidths are 34.2% and 37.4% for left-handed circularly polarization (LHCP) and right-handed circularly polarization (RHCP), respectively. In addition to achieving peak gains exceeding 6dBic for both CP senses, the proposed antenna maintains a stable gain fluctuation of no more than 1.3 dB across a broad 31.03% operational bandwidths (1.96 – 2.74GHz), which is crucial for enhancing the performance of vehicular S-band satellite communication systems."
  },
  {
    "date": "2026-2-23",
    "title": "Sensing-Assisted Compressive Superimposed CSI Feedback",
    "authors": "Chaojin Qing, Haowen Jiang, Yuqiao Yang, Yu Sun, Xue Zheng, Xi Cai, Pengfei Du",
    "publish": "IEEE Communications Letters",
    "url": "https://doi.org/10.1109/lcomm.2026.3666864",
    "source": "IEEE",
    "abstract": "In frequency division duplexing (FDD) massive multiple-input and multiple-output (mMIMO) systems, compressive sensing (CS)-based superimposed channel state information (CSI) feedback still faces significant challenges, such as the high computational complexity, the unavoidable channel estimation (CE) errors at the user equipment (UE), and superimposed interference. To address these challenges, we propose a sensing-assisted compressive superimposed CSI feedback method. By leveraging active sensing to extract the support set of downlink transmission paths, a sensing-assisted low-complexity reconstruction method is developed. In this method, the correctness verification and index supplementation schemes are employed to ensure the correctness of the sensed support set. Moreover, the CE error and superimposed interference are suppressed, thereby improving the recovery accuracy of both downlink CSI and uplink data sequence (UL-DS) while reducing computational complexity. Experiment results demonstrate that the proposed method substantially reduces the computational complexity. Furthermore, the proposed method presents performance improvement and robustness against parameter variations."
  },
  {
    "date": "2026-2-23",
    "title": "A highly sensitive electro optic-SPR optical fiber sensor for micro-voltage monitoring",
    "authors": "Hanrui Yang, Wentao Du, Jiaxing Tian, Dongle Liu, Run Zhao",
    "publish": "Journal of Lightwave Technology",
    "url": "https://doi.org/10.1109/jlt.2026.3666160",
    "source": "IEEE",
    "abstract": "This paper presents a novel optical fiber voltage sensing technology based on the electro-optic effect and surface plasmon resonance (SPR) effect. By monitoring the refractive index changes of the electro-optic material (DMF) under an electric field and leveraging the high-sensitivity response of SPR, high-precision optical detection of minute voltages is achieved. Experimental results demonstrate that the sensor achieves sensitivities of-1.3518 nm/mV and-0.8018 nm/mV in the ranges of-80 mV to-70 mV and 30 mV to 40 mV, respectively. Based on this sensing mechanism, a grooved photonic crystal fiber structure with integrated trench confinement and optimized air-hole layout is further proposed, which strengthens the interaction between the optical field and DMF and enhances the surface plasmon excitation via a TiO2 overlayer. Through this structural optimization, the sensitivity is improved to −1.65nm/mV, accompanied by excellent linear response characteristics. This study validates the feasibility and advantages of the electro optic–SPR coupling mechanism for micro-voltage detection. The proposed technology offers benefits such as non-invasiveness, immunity to electromagnetic interference, high integration, and good stability, providing a new approach for monitoring neural electrophysiological activity."
  },
  {
    "date": "2026-2-23",
    "title": "2025 12th International Conference on Social Networks Analysis, Management and Security (SNAMS)",
    "authors": "N/A",
    "publish": "N/A",
    "url": "https://doi.org/10.1109/snams67467.2025",
    "source": "IEEE",
    "abstract": ""
  },
  {
    "date": "2026-2-23",
    "title": "Advanced Packaging Road Map to 2030: Integrating Memory, Logic, and Systems for Artificial Intelligence",
    "authors": "Chee Ping Lee, Prahalad M. Parthangal",
    "publish": "IEEE Electron Devices Magazine",
    "url": "https://doi.org/10.1109/med.2026.3651987",
    "source": "IEEE",
    "abstract": "The exponential growth of artificial intelligence (AI) and high-performance computing (HPC) is driving a paradigm shift in semiconductor design, where advanced packaging has become a cornerstone for system-level scaling. This article presents a road map to 2030 for heterogeneous integration across logic, memory, photonics, and substrates, highlighting key innovations and challenges. Monolithic system on chips (SoCs) are being replaced by chiplet-based architectures and 3DIC stacking, enabled by TSVs, hybrid bonding, and backside power delivery networks (PDNs) to achieve finer interconnect pitches (<5 <italic xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">n</i>m) and improved power integrity. Memory scaling is addressing the “memory wall” through high bandwidth memory (HBM) evolution—from HBM3E to HBM5—delivering bandwidths beyond 4 TB/s via ultradense stacking and direct metal–metal and hybrid bonding. Simultaneously, copackaged optics (CPO) is emerging as a transformative solution for data movement, integrating photonic engines with compute dies to enable >100-Tb/s bandwidth and superior energy efficiency. Interposers and substrates are expanding horizontally, scaling beyond 9× reticle sizes and transitioning toward glass cores for enhanced electrical and thermal performance, supported by panel-level packaging (PLP) for cost efficiency. Thermal management remains critical as AI workloads exceed multikilowatt power levels, necessitating innovations such as microfluidic cooling and advanced thermal interface materials (TIMs). Bonding technologies are evolving from thermal compression to hybrid bonding, leveraging fine-grain (FG) copper (Cu) and nitrogen-doped carbide (NDC) dielectrics for low-temperature high-density interconnects. Emerging approaches like silicon interconnect fabric (Si-IF) promise near-on-chip performance through package-less integration. Advanced packaging is no longer a mechanical necessity; it is a strategic enabler for scalable energy-efficient computing in the AI era."
  },
  {
    "date": "2026-2-23",
    "title": "Automated Diabetic Retinopathy Screening Using Custom Convolutional Neural Networks",
    "authors": "R.Prasanthi, Naveen Kumar Penjarla, Ashok Battula, Kadali Srinivas, R.Hari Prasad",
    "publish": "2025 5th International Conference on Artificial Intelligence and Signal Processing (AISP)",
    "url": "https://doi.org/10.1109/aisp68263.2025.11396172",
    "source": "IEEE",
    "abstract": "Diabetic Retinopathy (DR) is a leading cause of vision impairment, requiring accurate image quality assessment (IQA), enhancement(IQE) and grading for effective diagnosis. This study presents a novel deep learning framework for automated DR screening using custom Convolutional Neural Networks (CNNs) without pretrained models. The proposed system consists of three key components: (1) an IQA model to assess the quality of retinal images, (2) an IQE auto encoder to enhance image quality, and (3) a DR grading model to classify images into five severity levels (0-4). The dataset is preprocessed with data augmentation techniques and split into training and testing sets. The IQA model is trained using an augmented dataset, ensuring robust quality assessment. The IQE model is designed as an auto encoder that learns to improve image clarity, which is then utilized for DR classification. A joint training approach further refines the DR grading model by incorporating enhanced images. Experimental results show promising accuracy for IQA and DR classification, along with high sensitivity and specificity. The integration of IQE significantly improves DR detection performance. This work demonstrates the potential of custom CNNs in automated DR screening, reducing the reliance on manual assessment and improving clinical decision-making."
  },
  {
    "date": "2026-2-23",
    "title": "Boosted Ensemble Classification of Landsat 8 Imagery Over Nainital Region Using Fuzzy C-Means and XGBoost",
    "authors": "Swati Vishnoi, Meenakshi Pareek",
    "publish": "2025 14th International Conference on System Modeling &amp;amp; Advancement in Research Trends (SMART)",
    "url": "https://doi.org/10.1109/smart66937.2025.11389590",
    "source": "IEEE",
    "abstract": "Classifying land cover in mountainous and other variable terrain is one of the more difficult tasks in remote sensing. This paper proposes a hybrid ensemble learning approach for the classification of Landsat 8 imagery of Nainital. The hybrid uses Fuzzy C-Means clustering and Extreme Gradient Boosting based (XGBoost). In the first step, the FCM process recognizes that the satellite data contain fuzzy and mixed pixels, which are then assigned a “soft membership” for each land cover category. The “soft memberships” are then input into an XGBoost classifier, which will learn how to classify these categories. Boosting will also help further train and improve the boosted model's performance, by concentrating on cases where the categories are difficult to classify. These experimental outcomes also reaffirm that the proposed hybrid classifier strategy will work better in classification related to overall accuracy (93.67 percent), the <tex xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">$\\mathbf{F 1}$</tex>-score (0.91), and recall accuracy (0.89), when compared to previous classifiers, such as Random Forests, Support Vector Machines, and FCM. Furthermore, it generally performs well in cases where mixed pixels are present and in complex arrangements, thus adaptable to high-resolution land cover mapping in similar areas."
  },
  {
    "date": "2026-2-23",
    "title": "Inside Knowledge: Graph-based Path Generation with Explainable Data Augmentation and Curriculum Learning for Visual Indoor Navigation",
    "authors": "Daniel Airinei, Elena Burceanu, Marius Leordeanu",
    "publish": "2025 IEEE/CVF International Conference on Computer Vision Workshops (ICCVW)",
    "url": "https://doi.org/10.1109/iccvw69036.2025.00184",
    "source": "IEEE",
    "abstract": "Indoor navigation is a difficult task, as it generally comes with poor GPS access, forcing solutions to rely on other sources of information. While significant progress continues to be made in this area, deployment to production applications is still lacking, given the complexity and additional requirements of current solutions. Here, we introduce an efficient, real-time and easily deployable deep learning approach, based on visual input only, that can predict the direction towards a target from images captured by a mobile device. Our technical approach, based on a novel graph-based path generation method, combined with explainable data augmentation and curriculum learning, includes contributions that make the process of data collection, annotation and training, as automatic as possible, efficient and robust. On the practical side, we introduce a novel large-scale dataset, with video footage inside a relatively large shopping mall, in which each frame is annotated with the correct next direction towards different specific target destinations. Different from current methods, ours relies solely on vision, avoiding the need of special sensors, additional markers placed along the path, knowledge of the scene map or internet access. We also created an easy to use application for Android, which we plan to make publicly available. We make all our data and code available along with visual demos on our project site<sup xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">1</sup><sup xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">1</sup>https://sites.google.com/view/indoor-navigation-by-vision/."
  },
  {
    "date": "2026-2-23",
    "title": "Augmented Multinomial Logistic Regression for Mineral Classification in Charnockite Rock",
    "authors": "Mridu Sahu, Richa Nayak, Priyanka Arya, Shivangi Diwan, Sagar Misra, N. Vishwakarma, D. C. Jhariya",
    "publish": "2025 1st IEEE Uttar Pradesh Section Women in Engineering International Conference on Electrical Electronics and Computer Engineering (UPWIECON)",
    "url": "https://doi.org/10.1109/upwiecon67212.2025.11390383",
    "source": "IEEE",
    "abstract": "Minerals are vital resources that directly influence economic growth and industrial development. Accurate identification and classification of minerals from geological samples are essential for efficient exploration, extraction, and sustainable utilization. Charnockite, a metamorphic rock widely distributed in the Eastern Ghats Mobile Belt, contains a complex mixture of oxides, trace elements, and rare earth elements, making it suitable for machine learning based classification. This study develops a systematic framework to classify the mineral composition of Charnockite rock using data augmentation and Multinomial (SoftMax) Logistic Regression. The workflow begins with preprocessing steps such as handling missing values, detecting outliers, and transforming non-normalized variables into model ready form. To address the limited dataset size, a Dirichlet- based augmentation technique is applied to generate synthetic yet realistic oxide compositions, improving class balance and training robustness. Exploratory Data Analysis (EDA) through correlation matrices, linear and multivariate analyses, and density plots is performed to provide insights into feature distributions and interrelationships. The classification model is then evaluated using accuracy, precision, recall, and F1-score. Results demonstrate an accuracy of 82.85 %, with consistently high precision and recall across classes. Linear and multivariate analyses further reveal redundant as well as higher order dependencies among oxides, supporting dimensionality reduction and enhancing interpret- ability. This study confirms that data augmentation combined with Multinomial Logistic Regression offers a reliable and interpretable solution for mineral classification in geological datasets. The framework can be extended to larger datasets and diverse lithological units, contributing to faster and more sustainable mineral resource exploration."
  },
  {
    "date": "2026-2-23",
    "title": "Kinetostatic Modeling and Analysis of an Exoskeleton Type 3-PFR Rod-Driven Continuum Robot for Wrist Rehabilitation",
    "authors": "Ming Jiang, Yuhang Lei, Qizhi Meng, Tomoya Kitani, Oscar Altuzarra, Yukio Takeda",
    "publish": "2025 IEEE International Conference on Robotics and Biomimetics (ROBIO)",
    "url": "https://doi.org/10.1109/robio66223.2025.11376084",
    "source": "IEEE",
    "abstract": "Wrist rehabilitation is essential for restoring upper limb function following injury or neurological impairment. This paper proposes an exoskeleton-type rod-driven continuum assistive robot designed to support wrist rehabilitation exercises and presents the modeling to analyze its effect on the wrist. The proposed robot features a flexible rod-driven continuum structure, making it suitable for safe and compliant interaction with the human arm. To model the wrist joint, the forearm and hand are represented as two rigid links connected by a spherical joint. The continuum flexible rods are constructed as 3-PFR mechanism and modeled using Kirchhoff rod theory. The combined system is simulated under quasi-static conditions to evaluate the robot's motion capabilities and interaction with the wrist joint. Simulation results demonstrate that the 3-PFR continuum robot achieves a functional range of motion and generates constraint forces within acceptable levels for rehabilitation support. These findings confirm the potential and feasibility of the proposed structure and lay the groundwork for future development of a rod-driven continuum robot in wrist rehabilitation applications."
  },
  {
    "date": "2026-2-23",
    "title": "A Multipath Ghost Removal Algorithm for mm-Wave Radar-Based Indoor Human Detection",
    "authors": "G. Wang, J. Wang, Z. Xu, L. Chen, Z. Chen",
    "publish": "2025 Cross Strait Radio Science and Wireless Technology Conference (CSRSWTC)",
    "url": "https://doi.org/10.1109/csrswtc67757.2025.11384278",
    "source": "IEEE",
    "abstract": "In the context of indoor human localization and tracking using millimeter-wave radar, the multipath effect often introduces false ghost targets, which significantly interfere with the accurate detection of real targets. To address this challenge, we establish a comprehensive multipath propagation model and conduct an in-depth analysis of target characteristics across the range, Doppler, and angle domains. Building on these insights, we propose a novel multipath ghost removal algorithm, termed MGR-RDA, which operates on the three-dimensional radar data cube (Range, Doppler, Angle). Experimental evaluations demonstrate that the proposed method effectively suppresses ghost targets, achieving a recognition accuracy of 98%. Notably, the algorithm performs exceptionally well even in unknown environments without prior information, offering a reliable and practical solution for leveraging millimeter-wave radar in complex indoor scenarios."
  },
  {
    "date": "2026-2-23",
    "title": "An Ultra-Wideband Millimeter-Wave CMOS Power Amplifier for 5G Applications",
    "authors": "Rongjie Su, Yanjie Yang, Zhi-Xia Du",
    "publish": "2025 Cross Strait Radio Science and Wireless Technology Conference (CSRSWTC)",
    "url": "https://doi.org/10.1109/csrswtc67757.2025.11384416",
    "source": "IEEE",
    "abstract": "This paper presents a broadband Ka-band power amplifier (PA) implemented in a 65-nm CMOS process. The output matching network utilizes a symmetric transformer structure, designed to provide the optimal load impedance across a broad bandwidth. Additionally, specific coupled transformers are designed in the input and interstage matching networks to enlarge the operating bandwidth. The PA achieves a fractional bandwidth of 64.6% (22–43 GHz), fully covering the Ka-band (26.5-40 GHz). It exhibits a power-added efficiency (PAE) of 27%, a saturated output power <tex xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">${\\boldsymbol(P_{\\mathbf{sat}})}$</tex> of 17 dBm, and an output 1-dB compression point <tex xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">$\\left(\\boldsymbol{P}_{1 \\mathbf{dB}}\\right)$</tex> of 13.4 dBm."
  },
  {
    "date": "2026-2-23",
    "title": "CricTAL: Introducing Temporal Activity Localisation Using Pose Estimation to Identify Key Phases in Cricket Batting for Downstream Action Quality Assessment",
    "authors": "Tevin Moodley, Dustin van der Haar",
    "publish": "2025 IEEE/CVF International Conference on Computer Vision Workshops (ICCVW)",
    "url": "https://doi.org/10.1109/iccvw69036.2025.00285",
    "source": "IEEE",
    "abstract": "This paper presents CricTAL, a novel framework for Temporal Activity Localisation (TAL) in cricket batting that leverages pose-estimated keypoints to segment and classify the distinct phases of a batting stroke: buildup, execution, and follow-through. Unlike traditional cricket video analysis methods, which typically focus on action classification, broadcast cues, and highlight detection using RGB footage. CricTAL reframes the problem as a fine-grained temporal activity localisation task that works with poses, enabling precise localisation of stroke phases in untrimmed video. This paper implements and evaluates LSTM, RNN, TCN, and Transformer-based experiments based on two modelling strategies: a classification window approach and a sliding window approach. The experiments are trained and tested on our newly released uj-aqa-cricketvision dataset, which contains annotated stroke-phase labels and pose key-points extracted from test cricket matches. Trained exclusively on pose data, our best-performing model, a TCN, achieves a test accuracy of 90.4% and a mean Average Precision (mAP)@0.5 of 64.45%, demonstrating its robustness in identifying phase boundaries. By introducing a pose-only TAL formulation to the cricket domain, CricTAL enables the generation of aligned, interpretable phase boundaries that can directly support downstream Action Quality Assessment (AQA), where phase-wise scoring demands temporally segmented input."
  },
  {
    "date": "2026-2-23",
    "title": "NaVIP: A Low-Cost, Infrastructure-Free Indoor Navigation Solution for Visually Impaired Persons",
    "authors": "Jun Yu, Yitian Yang, Vinod Namboodiri",
    "publish": "2025 IEEE/CVF International Conference on Computer Vision Workshops (ICCVW)",
    "url": "https://doi.org/10.1109/iccvw69036.2025.00265",
    "source": "IEEE",
    "abstract": "Navigating indoor environments presents significant challenges due to the absence of satellite signals. These challenges are further compounded for visually impaired persons (VIPs), who cannot rely on wayfinding signage for orientation. While traditional sensor-based solutions (e.g., Bluetooth and Wi-Fi) can provide coarse localization, they lack the precision necessary to assist VIPs during the last-meter accessibility challenge—the critical final phase of navigation where the user is near their intended destination (e.g., a specific door or room) but cannot precisely identify or align with it due to the lack of fine-grained, accessible cues. Moreover, existing approaches often require the deployment of hardware (e.g., beacons or tags) throughout indoor spaces to calibrate Points of Interest (PoIs), limiting scalability and incurring high costs for in-stallation and maintenance. To address these limitations, we propose NaVIP (Navigation for VIPs), a deep learning-based indoor navigation system tailored for VIPs. NaVIP is a cost-effective, infrastructure-free, and scalable solution that leverages annotated PoIs extracted from ubiquitous floor plan images to predict a user's position and orientation in an end-to-end manner. We simultaneously evaluate NaVIP's localization accuracy and robustness within a large and complex research facility and develop an iOS application to demonstrate its real-world applicability. Field tests with VIP end users show promising results, highlighting the usability and effectiveness of NaVIP in supporting indoor navigation."
  },
  {
    "date": "2026-2-23",
    "title": "Demographic Differentials in Face Image Quality: Evaluation and Comparison on Real and Synthetic Data",
    "authors": "A. Dörsch, J. Merkle, B. Tams, G. Gutierrez Alvarez, P. Munch, C. Busch, C. Rathgeb",
    "publish": "2025 IEEE/CVF International Conference on Computer Vision Workshops (ICCVW)",
    "url": "https://doi.org/10.1109/iccvw69036.2025.00618",
    "source": "IEEE",
    "abstract": "In this work, we investigate potential demographic differentials of quality measures used in the Open Source Face Image Quality (OFIQ) framework. We analyse biometric sample quality of real and synthetic face images across different ethnicities. In addition, we investigate whether the use of synthetic face images is suitable for analysing face image quality assessment algorithms and whether performance trends are consistent between real and synthetic data. Our analysis reveals problematic demographic differentials in the observed quality measures, particularly in the Luminance mean measure with major quality score deviations across ethnic groups. For quality measures that address exposure and brightness patterns, it is particularly noticeable that individuals with darker skin tones tend to have higher discard rates than other individuals, suggesting unfair decision-making. Our findings demonstrate that the overall trend of demographic differentials between synthetic and real identities in our test set is largely similar, with minor exceptions. This underlines both the problematic presence of demographic bias patterns in the observed quality measures across synthetic and real identities and the potential of synthetic data for assessing biases in face image quality assessment algorithms, provided that quality deficiencies are present in appropriate variance."
  },
  {
    "date": "2026-2-23",
    "title": "Investigation of Assessment Techniques for Analysis of Muscle Fatigue",
    "authors": "Sofia Bobby J, Annapoorani CL, Subha Ramya V, Femina M A",
    "publish": "2025 3rd DMIHER International Conference on Artificial Intelligence in Healthcare, Education and Industry (IDICAIHEI)",
    "url": "https://doi.org/10.1109/idicaihei65991.2025.11378763",
    "source": "IEEE",
    "abstract": "For workers in numerous industries, fatigue is a serious safety risk. Measuring human weariness is crucial to improving an individual's productivity at work, increasing overall safety, and attaining more work efficiency. By knowing an athlete's fatigue threshold, they can design workouts that push them to adapt without leading to overtraining or injury. Fatigue can compromise muscle control and joint stability, significantly increasing the risk of strains, sprains, and other injuries. Unexplained or persistent muscle fatigue can be a symptom of various medical conditions, including neurological disorders, metabolic syndromes, or chronic fatigue syndrome. In the workplace, particularly for physically demanding jobs, measuring muscle fatigue can help identify tasks that are a high risk for musculoskeletal disorders. Many studies analyze human weariness using various physiological signal characteristics. To identify a person's level of stress and exhaustion, several physiological signals are studied, including Blood Volume Pulse (BVP), Electromyogram (EMG), Galvanic Skin Response (GSR), Electrocardiogram (ECG), and Respiratory signals. It also goes over the several classification strategies that studies have employed to determine when someone is fatigued. This study offers a thorough analysis of the identification of stress and exhaustion using a range of physiological indicators. It also seeks to identify the best attributes and methods for effectively evaluating human tiredness and stress."
  },
  {
    "date": "2026-2-23",
    "title": "Interpretable Advanced Machine Learning Models for Early Identification of Health Insurance Claim Fraud Detection",
    "authors": "Bhulakshmi Makkena",
    "publish": "2026 IEEE 5th International Conference on AI in Cybersecurity (ICAIC)",
    "url": "https://doi.org/10.1109/icaic67076.2026.11395854",
    "source": "IEEE",
    "abstract": "Healthcare is a vital aspect of human life and should be affordable, and the healthcare system is a complex and fast-growing system, which is getting more and more burdened by fraud. Medical insurance systems have turned out to be very vulnerable to abuse, and detecting fraud manually is laborious and ineffective. In this regard, the Kaggle Healthcare Provider Fraud Detection dataset, which includes provider, beneficiary, inpatient, and outpatient records, was used in the study. Label encoding, SMOTE on class imbalance, ANOVA f-test on feature selection, and minmax normalization were used to do preprocessing and it was followed by a train-test split. Two advanced ML models, Support Vector Machine (SVM) and LightGradient Boosting Machine (LightGBM) were tested and compared with Decision Trees, XGBoost, Logistic Regression and LSTM. The findings showed that LightGBM performed better in accuracy (93%), precision (95%), recall (98%), and F1 score (96.5) whereas SVM reported the highest recall (100%), but lower precision (92%). LightGBM offered balanced and robust detection compared to existing models but SVM had high sensitivity. This paper finds that interpretable advanced machine learning strategies can play a significant part in improving early fraud detection and have practical advantages in minimizing financial losses and increasing the efficiency of the healthcare system."
  },
  {
    "date": "2026-2-23",
    "title": "AI-Based Cross-Layer Vulnerability Management for Cloud-Native Systems",
    "authors": "Oleh Polishchuk, Kateryna Babii",
    "publish": "2026 IEEE 5th International Conference on AI in Cybersecurity (ICAIC)",
    "url": "https://doi.org/10.1109/icaic67076.2026.11395769",
    "source": "IEEE",
    "abstract": "Cloud-native systems introduce complex and dynamic attack surfaces driven by microservice architectures, identity-centric access models, and continuously evolving runtime behavior. Traditional vulnerability management approaches rely on static severity scoring and siloed security signals, resulting in excessive alert noise and limited insight into real-world exploitability.This paper presents a novel AI-driven cross-layer vulnerability management framework that models exploitation risk as an evolving behavioral process rather than a static property of individual vulnerabilities. The proposed approach represents cloud-native environments as temporal cross-layer graphs and applies self-supervised sequence learning, graph-based risk propagation, and anomaly detection to identify multi-stage exploitation paths spanning application, identity, runtime, and endpoint layers.Unlike conventional prioritization techniques, the framework learns how risk propagates across layers over time and adapts to previously unseen attack strategies without reliance on labeled exploit data. A simulated Kubernetes-based case study demonstrates substantial alert noise reduction while preserving exploitation-relevant signals, outperforming severity-based and rule-based correlation approaches."
  },
  {
    "date": "2026-2-23",
    "title": "Deep Learning Based Diagnostic Framework for Pancreatic Cancer Detection Using CT- Images",
    "authors": "Meghna Panara, Vikas Tulshyan, Premal Patel",
    "publish": "2025 1st IEEE Uttar Pradesh Section Women in Engineering International Conference on Electrical Electronics and Computer Engineering (UPWIECON)",
    "url": "https://doi.org/10.1109/upwiecon67212.2025.11390137",
    "source": "IEEE",
    "abstract": "Pancreatic cancer remains one of the most fatal malignancies due to its asymptomatic nature in early stages and limited effectiveness of traditional diagnostic methods. This paper presents a comprehensive deep learning framework for early detection of pancreatic cancer using CT scan imaging data from Pancreas-CT-SEG dataset. The framework includes preprocessing techniques such as global thresholding, adaptive thresholding, and Canny edge detection, followed by classification using various deep learning models including Custom CNN, MobileNetV2, ResNet50, InceptionV3, and VGG16. Among these, Inception V3achieved the highest performance, demonstrating a training accuracy of 99.29%, validation accuracy of 99.00%, and near-perfect Fl-scores for both cancerous and non-cancerous classes. The model also maintained high confidence in its predictions, minimizing ambiguity in clinical decisions. This work highlights the potential of advanced deep learning models, particularly Inception V3,to significantly enhance diagnostic accuracy and reliability in pancreatic cancer screening, providing a promising direction for real-world medical applications."
  },
  {
    "date": "2026-2-23",
    "title": "Hierarchical X-Ray Recognition for Obsolete Semiconductor Chips Combining Rule-Driven and Deep Learning Approaches",
    "authors": "Tong Ru, Hao Li, Yihui Li, Jianwen Wu, Chao Liu, Ruiqiang Lu, Zhiming Liang, Yongjie Chen, Zheng Wu, Bingfeng Li, Junjie Li",
    "publish": "2025 IEEE International Conference on Robotics and Biomimetics (ROBIO)",
    "url": "https://doi.org/10.1109/robio66223.2025.11376108",
    "source": "IEEE",
    "abstract": "This paper addresses the challenge of defect inspection and solid-waste determination for obsolete semiconductor chips (also referred to as end-of-life chips, which in customs inspection may be classified as solid waste depending on defect assessment) using single-view X-ray imaging. Conventional rulebased approaches are limited by rigid parameter settings and weak adaptability to heterogeneous chip morphologies. We propose a hierarchical recognition framework that integrates rule-driven measurements with deep learning models, enhanced by self-training, Self-Refine optimization, and knowledge distillation. The system supports lightweight deployment on edge X-ray devices, achieving accurate recognition of normal chips and reliable classification of severe, internal-minor, and external solder-ball defects. Experimental results demonstrate that the proposed method provides both high accuracy and realtime performance, offering a practical solution for automated customs inspection and for solid-waste classification in resource recycling workflows."
  },
  {
    "date": "2026-2-23",
    "title": "SlimComm: Doppler-Guided Sparse Queries for Bandwidth-Efficient Cooperative 3-D Perception",
    "authors": "Melih Yazgan, Qiyuan Wu, Iramm Hamdard, Shiqi Li, J. Marius Zoellner",
    "publish": "2025 IEEE/CVF International Conference on Computer Vision Workshops (ICCVW)",
    "url": "https://doi.org/10.1109/iccvw69036.2025.00190",
    "source": "IEEE",
    "abstract": "Collaborative perception allows connected autonomous vehicles (CAVs) to overcome occlusion and limited sensor range by sharing intermediate features. Yet transmitting dense Bird's-Eye-View (BEV) feature maps can overwhelm the bandwidth available for inter-vehicle communication. We present SlimComm, a communication-efficient framework that integrates 4D radar Doppler with a query-driven sparse scheme. SlimComm builds a motion-centric dynamic map to distinguish moving from static objects and generates two query types: (i) reference queries on dynamic and high-confidence regions, and (ii) exploratory queries probing occluded areas via a two-stage offset. Only query-specific BEV features are exchanged and fused through multi-scale gated deformable attention, reducing payload while preserving accuracy. For evaluation, we release OPV2V-R and Adver-City-R, CARLA-based datasets with per-point Doppler radar. SlimComm achieves up to 90% lower bandwidth than full-map sharing while matching or surpassing prior baselines across varied traffic densities and occlusions. Dataset and code will be available at: https://url.fzi.de/SlimComm."
  },
  {
    "date": "2026-2-23",
    "title": "Application of Semantic Segmentation on SEM Images of Rubber Composites and Verification of Correlation with Material Properties",
    "authors": "Sho Sakamoto, Wakana Miyoshi, Kentaro Oishi, Ryuta Asami, Akira Kobayashi, Hiroki Iwana, Taichi Tokunaga, Yosuke Motohashi",
    "publish": "2025 IEEE/CVF International Conference on Computer Vision Workshops (ICCVW)",
    "url": "https://doi.org/10.1109/iccvw69036.2025.00380",
    "source": "IEEE",
    "abstract": "This study aims to apply semantic segmentation to scanning electron microscopy (SEM) images of rubber composites and quantitatively and comprehensively evaluate the correlation between extracted image features and physical properties. Traditionally, SEM image analysis of rubber composites composed of multiple fillers and polymers has relied on visual and qualitative assessments. However, by employing a model based on the U-Net architecture, we achieved high-precision pixel-level segmentation of filler and polymer regions. A multi-class classification model was constructed targeting quaternary SEM images. Expert-annotated images were used as training data, and the model's performance was quantitatively evaluated using the F1 score. The evaluation results demonstrated that the model attained sufficient segmentation accuracy. Furthermore, correlation analysis between fundamental features (e.g., particle size, perimeter, inter-aggregate distance) and physical properties revealed that formulation conditions influence the mechanical properties of rubber composites, and this influence can be visualized. The findings of this study propose a novel approach for quantitative and automated SEM image analysis of rubber composites and serve as a powerful tool for understanding structure–property relationships in material design and defect analysis."
  },
  {
    "date": "2026-2-23",
    "title": "Predictive Modelling of Art Patient Status Using Machine Learning: A Comparative Study of Classification Algorithms",
    "authors": "Chinyere Perpetua Okechukwu, Mohd Basheeruddin, Amir Ahmad Dar, Sana Qausain, S. Sindhuja, Okechukwu J. Obulezi",
    "publish": "2025 3rd DMIHER International Conference on Artificial Intelligence in Healthcare, Education and Industry (IDICAIHEI)",
    "url": "https://doi.org/10.1109/idicaihei65991.2025.11377576",
    "source": "IEEE",
    "abstract": "Accurate prediction of Antiretroviral Therapy (ART) status is vital for improving the continuity of care and health outcomes among HIV-positive patients. This study investigates the effectiveness of machine learning algorithms in classifying ART patient status into three categories: Active, Lost to Follow-Up (LTFU), and Missed Appointment. Using realworld clinical and demographic data, we evaluate the performance of five models-Random Forest, XGBoost, Support Vector Machine (SVM), Artificial Neural Network (ANN), and Logistic Regression. Each model was assessed using standard evaluation metrics, including accuracy, weighted precision, recall, and F1-score. Among the models, XGBoost demonstrated superior performance, achieving the highest accuracy of 0.8918 and a weighted F1-score of 0.89177, followed closely by Random Forest. The findings underscore the potential of machine learning in enhancing data-driven decision-making within ART programs, particularly for identifying patients at risk of treatment discontinuation or loss to follow-up, ultimately contributing to improved patient outcomes. These findings highlight the potential of machine learning to enhance datadriven decision-making in ART programs by accurately identifying patients at risk of treatment discontinuation or inconsistent clinic attendance. Such predictive insights can inform targeted interventions and improve overall patient management."
  },
  {
    "date": "2026-2-23",
    "title": "Warehouse Spatial Question Answering with LLM Agent 1st Place Solution of the 9th AI City Challenge Track 3",
    "authors": "Hsiang-Wei Huang, Pyongkun Kim, Jen-Hao Cheng, Kuang-Ming Chen, Cheng-Yen Yang, Bahaa Alattar, Yi-Ru Lin, Sangwon Kim, Kwangju Kim, Chung-I Huang, Jenq-Neng Hwang",
    "publish": "2025 IEEE/CVF International Conference on Computer Vision Workshops (ICCVW)",
    "url": "https://doi.org/10.1109/iccvw69036.2025.00550",
    "source": "IEEE",
    "abstract": "Spatial understanding has been a challenging task for existing Multi-modal Large Language Models (MLLMs). Previous methods leverage large-scale MLLM finetuning to enhance MLLM's spatial understanding ability. In this paper, we present a data-efficient approach. We propose a LLM agent system with strong and advanced spatial reasoning ability, which can be used to solve the challenging spatial question answering task in complex indoor warehouse scenarios. Our system integrates multiple tools that allow the LLM agent to conduct spatial reasoning and API tools interaction to answer the given complicated spatial question. Extensive evaluations on the 2025 AI City Challenge Physical AI Spatial Intelligence Warehouse dataset demonstrate that our system achieves high accuracy and efficiency in tasks such as object retrieval, counting, and distance estimation. The code is available at: https://github.com/hsiangwei0903/SpatialAgent."
  },
  {
    "date": "2026-2-23",
    "title": "Research on Non-Cascaded Constrained Model Predictive Control for Direct-Drive Permanent Magnet Synchronous Wind Generators",
    "authors": "Tailong Xiong, Shihong Gan",
    "publish": "2025 6th International Conference on Smart Grid and Energy Engineering (SGEE)",
    "url": "https://doi.org/10.1109/sgee68429.2025.11385430",
    "source": "IEEE",
    "abstract": "Direct-drive permanent magnet synchronous generators (PMSG) have been widely applied in the field of wind power generation because of advantages such as high transmission efficiency and low operation and maintenance costs. However, this type of generator imposes more stringent requirements on the coordinated control accuracy of angular speed and current, as well as the protection of devices. To address the issues that the cascaded structure of traditional PI control is unable to achieve global optimization of the system, the unconstrained model predictive control (MPC) with non-cascaded structure is prone to cause excessive current, and when the maximum power point tracking (MPPT) mode cannot be normally switched to the constant power mode above the rated wind speed, the reference angular speed is too large, resulting in the actual angular speed of PI and unconstrained MPC exceeding the limit, this paper designs a non-cascaded constrained model predictive control (CMPC) suitable for direct-drive wind generators. By comparing the simulation results of the proposed CMPC with those of unconstrained MPC and PI control, it is verified that CMPC has better control performance and stronger constraint capability."
  },
  {
    "date": "2026-2-23",
    "title": "PreciVision: An integrated platform for multiple diseases detection Using CNN model",
    "authors": "Akshat Tiwari, Sujal Pandey, Shweta Ashtekar",
    "publish": "2025 3rd DMIHER International Conference on Artificial Intelligence in Healthcare, Education and Industry (IDICAIHEI)",
    "url": "https://doi.org/10.1109/idicaihei65991.2025.11378016",
    "source": "IEEE",
    "abstract": "PrecivisioN is a powerful diagnostic tool that ables to identify brain tumors, kidney problems, and cancers in the lungs and colon. This is a smart medical diagnostic system designed to help doctors identify critical health conditions using advanced AI. It combines several specialized services, each focused on a different area of medical diagnosis: NeuroVision for brain tumors, NephroVision for kidney diseases, and PulmoVision for lung and colon cancers. Using powerful deep learning models like CNN and VGG16, PreciVision analyzes medical images with remarkable accuracy of 93.5 % for NeuroVision, 98.2 % for PulmoVision and 98% for NephroVision. It has been used in categorizing several cancer types, and accurately diagnosing conditions such as lung adenocarcinoma and colorectal adenocarcinoma."
  },
  {
    "date": "2026-2-23",
    "title": "Metaheuristic-Enhanced Deep Learning Models for Network Anomaly Detection: Evaluation and Future Outlook",
    "authors": "T. Anupama Thankam, Y. Jeya Sheela",
    "publish": "2025 1st IEEE Uttar Pradesh Section Women in Engineering International Conference on Electrical Electronics and Computer Engineering (UPWIECON)",
    "url": "https://doi.org/10.1109/upwiecon67212.2025.11390409",
    "source": "IEEE",
    "abstract": "This work systematically examines recent advancements in Deep Learning (DL) Convolutional Neural Networks (CNNs), Recurrent Neural Networks (RNNs), Long Short-Term Memory (LSTM), autoencoders (AE), Generative Adversarial Networks (GANs), transformer-based architectures, and other models for anomaly detection in network traffic. It demonstrated significant proficiency in learning complex temporal-spatial patterns and detecting minute anomalies in high-dimensional data. Further, optimization techniques including Genetic techniques (GA), Particle Swarm Optimization (PSO), Ant Colony Optimization (ACO), Whale Optimization Algorithm (WOA), and Grey Wolf Optimizer (GWO) to further improve the performance of these DL models. Finally, this study compares previous DL and metaheuristic combinations for network anomaly detection, highlighting their advantages and disadvantages. Overall, this work demonstrates the LSTM-GWO combination provides the highest accuracy of 98.56% and the lowest error prediction."
  },
  {
    "date": "2026-2-23",
    "title": "Machines that can Imagine: The Instruments and Methods Used in Generative AI Art",
    "authors": "Ashish Sharma, Rinku Sharma",
    "publish": "2025 14th International Conference on System Modeling &amp;amp; Advancement in Research Trends (SMART)",
    "url": "https://doi.org/10.1109/smart66937.2025.11389317",
    "source": "IEEE",
    "abstract": "Generative AI represents a first-rate bounce in device gaining knowledge of, enabling machines to create totally new content-from sensible snap shots to stylized art-by means of learning styles from vast datasets. The operating concepts behind tools like DALL'E 2, strong Diffusion, and Midjourney show how AI can translate textual descriptions into visual content material through superior models like diffusion networks and GANs. It doesn't without a doubt retrieve or remix current facts; it synthesizes new content material based on what it has found out. gear differ in style, customization, and accessibility, giving users a selection of ways to create-from hyper-sensible visuals to dreamlike art. Diffusion fashions are presently the most powerful and broadly used for photograph era because of their capacity to provide high quality, precise, and controllable outputs."
  },
  {
    "date": "2026-2-23",
    "title": "Efficient Real-World Deblurring Using Single Images: AIM 2025 Challenge Report",
    "authors": "Daniel Feijoo, Paula Garrido-Mellado, Marcos V. Conde, Jaesung Rim, Alvaro Garcia, Sunghyun Cho, Radu Timofte",
    "publish": "2025 IEEE/CVF International Conference on Computer Vision Workshops (ICCVW)",
    "url": "https://doi.org/10.1109/iccvw69036.2025.00602",
    "source": "IEEE",
    "abstract": "This paper reviews the AIM 2025 Efficient Real-World Deblurring using Single Images Challenge, which aims to advance in efficient real-blur restoration. The challenge is based on a new test set based on the well known RS-Blur dataset. Pairs of blur and degraded images in this dataset are captured using a double-camera system. Participant were tasked with developing solutions to effectively deblur these type of images while fulfilling strict efficiency constraints: fewer than 5 million model parameters and a computational budget under 200 GMACs. A total of 71 participants registered, with 4 teams finally submitting valid solutions. The top-performing approach achieved a PSNR of 31.1298 dB, showcasing the potential of efficient methods in this domain. This paper provides a comprehensive overview of the challenge, compares the proposed solutions, and serves as a valuable reference for researchers in efficient real-world image deblurring."
  },
  {
    "date": "2026-2-23",
    "title": "Smart Routing for Multimodal Video Retrieval: When to Search What",
    "authors": "Kevin Dela Rosa",
    "publish": "2025 IEEE/CVF International Conference on Computer Vision Workshops (ICCVW)",
    "url": "https://doi.org/10.1109/iccvw69036.2025.00434",
    "source": "IEEE",
    "abstract": "We introduce ModaRoute, an LLM-based intelligent routing system that dynamically selects optimal modalities for multimodal video retrieval. While dense text captions can achieve 75.9% Recall@5, they require expensive offline processing and miss critical visual information present in 34% of clips with scene text not captured by ASR. By analyzing query intent and predicting information needs, ModaRoute reduces computational overhead by 41% while achieving 60.9% Recall@5. Our approach uses GPT-4.1 to route queries across ASR (speech), OCR (text), and visual indices, averaging 1.78 modalities per query versus exhaustive 3.0 modality search. Evaluation on 1.8M video clips demonstrates that intelligent routing provides a practical solution for scaling multimodal retrieval systems, reducing infrastructure costs while maintaining competitive effectiveness for real-world deployment."
  },
  {
    "date": "2026-2-23",
    "title": "Temporal Multimodal Memory Banks for Agentic Reasoning",
    "authors": "Prasanth Yadla",
    "publish": "2025 IEEE/CVF International Conference on Computer Vision Workshops (ICCVW)",
    "url": "https://doi.org/10.1109/iccvw69036.2025.00675",
    "source": "IEEE",
    "abstract": "Current multimodal AI agents process inputs in isolation, lacking the ability to maintain and reason over episodic memories across extended time horizons. We introduce ChronoMem<sup xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">1</sup><sup xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">1</sup>https://github.com/TransformerTitan/ChronoMem, a novel architecture that enables agents to store, consolidate, and retrieve multimodal experiences for enhanced temporal reasoning. ChronoMem employs hier-archical memory encoding, cross-modal temporal indexing, and experience-guided retrieval to capture temporal dependencies across visual, audio, and textual modalities. Through comprehensive evaluation on three adapted public benchmark tasks spanning navigation (AVLMaps), human interaction (MTPChat), and scientific assistance (RVTALL), we demonstrate that ChronoMem achieves consistent but modest improvements over memory-augmented baselines: 3.3% average improvement in long-term task performance compared to extended context methods and 3.7% better memory retrieval accuracy compared to systems without persistent memory. Our work addresses fundamental limitations in current agentic systems and provides a principled approach for incorporating episodic memory into mul-timodal AI agents."
  },
  {
    "date": "2026-2-23",
    "title": "Hybrid Intelligence Endpoint Defense (HIED): A Data-Fusion Approach for Proactive Malware Detection",
    "authors": "Michał Jaworski, Bahareh Pahlevanzadeh",
    "publish": "2026 IEEE 5th International Conference on AI in Cybersecurity (ICAIC)",
    "url": "https://doi.org/10.1109/icaic67076.2026.11395833",
    "source": "IEEE",
    "abstract": "We present Hybrid Intelligence Endpoint Defense (HIED), which combines Endpoint Detection and Response (EDR) telemetry with Cyber Threat Intelligence (CTI) to improve malware detection using data already available in enterprises. We use Windows 10 Sysmon logs (synthetic and real) and enrich them with AlienVault Open Threat Exchange (OTX) indicators (e.g., domains, IPs, hashes). We evaluate four ways to fuse the two sources: feature-level (early), decision-level (late) with two variants, and a combined scheme, training Random Forest, XGBoost, and Local Outlier Factor. Rather than attaching CTI via post-hoc lookups, we inject CTI at the feature stage and measure early versus late fusion directly. Early fusion performs best, raising the Matthews Correlation Coefficient from 0.94 (EDR-only) to 0.98, increasing recall from 87.58% to 99.60%, and cutting the false-positive rate from 0.09% to 0.02% on a held-out validation set. The gains come from adding external threat context that helps the classifier separate benign activity from ransomware-like behavior, reducing alert fatigue. The study fits ICAIC’2026 Tracks 8 (AI in Cyber Security), 12 (AI in Malware Analysis/Digital Forensics), and 6 (AI in IT Infrastructure) and shows that standard Sysmon logs plus open CTI can go further—no new sensors required. We also note deployment considerations and current limitations, and we outline next steps: real-time fusion, multi-feed CTI, and broader malware coverage."
  },
  {
    "date": "2026-2-23",
    "title": "Equilibrium Manifold Tracking Control of Four-Link Active Ankle Assist Mechanism for Human Motion Stability",
    "authors": "Kotone Takano, Jun Ishikawa",
    "publish": "2025 IEEE International Conference on Robotics and Biomimetics (ROBIO)",
    "url": "https://doi.org/10.1109/robio66223.2025.11378054",
    "source": "IEEE",
    "abstract": "This paper proposes a wearable assistive device incorporating actively controlled ankle joints to enhance human motion stability and presents a numerical feasibility analysis. Specifically, the device is designed to actively drive two degrees of freedom at the ankle joint, corresponding to dorsiflexion/plantarflexion and inversion/eversion, which are implemented in the mechanism as two independently actuated joints. As a first step, the single-leg support phase of human gait is modeled using a four-link mechanism in which only the two ankle joints are actively actuated. The proposed control method combines state-feedback control, composite center-of-mass (CoM) position regulation, and gravity compensation. This enables the four-link mechanism, including a passive two-degree-of-freedom ground contact at the foot, to be stabilized around equilibrium points while tracking the desired joint trajectories. Furthermore, gain-scheduling control is introduced, which improves robustness against external disturbance forces. The effectiveness of the proposed method is verified through numerical simulations, which demonstrate that stable trajectory tracking of all four joints can be achieved without falling, even under external disturbance forces. These findings provide fundamental insights into the design of compact and efficient assistive devices for whole-body balance stabilization using localized ankle control."
  },
  {
    "date": "2026-2-23",
    "title": "Unsupervised Learning Approach for Polycystic Ovary Syndrome Diagnosis Through CNN Feature Extraction and Clustering Algorithms",
    "authors": "Chilumurun Suneetha, V. Lokeswara Reddy",
    "publish": "2025 5th International Conference on Artificial Intelligence and Signal Processing (AISP)",
    "url": "https://doi.org/10.1109/aisp68263.2025.11396234",
    "source": "IEEE",
    "abstract": "Polycystic Ovary Syndrome (PCOS) is a complex endocrine disorder affecting women of reproductive age, and early detection is critical for effective management. In this study, we performed data preprocessing, feature extraction, and used clustering algorithms to improve PCOS detection. The dataset underwent resizing, gray scale conversion and noise removal during preprocessing to enhance data quality. Features were extracted using a pre-trained ResNet50 convolutional neural network, leveraging its deep hierarchical representations for robust feature learning. These extracted features were then utilized by clustering algorithms, including DBSCAN, OPTICS, K-means and BIRCH, to group patient samples and identify underlying patterns without explicit labels. Experimental results demonstrated that the combination of ResNet50-based feature extraction and clustering achieved better separability between PCOS and non-PCOS groups compared to raw data clustering. The findings highlight the potential of coupling deep feature extraction with unsupervised learning for PCOS detection and suggest a promising direction for developing scalable, automated, and label-independent diagnostic support systems."
  },
  {
    "date": "2026-2-23",
    "title": "FusionEnsembleNet: An Attention-Based Ensemble of Spatiotemporal Networks for Multimodal Sign Language Recognition",
    "authors": "Md. Milon Islam, Md Rezwanul Haque, S M Taslim Uddin Raju, Fakhri Karray",
    "publish": "2025 IEEE/CVF International Conference on Computer Vision Workshops (ICCVW)",
    "url": "https://doi.org/10.1109/iccvw69036.2025.00517",
    "source": "IEEE",
    "abstract": "Accurate recognition of sign language in healthcare communication poses a significant challenge, requiring frameworks that can accurately interpret complex multimodal gestures. To deal with this, we propose FusionEnsembleNet, a novel attention-based ensemble of spatiotemporal networks that dynamically fuses visual and motion data to enhance recognition accuracy. The proposed approach processes RGB video and range Doppler map radar modalities synchronously through four different spatiotemporal networks. For each network, features from both modalities are continuously fused using an attention-based fusion module before being fed into an ensemble of classifiers. Finally, the outputs of these four different fused channels are combined in an ensemble classification head, thereby enhancing the model's robustness. Experiments demonstrate that FusionEnsembleNet outperforms state-of-the-art approaches with a test accuracy of 99.44% on the large-scale MultiMeDaLIS dataset for Italian Sign Language. Our findings indicate that an ensemble of diverse spatiotemporal networks, unified by attention-based fusion, yields a robust and accurate framework for complex, multimodal isolated gesture recognition tasks. The source code is available at: https://github.com/rezwanh001/Multimodal-Isolated-Italian-Sign-Language-Recognition."
  },
  {
    "date": "2026-2-23",
    "title": "Analysis of Boost Converter Control Performance Considering Output Capacitor Design",
    "authors": "Geon-Hak Park, Tae-Seok Kang, Hyun-Jin Jin, Jihun So, YoungGyu Jin, Yeong-Jun Choi",
    "publish": "2025 6th International Conference on Smart Grid and Energy Engineering (SGEE)",
    "url": "https://doi.org/10.1109/sgee68429.2025.11385784",
    "source": "IEEE",
    "abstract": "The boost converter is widely used in various applications due to its high-power density and efficiency, while its controller design becomes more complex depending on the output capacitance. Therefore, this paper analyzes the effect of output capacitor variation on the dynamic response and control performance of a boost converter. Control stability is analyzed by varying the capacitance using bode plot, root locus, and nyquist plot in the frequency domain. The analysis results are verified on a 2 kW, 380 V boost converter using a Hardware-in-the-loop (HIL) based RT-Box. Based on these results, design guidelines for selecting appropriate capacitor values in boost converter applications are proposed."
  },
  {
    "date": "2026-2-23",
    "title": "Detection and Classification of Edible Mushrooms Using Deep Learning Model YOLOv12s for Market Authentication",
    "authors": "Vivek Kumar, Md Iqbal, Mridula Singh, Sachin Ranjan, Gautam Tyagi",
    "publish": "2025 1st IEEE Uttar Pradesh Section Women in Engineering International Conference on Electrical Electronics and Computer Engineering (UPWIECON)",
    "url": "https://doi.org/10.1109/upwiecon67212.2025.11390139",
    "source": "IEEE",
    "abstract": "This research focuses on the identification of eight types of edible mushrooms using the advanced object detection model YOLOv12s. The main purpose of this system is to assist consumers in precisely identifying mushrooms available in the market, thereby preventing potential fraud and ensuring that they purchase the exact variety they intend to buy. The dataset for training the model was compiled from local markets and online sources such as Google. Dataset was split into 70% for training, 15% for validation, and 15% for testing. The YOLOv12s model was trained over 150 epochs, achieving an impressive classification accuracy of approximately 97%. The eight mush- room classes identified by the model are Cremini Mushrooms, Enoki Mushroom, Morel Mushrooms, Oyster Mushroom, Paddy Straw Mushroom, Portobello Mushrooms, Shiitake Mushroom and White Button Mushrooms. This system provides a reliable and practical solution for both consumers and vendors to verify the authenticity and quality of edible mushrooms, promoting safer consumption and reducing the risk of misidentification."
  },
  {
    "date": "2026-2-23",
    "title": "Modular Combination Strategies for Chiral Origami Mechanisms Based on Screw Theory",
    "authors": "Zhongyu Chen, Mi Li, Jinghui Re, Huijuan Feng, Jian S. Dai",
    "publish": "2025 IEEE International Conference on Robotics and Biomimetics (ROBIO)",
    "url": "https://doi.org/10.1109/robio66223.2025.11379783",
    "source": "IEEE",
    "abstract": "The right-handed-motion (RHM) and left-handed-motion (LHM) chiral dual-spherical-4R units, inspired by the egg-box origami mechanism, possess excellent folding/unfolding performance and modular connection characteristics. This paper investigates the modular combination strategies of the 1-DoF chiral units based on screw theory. By extending the units with two additional links, a basic dual-ring combination unit composed of one spherical and one planar 4R mechanism is constructed. Based on screw theory and topological analysis, it is demonstrated that this unit's 1-DoF property remains unchanged during multi-module combination, ensuring consistent controllability in reconfiguration. Furthermore, we explored different chiral combination strategies of the units. A generalized input-output equation that captures the relationship between chirality arrangements and the displacement and rotation at the output end is proposed. Finally, these combination strategies are verified by a geometric optimized chiral units prototype, providing a novel solution for robotic design in intelligent manufacturing."
  },
  {
    "date": "2026-2-23",
    "title": "Modeling of Multiple Grid-Forming Devices and Analysis of Oscillation Mechanisms",
    "authors": "Qingxi Duan, Yu Duan, Xing Ma, Jian Ma, Jiahao Guo, Zhibang Shen",
    "publish": "2025 6th International Conference on Smart Grid and Energy Engineering (SGEE)",
    "url": "https://doi.org/10.1109/sgee68429.2025.11385616",
    "source": "IEEE",
    "abstract": "The parallel operation of multiple grid-forming (GFM) converters under low-impedance conditions poses significant challenges to system stability. However, gaps remain in the existing literature regarding the small-signal modeling and accurate stability analysis of such multi-converter parallel systems, particularly within the context of low-impedance grids. This paper investigates the stability issues associated with the parallel operation of multiple GFM converters under low-impedance conditions. Initially, a state-space model for the multi-converter parallel system is developed. Subsequently, eigenvalue trajectory and dominant oscillation mode participation factor analyses are employed to investigate the impact of key parameters. The analysis reveals that under low-impedance operating conditions, the system's dominant eigenvalues migrate towards the unstable region as the grid strength increases or the coupling impedance decreases, thereby causing stability degradation. Finally, time-domain simulations conducted in MATLAB/Simulink validate these findings."
  },
  {
    "date": "2026-2-23",
    "title": "Machine Learning-Based Leak Detection in Urban Water Distribution Networks",
    "authors": "Tanay Kulkarni, Ayush Singh, Suchith Goud Arella",
    "publish": "2025 14th International Conference on System Modeling &amp;amp; Advancement in Research Trends (SMART)",
    "url": "https://doi.org/10.1109/smart66937.2025.11389665",
    "source": "IEEE",
    "abstract": "Water distribution networks (WDNs) in cities are characterized by substantial losses in the operating and economic level because there is no detection of leakage, and the early identification and accurate localization are the urgent research interests. Although recent improvements in machine learning (ML) have been very promising, the existing systems are still limited to the problems of scarcity of data, sim-to-real generalization, sensor sparsity, and lack of generalization over heterogeneous networks. The old, supervised models like support vector machines and boosted trees are interpretable but they are not adaptable to the dynamic hydraulic conditions. Convolutional and recurrent neural network architecture frameworks are more sensitive to the fine details of anomalies; however, they require high-quality and large amounts of labelled data and cannot withstand topological variation. Graph neural networks take advantage of the spatial dependencies to have better localization but is computationally unstable, and they are hard to understand to operate on. Bayesian model based as well as hybrid methods add consistency to physics models as well as quantifying uncertainties but rely heavily on a precise calibration of hydraulic simulators. Moreover, the evaluation of most published work is done on synthetically written datasets, which creates issues concerning domain adaptation when issued to actual urban systems. As a remedy of these gaps, the proposed research suggests a physics-informed, uncertainty-calibrated ML system comprising of graph-aware representation learning, as well as domain adaptation techniques, trained semi-supervised on multi-modal sensing data. The purpose of the study is to (i) avoid dependence on large, labeled leak levels, (ii) improve sensitivity in different regime of demand and operation and (iii) offer interpretable and transferable detectors of different types of WDNs. The proposed framework will enhance the theoretical progress by allocating some advanced theoretical aspects into the applicability of research findings in practice and delivering a scalable, reliable, and deployable solution addressing urban water facilities."
  },
  {
    "date": "2026-2-23",
    "title": "The Impact of Artificial Intelligence on Cancer Biomarker Detection and Analysis",
    "authors": "Shaikh Nusratullah, Ashish Anjankar, Archana Dhok, Mohd Basheeruddin, Rushikesh Ingole, Pratiksha Batulwar",
    "publish": "2025 3rd DMIHER International Conference on Artificial Intelligence in Healthcare, Education and Industry (IDICAIHEI)",
    "url": "https://doi.org/10.1109/idicaihei65991.2025.11379136",
    "source": "IEEE",
    "abstract": "AI has transformed biomarker discovery, assessment, and response in oncology. Cancer is one of the leading causes of mortality and disability globally, making accurate, early, and personalized diagnostic tools essential. AI-based methods are revolutionizing biomarker discovery by enhancing genomic, proteomic, metabolomic, and imaging data processing, pattern recognition, and prediction. Discover the latest AI-powered cancer biomarker discovery, characterization, and clinical application. This study will examine AI's usage in cancer care, including early identification, precise prognosis, therapeutic response prediction, and more. A review was done to discover relevant peer-reviewed literature. We selected publications on AIdriven biomarker creation in various cancers that fulfilled exclusion and inclusion criteria. AI, notably ML, DL, and radiomics, improved biomarker detection. These methods have improved biomarker sensitivity and specificity across several cancer types to improve clinical decision-making and therapy personalization. This study shows how AI might transform cancer biomarker discovery and use. Strong evidence for AI-based biomarkers in clinical oncology promotes precision medicine, early intervention, and optimal therapy courses."
  },
  {
    "date": "2026-2-23",
    "title": "LEVI-SAM: Tightly-Coupled LiDAR-Visual-Inertial Odometry with Event Cameras",
    "authors": "Kefan Lai, Tian Lan, Yingchun Zhao, Junyao Yan, Jianjun Yin",
    "publish": "2025 IEEE International Conference on Robotics and Biomimetics (ROBIO)",
    "url": "https://doi.org/10.1109/robio66223.2025.11378164",
    "source": "IEEE",
    "abstract": "Event cameras, renowned for their microsecondlevel temporal resolution and high dynamic range (HDR), have shown remarkable potential in addressing challenges like motion blur and extreme illumination in visual odometry. LiDAR sensors capture rich structural information of the environment through 3D point clouds, delivering complementary geometric constraints that improve the accuracy and robustness of state estimation in large-scale scenarios. While LiDAR-visual fusion has been widely adopted in conventional SLAM systems, its integration with event cameras remains underexplored. This paper introduces LEVI-SAM, the first tightly coupled LiDAR-visual-inertial odometry(LVIO) with event cameras, designed to combine the strengths of standard cameras, event cameras and LiDAR for simultaneously localization and mapping(SLAM) in large-scale and high-speed scenarios. Experimental results on the ECMD dataset [1] demonstrate that our LEVI-SAM achieves comparable accuracy and enhanced robustness relative to existing LiDAR-inertial odometry(LIO) and LVIO approaches."
  },
  {
    "date": "2026-2-23",
    "title": "Signal Integrity Analysis of Interconnection Structures Using Conformal Finite-Difference Time-Domain Method",
    "authors": "Zhuohua Xie, Yan Peng, Huaguang Bao, Tiancheng Zhang, Zongguang Yu, Dazhi Ding",
    "publish": "2025 Cross Strait Radio Science and Wireless Technology Conference (CSRSWTC)",
    "url": "https://doi.org/10.1109/csrswtc67757.2025.11383937",
    "source": "IEEE",
    "abstract": "This paper deduces an iterative algorithm of lumped element occupying multiple mesh by using the conformal finite-difference time-domain(CFDTD) method. The feasibility of the proposed method was verified through the signal integrity analysis of the partial interconnection structure of the chip. The computing efficiency has been improved through parallel computing."
  },
  {
    "date": "2026-2-23",
    "title": "Artificial Intelligence in the Diagnosis and Understanding of Primary Dysmenorrhea and Endometriosis: Emerging Insights and Clinical Implications",
    "authors": "Prerana Sakharwade, Bibin Kurian, Amar Taksande, Bharat Rathi, Achita Sawarkar",
    "publish": "2025 3rd DMIHER International Conference on Artificial Intelligence in Healthcare, Education and Industry (IDICAIHEI)",
    "url": "https://doi.org/10.1109/idicaihei65991.2025.11379307",
    "source": "IEEE",
    "abstract": "Menstrual illnesses, in particular, endometriosis and primary dysmenorrhea (PD) are highly prevalent yet largely ignored conditions that produce significant adverse productivity and quality of life changes. Traditional methods of diagnosis largely depend on the symptoms presented by the patient thus leading to underreporting, delay in diagnosis, and misdiagnosis. The recent advancements in the field of artificial intelligence (AI) have offered new opportunities to improve the accuracy of diagnosis and the understanding of the causes of the disease. One machine learning model that has demonstrated great performance in distinguishing between individuals with the Parkinson disease (PD) and healthy individuals is support vector machines (SVM) which is a model that uses neuroimaging to identify patterns of individuals brain competence. Like this, AI-based solutions, such as ensemble models such as extreme gradient boosting (XGBoost) and natural language processing (NLP) have been shown to have the potential to forecast the risk of endometriosis and discover therapeutically relevant data. Although these developments are promising with earlier and more accurate diagnosis, there are still problems with the heterogeneity of data, small sample sizes, model interpretability and acceptance in clinical settings. To ensure equal accessibility and the ability to apply in practice, the implementation of AI in gynecological care requires careful validation, interdisciplinary collaboration, and ethics."
  },
  {
    "date": "2026-2-23",
    "title": "Feature-Enhanced Relation Extraction with Large Language Models",
    "authors": "Yihe Chi",
    "publish": "2025 8th International Conference on Machine Learning and Natural Language Processing (MLNLP)",
    "url": "https://doi.org/10.1109/mlnlp66797.2025.11389036",
    "source": "IEEE",
    "abstract": "Relation extraction transforms unstructured text into structured knowledge but faces a critical trade-off: neural methods require expensive fine-tuning of large models, while traditional feature-based approaches lack deep semantic understanding. We propose FERELL, a novel framework that leverages large language models as frozen feature extractors combined with traditional linguistic features. By keeping LLM parameters frozen, our approach eliminates fine-tuning costs while utilizing rich pre-trained representations. A lightweight fusion mechanism integrates LLM-derived semantic features with explicit linguistic structures. Experiments on NYT and WebNLG benchmarks show FERELL achieves state-of-the-art F1 scores with substantial improvements over previous best methods, while requiring significantly less computational resources and maintaining high efficiency in complex scenarios including overlapping relations."
  },
  {
    "date": "2026-2-23",
    "title": "DC-Link Discharge Resistance Design for Three-Phase Voltage-Source Converter Considering System Stability",
    "authors": "Ho-Jin Yang, Tae-Seok Kang, Hyun-Jin Jin, Jihun So, YoungGyu Jin, Yeong-Jun Choi",
    "publish": "2025 6th International Conference on Smart Grid and Energy Engineering (SGEE)",
    "url": "https://doi.org/10.1109/sgee68429.2025.11385498",
    "source": "IEEE",
    "abstract": "In a voltage-source converter (VSC) system, capacitors are connected in series to withstand the high DC-link voltage. In this system, a discharge resistor connected in parallel with the capacitor is essential to mitigate voltage unbalance and ensure stable energy discharge. However, the discharge resistor generates low-frequency pole in the voltage-control loop, thereby reducing system stability. To analyze the impact of discharge resistors on system stability, it is necessary to consider both the value and number of discharge resistors applied to the system. Therefore, this paper presents a mathematical model of a VSC considering discharge resistors and analyzes impact on system stability through frequency-response analysis using bode plots. Based on the analytical results, this paper proposes design range for the discharge resistance to ensure system stability. The proposed design range is validated through hardware-in-the-Ioop (HIL) experiments using an RT -Box platform."
  },
  {
    "date": "2026-2-23",
    "title": "BLIP-3: A Family of Open Large Multimodal Models",
    "authors": "Le Xue, Manli Shu, Anas Awadalla, Jun Wang, An Yan, Senthil Purushwalkam, Honglu Zhou, Viraj Prabhu, Yutong Dai, Michael S Ryoo, Shrikant Kendre, Jieyu Zhang, Shaoyen Tseng, Gustavo A Lujan-Moreno, Matthew L Olson, Musashi Hinck, David Cobbley, Vasudev Lal, Can Qin, Shu Zhang, Chia-Chih Chen, Ning Yu, Juntao Tan, Tulika Manoj Awalgaonkar, Shelby Heinecke, Huan Wang, Yejin Choi, Ludwig Schmidt, Zeyuan Chen, Silvio Savarese, Juan Carlos Niebles, Caiming Xiong, Ran Xu",
    "publish": "2025 IEEE/CVF International Conference on Computer Vision Workshops (ICCVW)",
    "url": "https://doi.org/10.1109/iccvw69036.2025.00644",
    "source": "IEEE",
    "abstract": "This paper introduces BLIP-3, an open framework for developing Large Multimodal Models (LMMs). The framework comprises meticulously curated datasets, a training recipe, model architectures, and a resulting suite of LMMs. We release 4B and 14B models, including both the pre-trained base model and the instruction fine-tuned ones. Our models undergo rigorous evaluation across a range of tasks, including both single and multi-image benchmarks. Our models demonstrate competitive performance among open-source LMMs with similar model sizes. Our resulting LMMs demonstrate competitive performance among open-source LMMs with similar model sizes, with the ability to comprehend interleaved image-text inputs. Our training code, models, and all datasets used in this work, including the three large-scale datasets we create and the preprocessed ones, will be open-sourced to better support the research community."
  },
  {
    "date": "2026-2-23",
    "title": "Hybrid Robotic Hand for Fabric Manipulation with a Single-Finger",
    "authors": "Xinhao Chen, Alberto Elías Petrilli Barceló, Dayuan Chen, Jose Victorio Salazar Luces, Yasuhisa Hirata",
    "publish": "2025 IEEE International Conference on Robotics and Biomimetics (ROBIO)",
    "url": "https://doi.org/10.1109/robio66223.2025.11377497",
    "source": "IEEE",
    "abstract": "With increasing labor shortages and growing production demands, the automation of garment manufacturing is developing rapidly. Among the various processes, fabric handling and manipulation account for nearly 80% of the total production time, making fabric grasping a critical step in the workflow. Traditional fabric manipulation typically uses low-degree-of-freedom (low-DOF) grippers to simplify hardware design. However, due to the unique and highly dynamic characteristics of fabric, such methods face significant challenges in algorithm development and task adaptability. To address these issues, we propose a novel robotic hand design that integrates multiple grasping types and principles, enabling it to meet diverse task requirements. The design also incorporates industrial features such as a reduced number of actuators and simplified mechanical structure, facilitating practical deployment. Based on this concept, we have developed two versions of a robotic hand specifically designed for fabric grasping. This paper presents an improved version of the design, optimized for better adaptability to different operation scenarios and enhanced actuation efficiency. Experimental results validate the effectiveness and practicality of the proposed design."
  },
  {
    "date": "2026-2-23",
    "title": "Research on Short-Term Load Forecasting Methods for Integrated Mine Energy Systems Considering Source-Load Uncertainty",
    "authors": "Huiqun Huang, Yingnan Guo, Zhen Song, Xia Zhang, Yongteng Du, Chunyang Yue, Rui Zhang, Qingzhao Ma, Yan Li",
    "publish": "2025 International Conference on Energy Power and Electrical Technology (CEPET)",
    "url": "https://doi.org/10.1109/cepet67280.2025.11390828",
    "source": "IEEE",
    "abstract": "Mining energy is a key application scenario for achieving the dual carbon goals, and the efficient operation of its systems is crucial for industrial green transformation. However, uncertainties on both the supply and demand sides pose significant challenges for system scheduling: supply-side wind and solar power generation fluctuates dramatically, while demand-side production processes exhibit random load variations. Traditional forecasting methods struggle to effectively capture the dynamic patterns of such highly nonlinear loads. This paper proposes a short-term load forecasting model that integrates Variational Modal Decomposition (VMD), attention mechanisms, and a bidirectional Long Short-Term Memory (BiLSTM) network. The model reduces the non-stationarity of load sequences through VMD decomposition, utilizes the BiLSTM-Attention architecture to extract temporal features, and enhances the model’s adaptability to uncertainty factors by incorporating multi-source features. The results show that the model proposed in this study significantly outperforms the comparison models, validating its effectiveness and practicality in mine load forecasting. This provides reliable technical support for optimizing the scheduling of mine energy systems."
  },
  {
    "date": "2026-2-23",
    "title": "Operationalising Political Style: A Diagnostic Model for Governmental Speeches During the Pandemic",
    "authors": "André Schmale",
    "publish": "2025 12th International Conference on Social Networks Analysis, Management and Security (SNAMS)",
    "url": "https://doi.org/10.1109/snams67467.2025.11390926",
    "source": "IEEE",
    "abstract": "This case study analyzes 15 government speeches in seven languages in which the first measures to contain the spread of the SARS-CoV-2 virus were announced in 2020. Based on the combination of political discourse analysis, framing theory, and narrative analysis, the study develops a cross-linguistic diagnostic model that links linguistic forms such as lexical diversity, readability, and polarity with discursive actions aimed at constructing political legitimacy and authority. The analytical framework combines sentiment recognition, structural topic modeling (STM), and text network analysis. These components make it possible to classify each speech in a structured way along two axes: linguistic complexity and emotional tonality. The diagnostic model distinguishes between simple and complex communication styles and captures whether language use is based on passive or active action orientation. This approach enables a systematic, language-independent comparison of rhetorical strategies. Beyond its descriptive utility, the model provides a transferable analytical framework for future quantitative research on political language."
  },
  {
    "date": "2026-2-23",
    "title": "Tawa: Automatic Warp Specialization for Modern GPUs with Asynchronous References",
    "authors": "Hongzheng Chen, Bin Fan, Alexander Collins, Bastian Hagedorn, Evghenii Gaburov, Masahiro Masuda, Matthew Brookhart, Chris Sullivan, Jason Knight, Zhiru Zhang, Vinod Grover",
    "publish": "2026 IEEE/ACM International Symposium on Code Generation and Optimization (CGO)",
    "url": "https://doi.org/10.1109/cgo68049.2026.11394849",
    "source": "IEEE",
    "abstract": "Modern GPUs feature specialized hardware units that enable high-performance, asynchronous dataflow execution. However, the conventional SIMT programming model is fundamentally misaligned with this task-parallel hardware, creating a significant programmability gap. While hardware-level warp specialization is the key to unlocking peak performance, it forces developers to manually orchestrate complex, low-level communication and software pipelines—a process that is labor-intensive, error-prone, and unsustainable. To address this challenge, we present Tawa, an automated compiler that systematically generates high-performance, warp-specialized code from a high-level, tile-based program. Central to our approach is a novel IR abstraction, asynchronous references (aref), which expresses warp-level communication without exposing low-level hardware details. Using this abstraction, Tawa automatically partitions programs into producer-consumer roles and manages the intricate dataflow pipeline, relieving developers of invasive kernel rewriting. Evaluation on NVIDIA H100 GPUs across representative LLM kernels shows that Tawa delivers high hardware utilization, achieving up to 1.1 × speedup over highly optimized cuBLAS GEMM kernels. For attention workloads, Tawa attains 1.2× speedup over Triton and matches the performance of the hand-optimized CUTLASS C++ FlashAttention-3 kernel with far less programming effort."
  },
  {
    "date": "2026-2-23",
    "title": "Binary Diffing via Library Signatures",
    "authors": "Andrei Rimsa, Anderson Faustino Da Silva, Camilo Santana, Fernando Magno Quintão Pereira",
    "publish": "2026 IEEE/ACM International Symposium on Code Generation and Optimization (CGO)",
    "url": "https://doi.org/10.1109/cgo68049.2026.11395233",
    "source": "IEEE",
    "abstract": "Binary diffing is the problem of determining whether two binary programs originate from the same source code. Binary diffing tools are used to identify malware, plagiarism, or code theft. Many instances of binary diffing assume an adversarial setting, where a malicious actor transforms binary code by changing the compiler. Traditional diffing techniques rely on statistical similarity analysis, often leveraging stochastic models. However, recent studies have shown that these classifiers perform poorly in the face of adversarial code transformations. To mitigate this scenario, this paper introduces a new diffing technique that is resilient against current obfuscation approaches. We propose comparing executables by matching their library signatures (libsig). A program’s library signature is the sequence of calls it makes to functions outside its .text section. The proposed classifier, LibSIG, is faster than off-the-shelf alternatives, such as ltrace, and, like it, works on stripped binaries or binaries running with address space layout randomization (ASLR) enabled. Furthermore, in contrast to ltrace, LibSIG can be engineered to detect even library calls that bypass conventional application binary interface patterns. Our experiments on the GNU Core Utilities demonstrate that LibSIG remains robust against obfuscators like Khaos and ollvm, as well as typical optimization patterns, outperforming binary diffing approaches such as SAFE, BinDiff, or Asm2Vec."
  },
  {
    "date": "2026-2-23",
    "title": "Integrating AI into DevSecOps Pipelines for Secure Cloud Microservices Management",
    "authors": "Atish Kumar Dash",
    "publish": "2026 IEEE 5th International Conference on AI in Cybersecurity (ICAIC)",
    "url": "https://doi.org/10.1109/icaic67076.2026.11395671",
    "source": "IEEE",
    "abstract": "The modern era of technology encompasses many innovative areas such as cloud computing and the applications and services within them. These workloads, primarily based on microservices architectures, have ushered in blazing fast applications and cloud services. The entire lifecycle of these workloads embedded within traditional DevOps model has been redefined with a shift left approach to security. This is where DevSecOps promises to be a major game changer in this context. This paper explores the overall merger between such cloud workloads and artificial intelligence (AI). While such a combination is pretty much in its nascent stage, this study delves deeper into ways in which such integrations can work seamlessly across stakeholders. The issues of containerized workloads across various pipeline stages, including code commit, build, testing, deployment, and runtime monitoring are investigated and given adequate attention. The paper also explores the trade-offs involved in meeting exponential consumer demand with improved security and threat surface minimization of these cloud-based microservices inclusive of real-world examples. The current AI-driven security automation processes are examined and the limitations of such static rule based, and reactive models are also touched upon. AI-driven techniques such as anomaly detection, predictive risk scoring, intelligent vulnerability prioritization, and automated policy enforcement are further looked at from a regulatory perspective for large enterprise environments. AI-driven DevSecOps provides a step forward in enhancing the security and reliability of cloud-native applications. The present study further calls out AI explainability and real-world validation, specifically from a microservices architecture standpoint and how to manage them effectively to accelerate industry wide adoption."
  },
  {
    "date": "2026-2-23",
    "title": "CoralVOS: Dataset and Benchmark for Dense Coral Video Segmentation",
    "authors": "Ziqiang Zheng, Haixin Liang, Yaofeng Xie, Zhibin Yu, Sai-Kit Yeung",
    "publish": "2025 IEEE/CVF International Conference on Computer Vision Workshops (ICCVW)",
    "url": "https://doi.org/10.1109/iccvw69036.2025.00229",
    "source": "IEEE",
    "abstract": "Coral reefs form the most valuable and productive marine ecosystems, providing habitat for a wide range of marine species. Coral reef surveying and analysis are currently confined to coral experts who invest substantial efforts in generating comprehensive and reliable reports (e.g., coral coverage, population, spatial distribution, etc). However, performing coral analysis based on manual efforts is significantly time-consuming and expensive; the existing coral analytical approaches compromise and opt for performing down-sampling and then conducting sparse point-based coral analysis within selected frames from the whole video. However, such down-sampling will introduce the estimation bias (under-lover- estimation) or even lead to wrong results. To address this issue, we propose to perform dense coral video segmentation, with no down-sampling involved during the whole analysis procedure. Through coral video segmentation, we could generate more reliable and in-depth coral analysis than existing coral reef analytical approaches. To boost such dense coral analysis, we propose a large-scale coral video segmentation dataset CoralVOS as demonstrated in Figure 1. To the best of our knowledge, our CoralVOS is the first dataset to support dense coral video segmentation. We perform experiments on our CoralVOS dataset, including 6 recent video object segmentation (VOS) algorithms. We fine-tuned these VOS algorithms on our CoralVOS dataset and achieved observable performance improvements. The results show that the coral reef analysis will greatly benefit from the coral video segmentation, and there is still great potential for further promoting the segmentation accuracy. Finally, we demonstrate that the proposed CoralVOS could promote coral population estimation, spatial coral reef modeling, and 3D coral reef reconstruction. Dataset and our labeling tool are available at https://coralvos.hkustvgd.com/."
  },
  {
    "date": "2026-2-23",
    "title": "Research on Cooperative Control Algorithm for S-Curve Trajectory Tracking and Dynamic Obstacle Avoidance of Autonomous Vehicles Based on MPC",
    "authors": "Zhaoyang Wang",
    "publish": "2025 5th International Conference on Artificial Intelligence, Robotics, and Communication (ICAIRC)",
    "url": "https://doi.org/10.1109/icairc68035.2025.11384942",
    "source": "IEEE",
    "abstract": "To address the issues of precise S-curve trajectory tracking and obstacle avoidance for autonomous vehicles in dynamic obstacle environments, this paper proposes an integrated algorithm based on Model Predictive Control (MPC). Firstly, a vehicle dynamic model (instead of a simplified kinematic model) that matches actual motion characteristics is constructed. The inertial coordinate system (XOY) and the vehicle body coordinate system (xoy) are introduced to describe key states such as position, velocity, and yaw angle. The decomposition formula of the rear axle center velocity and the discrete state equation under the XOY coordinate system are derived, laying a foundation for control design. This model fully considers longitudinal and lateral tire forces, vehicle mass and inertia properties, and actuator bandwidth limitations to more realistically reflect the dynamic response of the vehicle. Based on this model, the algorithm designs a quadratic programming objective function that includes state errors and control quantity changes: the weight matrix <tex xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">$Q$</tex> (diag (<tex xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">$\\text{qx}, \\text{qy}, \\mathrm{q} \\theta$</tex>)) in the state error term ensures lateral tracking accuracy, while the matrix R restricts sudden changes in longitudinal velocity and front-wheel steering angle to ensure stability. Dynamic obstacle avoidance is converted into linear constraints to define the range of control inputs. Meanwhile, a moving obstacle prediction model is introduced to predict the future positions of obstacles within the MPC prediction horizon. The collision avoidance constraints are reconstructed into time-varying constraints, covering the predicted positions of the vehicle and obstacles at each time step, thus forming a complete optimization problem. Matlab simulations verify the effectiveness of the algorithm: the actual trajectory highly matches the S-curve reference trajectory without obvious deviations; when facing dynamic obstacles, the input is adjusted in real-time to maintain a safe distance and avoid collisions; the state variables respond stably, and the tracking error converges to near zero. Compared with traditional methods such as PID, this MPC algorithm performs better in handling multi-variable constraints and nonlinear paths, providing a reliable solution for autonomous vehicles in complex traffic scenarios."
  },
  {
    "date": "2026-2-23",
    "title": "CrossGAP: Unified Face Anti-Spoofing via Cross-Modal Global-Aware Prompting",
    "authors": "Xihong Chen, Yutong Xie, Hui Ma, Ning Li, Yanyan Liang, Jiabao Guo",
    "publish": "2025 IEEE/CVF International Conference on Computer Vision Workshops (ICCVW)",
    "url": "https://doi.org/10.1109/iccvw69036.2025.00339",
    "source": "IEEE",
    "abstract": "Facial recognition systems remain vulnerable to both physical (e.g., printed photos) and digital (e.g., deep-fakes, face swaps) presentation attacks. Existing face antispoofing (FAS) methods struggle to simultaneously detect these attack types due to: (1) substantial divergence in visual characteristics, and (2) difficulties in learning unified cross-modal representations. To overcome these limitations, we propose CrossGAP, a unified FAS framework that leverages CLIP's cross-modal capabilities to detect diverse face attacks. Our model employs a global [CLS] token to capture holistic facial semantics, enhancing discrimination of physical and digital spoofing cues. Furthermore, we introduce a hierarchical prompt integration strategy to improve generalization across attack scenarios. Experiments demonstrate that CrossGAP achieves state-of-the-art performance in detecting both attack types."
  },
  {
    "date": "2026-2-23",
    "title": "Multimodal Representation Alignment for Image Generation: Text-Image Interleaved Control is Easier than You Think",
    "authors": "Liang Chen, Shuai Bai, Wenhao Chai, Weichu Xie, Haozhe Zhao, Leon Vinci, Junyang Lin, Baobao Chang",
    "publish": "2025 IEEE/CVF International Conference on Computer Vision Workshops (ICCVW)",
    "url": "https://doi.org/10.1109/iccvw69036.2025.00646",
    "source": "IEEE",
    "abstract": "The field of advanced text-to-image generation is witnessing the emergence of unified frameworks that integrate powerful text encoders, such as CLIP and T5, with Diffusion Transformer backbones. Although there have been efforts to control output images with additional conditions, like canny and depth map, a comprehensive framework for arbitrary text-image interleaved control is still lacking. This gap is especially evident when attempting to merge concepts or visual elements from multiple images in the generation process. To mitigate the gap, we conducted preliminary ex-periments showing that large multimodal models (LMMs) offer an effective shared representation space, where image and text can be well-aligned to serve as a condition for external diffusion models. Based on this discovery, we propose Dream Engine, an efficient and unified frame-work designed for arbitrary text-image interleaved control in image generation models. Building on powerful text-to-image models like SD3.5, we replace the original text-only encoders by incorporating versatile multimodal information encoders such as Qwen VL. Our approach utilizes a two-stage training paradigm, consisting of joint text-image alignment and multimodal interleaved instruction tuning. Our experiments demonstrate that this training method is effective, achieving a 0.69 overall score on the GenEval benchmark, and matching the performance of state-of-the-art text-to-image models like SD3.5 and FLUX."
  },
  {
    "date": "2026-2-23",
    "title": "Forgetting-Free Incremental Panoptic Lifting by Maximum-Visibility Viewpoint Selection",
    "authors": "Akira Kohjin, Motoharu Sonogashira, Masaaki Iiyama, Yasutomo Kawanishi",
    "publish": "2025 IEEE/CVF International Conference on Computer Vision Workshops (ICCVW)",
    "url": "https://doi.org/10.1109/iccvw69036.2025.00732",
    "source": "IEEE",
    "abstract": "We propose an incremental learning method for Panoptic Lifting, a novel view synthesis technique that leverages both RGB images and panoptic segmentation masks to represent a 3D scene. While Panoptic Lifting is valuable in applications such as VR, autonomous vehicles, and robotics, it faces a challenge when observations are limited (e.g., due to occlusions), as retraining from scratch becomes computationally expensive. Our approach incrementally updates the model to achieve high accuracy with reduced computational cost. To prevent catastrophic forgetting, a phenomenon where previous learned knowledge is lost during model updates, We introduce a viewpoint selection algorithm that solves a maximum coverage problem to identify a subset of viewpoints that maximizes the visibility of the scene. Experimental results demonstrate a 12% reduction in computation time compared to the naïve approach, while effectively preventing catastrophic forgetting."
  },
  {
    "date": "2026-2-23",
    "title": "Impact of Black-Box Adversarial Attacks on Deep Neural Networks for Skin Imaging",
    "authors": "Bartłomiej Moniak, Joanna Jaworek-Korjakowska",
    "publish": "2025 IEEE/CVF International Conference on Computer Vision Workshops (ICCVW)",
    "url": "https://doi.org/10.1109/iccvw69036.2025.00123",
    "source": "IEEE",
    "abstract": "Adversarial attacks have emerged as a critical threat vector against deep learning models, enabling the manipulation of model outputs through carefully crafted input perturbations. In this study, we explore the effectiveness of three black-box adversarial attack methodologies-where the attacker has no access to model internals-in the context of skin image classification. Using clinically relevant dermatological image datasets, we demonstrate that these attacks can reliably degrade the predictive performance of state-of-the-art convolutional neural networks, even under strict black-box constraints. We evaluate the proposed approach using black-box, noise-driven adversarial perturbations, including uniform random noise, Gaussian-masked noise, and anatomically-constrained noise guided by segmentation masks generated via the Segment Anything v2 (SAM2) model. The proposed black-box attacks resulted in a significant reduction in model accuracy (up to 23.75%) and F1-Score (as much as 50% drop). These results reveal a critical vulnerability of medical image classifiers to adversarial attacks and the importance of incorporating robust safety mechanisms during model development and deployment. The proposed models employ transfer learning using architectures such as ResNet-50 and EfficientNet (B0,B4, and B7). Training is conducted in two phases: initially, the backbone is frozen while a custom classification head is trained to adapt to the skin imaging domain. Subsequently, a two-stage unfreezing strategy is applied, grad-ually fine-tuning deeper layers of the network to improve task-specific feature representation. All models are trained on ISIC archive datasets, utilizing the 3D whole-body scans from ISIC 2024 and dermoscopic images from ISIC 2018 to ensure diversity in acquisition modalities and improve generalization across clinically relevant input types."
  },
  {
    "date": "2026-2-23",
    "title": "Research and Implementation of Humanoid Robot Footstepping Method Based on Deep Reinforcement Learning and Recurrent Neural Networks",
    "authors": "Li Yue, Liu Mingshuo, Kang Ningjing, Zhao Guodong",
    "publish": "2025 IEEE International Conference on Robotics and Biomimetics (ROBIO)",
    "url": "https://doi.org/10.1109/robio66223.2025.11379784",
    "source": "IEEE",
    "abstract": "This paper proposes a method combining Deep Reinforcement Learning (DRL) and Recurrent Neural Network (RNN) for optimizing the generation of stepping motions in humanoid robots. In this paper, a multi-objective reward function is designed through DRL to improve stability and motion efficiency, and RNN (such as LSTM) is used to enhance the ability of temporal action modeling and improve adaptability to dynamic environments. The experiments in this paper are conducted using Webots simulation software and the Darwin-OP2 robot, which verify the effectiveness of the proposed method."
  },
  {
    "date": "2026-2-23",
    "title": "An Intelligent Bid Evaluation System for the Energy Industry Based on Large Language Models",
    "authors": "Rui Wang, Yu Zhao, Chunyu Han, Xingqi Feng, Kanglong Liu, Zhe Ji",
    "publish": "2025 7th International Conference on Robotics, Intelligent Control and Artificial Intelligence (RICAI)",
    "url": "https://doi.org/10.1109/ricai68060.2025.11385275",
    "source": "IEEE",
    "abstract": "The evaluation process for bidding in the energy sector is in urgent need of smart, super transparent, and reliable automated solutions because the documents involved are multimodal, the rules are complex, and the decisions made are really important. To tackle the issues that general big language models face in this high-stakes decision-making scene, like not having enough domain knowledge, unclear reasoning processes, and not following strict rules well, this paper introduces a smart bid evaluation system based on big models. This system uses a framework called “multi-modal evidence-driven explainable evaluation.” Its heart is a five-layer setup that brings together detailed document parsing and semantic searching, domainadaptive retrieval-augmented generation tech, and a hybrid scoring engine that mixes rule logic with statistical learning. This engine puts deterministic compliance checks as penalties into the data-driven scoring model, making sure decisions are compliant and explainable. On an energy bidding dataset with 900 real and made-up cases, this system got a Spearman's rank correlation coefficient of 0.78 with expert judgments on scoring consistency, an NDCG@5 of 0.86 on key bid rankings, and an F1 score of 0.90 on qualification classification, way better than many baseline models. Ablation experiments proved how effective the main parts, like retrieval-augmented generation and rule constraints, are. Plus, the system was tougher under simulated OCR noise and semantic attacks and got way higher explainability scores in blind human tests thanks to visual evidence and natural language explanations. This study offers a workable tech path and realworld example for building reliable, auditable smart decision-making systems for the industry."
  },
  {
    "date": "2026-2-23",
    "title": "CAFE: Unifying Representation and Generation with Contrastive-Autoregressive Finetuning",
    "authors": "Hao Yu, Zhuokai Zhao, Shen Yan, Lukasz Korycki, Jianyu Wang, Baosheng He, Jiayi Liu, Lizhu Zhang, Xiangjun Fan, Hanchao Yu",
    "publish": "2025 IEEE/CVF International Conference on Computer Vision Workshops (ICCVW)",
    "url": "https://doi.org/10.1109/iccvw69036.2025.00659",
    "source": "IEEE",
    "abstract": "The rapid advancement of large vision-language models (LVLMs) has driven significant progress in multimodal tasks, enabling models to interpret, reason, and generate outputs across both visual and textual domains. While excelling in generative tasks, existing LVLMs often face limitations in tasks requiring high-fidelity representation learning, such as generating image or text embeddings for retrieval. Recent work has proposed finetuning LVLMs for representational learning, but the finetuned model often loses its generative capabilities due to the representational learning training paradigm. To address this trade-off, we introduce CAFE, a contrastive-autoregressive fine-tuning framework that enhances LVLMs for both representation and generative tasks. By integrating a contrastive objective with autoregressive language modeling, our approach unifies these traditionally separate tasks, achieving state-of-the-art results in both multimodal retrieval and multimodal generative benchmarks, including object hallucination (OH) mitigation. CAFE establishes a novel frame work that synergizes embedding and generative functionalities in a single model, setting a foundation for future multimodal models that excel in both retrieval precision and coherent output generation."
  },
  {
    "date": "2026-2-23",
    "title": "ProtoMedX: Towards Explainable Multi-Modal Prototype Learning for Bone Health Classification",
    "authors": "Alvaro Lopez Pellicer, André Mariucci, Plamen Angelov, Marwan Bukhari, Jemma G. Kerns",
    "publish": "2025 IEEE/CVF International Conference on Computer Vision Workshops (ICCVW)",
    "url": "https://doi.org/10.1109/iccvw69036.2025.00764",
    "source": "IEEE",
    "abstract": "Bone health studies are crucial in medical practice for the early detection and treatment of Osteopenia and Osteoporosis. Clinicians usually make a diagnosis based on densitometry (DEXA scans) and other patient history. The applications of AI in this field are an ongoing research. Most of the successful methods for this task include Deep Learning models that rely on vision alone (DEXA / X-ray imagery) geared towards high prediction accuracy, where explainability is disregarded and largely based on the post hoc assessment of input contributions. We propose ProtoMedX, a multi-modal model that uses both DEXA scans of the lumbar spine and patient records. ProtoMedX's prototype-based architecture is explainable by design, crucial for medical applications, especially in the context of the upcoming EU AI Act, as it allows explicit analysis of the model's decisions, especially the ones that are incorrect. ProtoMedX demonstrates state-of-the-art performance in bone health classification while also providing explanations that can be visually understood by clinicians. Using our dataset of 4,160 real NHS patients, the proposed ProtoMedX achieves 87.58% accuracy in vision-only tasks and 89.8% in its multi-modal variant, both approaches surpassing existing published methods."
  },
  {
    "date": "2026-2-23",
    "title": "Research on Power Frequency Waveform Classification for Transmission Lines Based on a Cascaded XGBoost Model",
    "authors": "Han Li, Yongqiang Zhao, Weihao Tan, Huaqing Wang, Jiaxing Li, Ting Lei",
    "publish": "2025 6th International Conference on Smart Grid and Energy Engineering (SGEE)",
    "url": "https://doi.org/10.1109/sgee68429.2025.11385589",
    "source": "IEEE",
    "abstract": "Accurate classification of power frequency waveforms is critical for transmission line fault location. While deep learning models (LSTM, CNN) show promise on idealized data, their practical application is constrained by three major challenges: dependency on simulated data, poor performance on imbalanced real-world datasets, and high computational costs requiring GPU resources. To address these limitations, this paper proposes a cascaded XGBoost model specifically designed for real-grid environments. Our approach decomposes the seven-class waveform classification task into a sequence of binary decisions with tailored feature engineering, enabling effective learning from actual grid data with inherent imbalance. Experimental results demonstrate superior performance over conventional deep learning models, achieving 94.1% overall accuracy, 95.0% macro-average F1-score, and 94.1% weighted-average F1-score while completing training approximately 109 times faster than the LSTM model and 19 times faster than the CNN model. The model's computational efficiency and reliability on CPU-only systems make it particularly suitable for resource-constrained fault diagnosis applications."
  },
  {
    "date": "2026-2-23",
    "title": "Lightweight Spatio-Temporal Attention Network with Graph Embedding and Rotational Position Encoding for Traffic Forecasting",
    "authors": "Xiao Wang, Shun-Ren Yang",
    "publish": "2025 IEEE International Conference on Service Operations and Logistics, and Informatics (SOLI)",
    "url": "https://doi.org/10.1109/soli66289.2025.11396273",
    "source": "IEEE",
    "abstract": "Traffic forecasting is a key task in the field of Intelligent Transportation Systems. Recent research on traffic forecasting has mainly focused on combining graph neural networks (GNNs) with other models. However, GNNs only consider short-range spatial information. In this study, we present a novel model termed LSTAN-GERPE (Lightweight Spatio-Temporal Attention Network with Graph Embedding and Rotational Position Encoding). This model leverages both Temporal and Spatial Attention mechanisms to effectively capture long-range traffic dynamics. Additionally, the optimal frequency for rotational position encoding is determined through a grid search approach in both the spatial and temporal attention mechanisms. This systematic optimization enables the model to effectively capture complex traffic patterns. The model also enhances feature representation by incorporating geographical location maps into the spatio-temporal embeddings. Without extensive feature engineering, the proposed method in this paper achieves advanced accuracy on the real-world traffic forecasting datasets PeMS04 and PeMS08."
  },
  {
    "date": "2026-2-23",
    "title": "Heterogeneous Exoskeleton Teleoperation for Humanoid Upper-bodies: Elbow-Constrained Retargeting with ZNN",
    "authors": "Pengfei Wang, Huaqiang Zheng, Youshuang Ding, Ge Gao, Jianwei Zhang, Zongdao Li, Qingdu Li",
    "publish": "2025 IEEE International Conference on Robotics and Biomimetics (ROBIO)",
    "url": "https://doi.org/10.1109/robio66223.2025.11376176",
    "source": "IEEE",
    "abstract": "The skill learning of humanoid robots largely relies on human skills, and their data sources are mostly obtained through human teleoperation. However, except for teleoperation devices that are isomorphic with the robot, which can accurately reflect the complete movements of the operator's arm, all other devices can only map the spatial pose of the arm's end-effector. Here we propose a retargeting method and a ZNN model for the real-time solution of this problem, enabling operators to remotely control the upper limbs of humanoid robots using a non-isomorphic wearable exoskeleton. By incorporating the operator's elbow joint as a constraint, the robot's arms can reproduce the operator's movements more accurately and naturally. Finally, remote control tests are conducted on three virtual humanoid robots with different configurations, as well as a physical counterpart of one of them. The results demonstrate that the proposed method provides a universal strategy for teleoperation with heterogeneous wearable exoskeletons, which not only exhibits good real-time performance but also enables more accurate reproduction of the operator's arm postures."
  },
  {
    "date": "2026-2-23",
    "title": "A Wideband Decoupling Method for Patch Antennas in MIMO Systems",
    "authors": "Yunyi Jiang, Changzhan Gu",
    "publish": "2025 Cross Strait Radio Science and Wireless Technology Conference (CSRSWTC)",
    "url": "https://doi.org/10.1109/csrswtc67757.2025.11383862",
    "source": "IEEE",
    "abstract": "A planar patch antenna with E-plane decoupling is proposed to suppress strong mutual coupling in compact configurations. Edge truncation is applied to the rectangular patch to shift the intrinsic transmission zero. Two metallic strips are further introduced to excite an additional resonant mode and generate a transmission zero, resulting in improved bandwidth. Simulated results show that the antenna operates from 4.56 to 5.09 GHz, corresponding to a 10.98% impedance bandwidth, with isolation greater than 23.1 dB and a peak value of 48.1 dB."
  },
  {
    "date": "2026-2-23",
    "title": "Knowledge-Enhanced Bayesian Text Modeling and Analysis via Document Embedding and Clustering",
    "authors": "Gianni Costa, Riccardo Ortale",
    "publish": "2025 8th International Conference on Machine Learning and Natural Language Processing (MLNLP)",
    "url": "https://doi.org/10.1109/mlnlp66797.2025.11388272",
    "source": "IEEE",
    "abstract": "Clustering and representation learning are fundamental tasks in processing textual data. This paper presents a unified, knowledge-enhanced approach that integrates both tasks to improve their effectiveness. The proposed approach is grounded in a Bayesian model of text corpora, which formalizes a joint generative process where clustering and representation learning interact as latent factors. External knowledge is incorporated through word and entity embeddings to enrich the resulting representations and capture deeper semantic and syntactic patterns. Empirical results on benchmark datasets show that the proposed approach overcomes in effectiveness conventional methods for clustering and representation learning."
  },
  {
    "date": "2026-2-23",
    "title": "Multi-Scale Attention Residual Network for Flexible Sensor-Based Human Activity Recognition",
    "authors": "Kang Huang, Jiayi Yang, Tingting Yu",
    "publish": "2025 7th International Conference on Robotics, Intelligent Control and Artificial Intelligence (RICAI)",
    "url": "https://doi.org/10.1109/ricai68060.2025.11385165",
    "source": "IEEE",
    "abstract": "Human Activity Recognition (HAR) based on wearable sensors has significant applications in health monitoring and rehabilitation. However, existing methods have limitations in multi-scale feature fusion and distinguishing confusable actions. This paper proposes MSAR-Net (Multi-Scale Attention Residual Network), a deep learning architecture designed for flexible strain sensors. The model extracts multi-scale features through five-stage progressive convolution with Squeeze-and-Excitation (SE) attention, captures bidirectional temporal dependencies using Bi-LSTM, and implements dynamic global weighting via multi-head self-attention (MHSA). To address class imbalance, an adaptive data augmentation strategy and contrastive learning loss are designed. On the FSS-HAR dataset, MSAR-Net achieves 96.74% accuracy, outperforming deep learning baseline LSTM by 6.44 percentage points, and surpassing recent state-of-the-art time series models Inception Time and TapNet by 2.18 and 1.39 percentage points respectively, while maintaining <tex xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">$29-36 {\\%}$</tex> fewer parameters and <tex xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">$\\mathbf{2 1}-\\mathbf{2 9}{\\%}$</tex> faster inference. Cross-dataset validation shows 98.9% and 97.3% accuracy on WISDM and UCIHAR datasets, demonstrating excellent generalization capability. Ablation experiments confirm the effectiveness of each module, with multi-head self-attention contributing the most (<tex xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">$+2.80 {\\%}$</tex>)."
  },
  {
    "date": "2026-2-23",
    "title": "Sweating the Stress: GSR Insights into Cognitive Load and Distraction",
    "authors": "Santiago Clemente, Layla Varghese, Valentina Nino, Maria Valero",
    "publish": "2025 IEEE/CVF International Conference on Computer Vision Workshops (ICCVW)",
    "url": "https://doi.org/10.1109/iccvw69036.2025.00009",
    "source": "IEEE",
    "abstract": "Cognitive tasks often trigger measurable physiological stress responses, which can be amplified by environmental distractions. This study explores how cognitive load and auditory interruptions influence stress, using Galvanic Skin Response (GSR) as a biomarker of arousal. Eleven participants (ages 15–45, 6 female, 5 male) completed a series of alternating math and memory tasks under two conditions: a standard task and a disrupted version featuring sudden loud stimuli, including alarms and hand claps, delivered at the 30-second mark. Each task was preceded and followed by two-minute rest periods to establish baseline and recovery metrics. GSR data were recorded using a finger-mounted sensor at an adjusted frequency between 1–100 Hz and processed to extract tonic and phasic components. Event-related analyses focused on time-locked peaks around the distraction stimuli. Results showed significantly elevated mean and peak GSR values during task phases, with higher responses during the distraction condition. Phasic peaks exhibited faster rise times and higher amplitudes post-stimulus. These findings underscore the sensitivity of GSR to detect real-time stress induced by cognitive effort and abrupt environmental stimuli, offering potential for adaptive systems in human-computer interaction and workload-aware designs<sup xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">1</sup><sup xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">1</sup>Database of the study can be downloaded at https://tinyurl.com/gsrdataset."
  },
  {
    "date": "2026-2-23",
    "title": "A Frequency Selective Rasorber Based on an Integrated Absorptive Structure",
    "authors": "Kai Li, Peng Liu, Wenjun Zhou, Qingdong Zhang",
    "publish": "2025 Cross Strait Radio Science and Wireless Technology Conference (CSRSWTC)",
    "url": "https://doi.org/10.1109/csrswtc67757.2025.11384270",
    "source": "IEEE",
    "abstract": "A frequency selective rasorber (FSR) based on an integrated absorbing structure is proposed in this paper. The designed FSR exhibits high transmission efficiency and a low radar cross-section (RCS) for electromagnetic waves under both TE and TM polarizations. The structure comprises an integrated lossy layer on the top and a broadband bandpass frequency selective surface (FSS) at the bottom, yielding high transmission within the passband and high absorption outside it. Full-wave simulation results show a transmission band (defined by 1.3 dB insertion loss) from 9.07 to 12.23 GHz. Furthermore, the absorption exceeds 80% in two separate bands: 3.75 - 7.91 GHz and 13.53 - 16.04 GHz."
  },
  {
    "date": "2026-2-23",
    "title": "An Innovative Approach to Cardiac Care: Using Artificial Intelligence to Predict and Prevent Sudden Cardiac Arrest",
    "authors": "Sana Qausain, Mohd. Basheeruddin, Ashish Anjankar, Faez Iqbal Khan, Akshat Jain, Rushikesh P Ingole",
    "publish": "2025 3rd DMIHER International Conference on Artificial Intelligence in Healthcare, Education and Industry (IDICAIHEI)",
    "url": "https://doi.org/10.1109/idicaihei65991.2025.11377579",
    "source": "IEEE",
    "abstract": "Sudden cardiac arrest (SCA) is a leading cause of mortality in the world that requires quick detection and immediate intervention. Traditional diagnostic measures are in most cases destined to overlook insidious pre-cardiac symptoms. Machine learning (ML) and deep learning (DL) are other methods of Artificial Intelligence (AI) that provide solutions to early prediction when real-time multimodal inputs and outputs are present (ECG, PPG, HRV, and EHRs). The AI is able to identify non-linear trends, which are not visible to traditional methods, to provide early risk assessment. This paper introduces a hybrid framework of AI that combines deep signal processing and clinical data mining to create personalized alerts and risk profiles. It also raises such issues as the security of data, transparency of the model, and clinical flexibility. The reinforcement of interdisciplinary work will be beneficial in improving AI-based systems, facilitating proactive cardiovascular care and cutting down SCA-induced fatalities."
  },
  {
    "date": "2026-2-23",
    "title": "BioCrest - A Flexible Adaptive Robotic Hand Based on Idle-Stroke Mechanism*",
    "authors": "Haokai Ding, Xianjie Zhong, Wenke Huang, Tao Yang, Wenzeng Zhang",
    "publish": "2025 IEEE International Conference on Robotics and Biomimetics (ROBIO)",
    "url": "https://doi.org/10.1109/robio66223.2025.11376226",
    "source": "IEEE",
    "abstract": "Simultaneously achieving precision pinching and compliant grasping with active adaptation remains a significant challenge for most robotic hands and grippers. Furthermore, actively transitioning between grasping postures is difficult for hands or grippers with limited degrees of freedom (DOF). Even dexterous hands with high DOF often require extensive control strategies and extensive information from tactile sensors. This paper introduces BioCrest, a two-finger, three-DOF adaptive gripper exhibiting active reconfiguration capability. Each finger comprises the minimal number of components: three rigid links, one flexure strip, and one fingertip. Both fingers are actuated by a single shared motor. This simple yet unique finger structure enables both precise parallel pinching and highly compliant, stable grasping with uniform pressure distribution. A lost-motion transmission mechanism facilitates fingertip angle adjustment. Comprehensive kinematic and force analyses, combined with detailed mechanical design descriptions, clearly demonstrate controllable transition characteristics and stable grasping performance, including grasping force characteristics. Experiments validate the performance of the proposed gripper and demonstrate its practical utility in real-world applications."
  },
  {
    "date": "2026-2-23",
    "title": "Investigation of Dielectric Characteristics of Non-Uniform Moisture in Epoxy-Impregnated Paper Based on Frequency Domain Dielectric Spectroscopy",
    "authors": "Xiaohui Yan, Hao Yang, Yuanshuai He, Yu Hou",
    "publish": "2025 6th International Conference on Smart Grid and Energy Engineering (SGEE)",
    "url": "https://doi.org/10.1109/sgee68429.2025.11385815",
    "source": "IEEE",
    "abstract": "Epoxy-impregnated paper (RIP) is widely used in dry-type bushings for smart grids, yet moisture ingress remains a critical threat to its insulation integrity. Existing research lacks focused investigation on the Frequency Domain Dielectric Spectroscopy under non-uniform moisture distribution. This paper proposes a novel method for fabricating geometrically simplified RIP samples and controlling localized moisture ingress within designated interlayers. A dedicated test platform was established to measure the Frequency Domain Dielectric Spectroscopy (FDS) of the samples (1mHz ~5 kHz) under varying moisture locations and concentrations. Results indicate that the dielectric loss tangent (tan δ) is highly sensitive to both moisture content and its spatial distribution. Moisture closer to the measuring electrode primarily increases the low-frequency conductive loss, while moisture on both sides of the central aluminum foil enhances the interfacial and dipole polarization losses at mid-to-high frequencies, concurrently exhibiting a significant suppressive effect on the low-frequency dielectric loss. These findings provide a crucial foundation for non-destructive, condition-based monitoring and diagnostic strategies for assessing moisture states within dry-type bushings, thereby contributing to enhanced asset management in smart grids."
  },
  {
    "date": "2026-2-23",
    "title": "Explainable AI for Early Detection and Treatment of Blood Cancer: Enhancing Transparency and Trust in Oncology",
    "authors": "Sushma Sugrivrao Gaikwad",
    "publish": "2025 3rd DMIHER International Conference on Artificial Intelligence in Healthcare, Education and Industry (IDICAIHEI)",
    "url": "https://doi.org/10.1109/idicaihei65991.2025.11379154",
    "source": "IEEE",
    "abstract": "One of the most serious health problems affecting individuals worldwide is blood cancer, which typically results from environmental and hereditary factors. Since detecting and treating cancer is one of the most challenging tasks in modern medicine, experts are focusing their attention on developing focused and precise techniques to improve patient outcomes. The humanization of explainable AI (XAI), a vital tool for improving the transparency and understandability of AI-based decision making, has emerged as the most promising avenue in recent years. Blood cancer is one of the most deadly illnesses in the world today, This is brought about by the interaction of genetic and nongenetic factors. In both developed and developing countries, It is among the primary causes of death from cancer. After outlining traditional AI methods for cancer detection and highlighting knowledge gaps, this paper explores the fundamentals of XAI. By examining its possible influence on this subject, it investigates the function of XAI in cancer detection and treatment. The diagnosis of medical imaging data is presented first, followed by a discussion of how a XAI system would analyze patient data and how therapeutic treatments will be optimized to create patient-specific treatment plans. The use of XAI to cancer screening and treatment strategies will decide future oncology practice. This will not only alter precision medicine but also dramatically improve patient care."
  },
  {
    "date": "2026-2-23",
    "title": "Research on Multi-Modal Data Fusion Technology for Detection and Assessment of Transmission Line Defects",
    "authors": "Shuai Guo, Xiangyu Zhao, Ruiye Zhou, Qinyu Feng, Huanming Zhang",
    "publish": "2025 International Conference on Energy Power and Electrical Technology (CEPET)",
    "url": "https://doi.org/10.1109/cepet67280.2025.11390804",
    "source": "IEEE",
    "abstract": "This study aims to improve the accuracy of transmission line defect detection and the reliability of risk assessment. It addresses the issue of insufficient detection capability in complex scenarios using existing methods, by applying multi-modal data fusion technology. A multi-modal detection and assessment framework is proposed, which integrates visible light, infrared, and LiDAR point cloud data. The YOLOv7 model is improved by introducing a coordinate attention mechanism to enhance small object detection capabilities, and the Focal-EIoU loss function is employed to optimize bounding box regression. A bidirectional cross-modal attention module is designed to achieve deep feature fusion between visible light and infrared data. Finally, a risk assessment model is constructed by incorporating the geometric information from LiDAR point clouds. Experimental results show that the proposed method achieves $87 \\% \\mathrm{mAP}$ in detection accuracy, $88.5 \\%$ precision, and $89.2 \\%$ risk assessment accuracy, significantly outperforming comparison methods. The study demonstrates that multi-modal data fusion technology can effectively enhance the overall performance of transmission line defect detection and risk assessment, providing a reliable solution for intelligent inspection."
  },
  {
    "date": "2026-2-23",
    "title": "Artificial Intelligence for Predicting Oocyte Maturity and Quality in Assisted",
    "authors": "Mariyam Khan, Akash More, Namrata Choudhary, Lakhan Padwal, Ganesh Kalaskar",
    "publish": "2025 3rd DMIHER International Conference on Artificial Intelligence in Healthcare, Education and Industry (IDICAIHEI)",
    "url": "https://doi.org/10.1109/idicaihei65991.2025.11378338",
    "source": "IEEE",
    "abstract": "Artificial Intelligence (AI) is a rapidly growing tool used for decision-making and predictive analysis in assisted reproductive technology (ART). Accurate assessment of oocyte maturity and quality in IVF/ICSI cycles directly affects fertilization success and embryo development outcomes. Traditional oocyte grading methods rely on the subjective observation of the embryologist, which has the possibility of variability and bias. To address this challenge, AI-based models, specially deep learning and machine vision algorithms, are now analyzing oocyte images and morphology parameters. These models predict oocyte maturity and fertilization potential by identifying micro-level features such as zona pellucida thickness, cytoplasmic granularity, polar body morphology. Recent literature suggests that AI can reduce the workload of embryologists by providing noninvasive and objective evaluation and reducing inter-observer variability. AI-based oocyte assessment has the potential to improve fertilization rates, embryo quality, and live birth outcomes for long-term clinical impact. Future directions will require large annotated datasets and multi-center validation studies to robustly implement AI in clinical practice."
  },
  {
    "date": "2026-2-23",
    "title": "Noise and SNR Characteristics Analysis of an Arctic HF Wideband Channel",
    "authors": "Yanming Qin, Makun Guo, Kun Xu, Boyu Xu, Ke Du, Changxu Lin",
    "publish": "2025 5th International Conference on Artificial Intelligence, Robotics, and Communication (ICAIRC)",
    "url": "https://doi.org/10.1109/icairc68035.2025.11384931",
    "source": "IEEE",
    "abstract": "High-frequency (HF) wideband communication channels are subject to significant noise interference, which severely constrains channel quality and link reliability. The signal-to-noise ratio (SNR) serves as a core metric for evaluating system performance, directly reflecting communication quality. This paper presents a channel sounding campaign conducted on a Qingdao-Arctic HF wideband link. Based on the collected data, the noise and SNR characteristics are analyzed, providing the mean values of noise power and signal power. The analysis demonstrates that the Generalized Extreme Value distribution offers a superior fit to the statistical properties of both parameters. Furthermore, a minimum SNR threshold of 10 dB is established as a prerequisite for achieving reliable transmission. These findings provide valuable insights for HF wideband channel modeling and communication performance evaluation in Arctic environments."
  },
  {
    "date": "2026-2-23",
    "title": "Customer Loyalty in the Age of Personalization: A Predictive Analytics Approach for Service-Based Business Models",
    "authors": "Parihar Suresh Dahake, Abhijit Gajghate, Pragati Dahake, Rahul Mohare, Pritam Bhadade",
    "publish": "2025 3rd DMIHER International Conference on Artificial Intelligence in Healthcare, Education and Industry (IDICAIHEI)",
    "url": "https://doi.org/10.1109/idicaihei65991.2025.11378814",
    "source": "IEEE",
    "abstract": "Personalized service delivery has become an important trend that is reshaping consumer engagement and business practices. Research indicates that personalization influences the allocation of resources, aiming to enhance customer satisfaction, trust, and loyalty. Predictive analytics based on individual customer information support the development of customized service systems that can identify patterns and guide targeted marketing efforts. Evaluating the effectiveness of such systems requires tools that can measure future prediction accuracy using real data while considering individual loyalty levels. This study uses Orange software to design a predictive analytics model that estimates customer loyalty based on key personal and behavioral factors. These prediction methods help service-oriented businesses strengthen relationships with existing customers and identify those at risk of leaving. The findings suggest that the influence of loyalty programs that focus on personalization, differentiation, and innovation is more substantial than commonly assumed. They also reinforce the strategic value of retaining current customers, which explains why many companies allocate a growing share of their budgets to retention activities. Four algorithms were tested to ensure both strong performance and ease of interpretation. Logistic Regression, Decision Tree, Naive Bayes, and Random Forest models were applied and compared. The workflow in Orange included data preparation, model application, performance evaluation, and interpretation. Together, these steps provided a structured approach for understanding customer loyalty and supporting data-driven decision-making."
  },
  {
    "date": "2026-2-23",
    "title": "Research on UAV Trajectory Prediction Method Based on Bi-LSTM with Self-Attention Mechanism",
    "authors": "Ruojun Shi, Bo Li",
    "publish": "2025 5th International Conference on Artificial Intelligence, Robotics, and Communication (ICAIRC)",
    "url": "https://doi.org/10.1109/icairc68035.2025.11385052",
    "source": "IEEE",
    "abstract": "Under the current conditions of rapid advancements in artificial intelligence and continuous innovation in intelligent manufacturing, drones-as a low-altitude component of integrated air, space, and ground systems-have attracted significant scholarly attention. The three-dimensional nature and high maneuverability of drone trajectories have rendered trajectory prediction a prominent research topic across various related disciplines. To enhance the operational efficiency of drones in tasks relying on trajectory prediction, this paper proposes a Bi-LSTM with Self-Attention model based on the long short-term memory network combined with self-attention mechanism for training unmanned aerial vehicle (UAV) trajectory data. Furthermore, physical constraints and trajectory smoothness requirements are incorporated into the model to improve prediction accuracy. Experimental results demonstrate that the proposed model achieves 51.17% and 29.2% higher prediction accuracy compared to GRU and LSTM models, respectively."
  },
  {
    "date": "2026-2-23",
    "title": "A Method for Power System Condition Recognition and Fault Diagnosis Based on Warped Clustering Strategy",
    "authors": "Yongqi Guo, Zongshang Li, Qingxuan Wei, Yong Chang, Shuainan Guo, Ce Wang",
    "publish": "2025 6th International Conference on Smart Grid and Energy Engineering (SGEE)",
    "url": "https://doi.org/10.1109/sgee68429.2025.11385425",
    "source": "IEEE",
    "abstract": "With the rapid development of power systems, effective condition recognition and fault diagnosis have become increasingly urgent. To improve the effectiveness of condition recognition and fault diagnosis in power systems, a method for power system condition recognition and fault diagnosis based on warped clustering strategy is proposed in this paper. Firstly, the database covering both different normal and fault conditions is constructed by using simulation data and actual operation data. Secondly, the initial clusters are obtained by using simulation data and condition information. Then the initial clusters are adjusted by using k-nearest neighbor(KNN) in combination with real operation data to construct warped clusters. Finally, condition recognition and fault diagnosis are achieved by KNN based on warped clusters. Case analysis on the IEEE 3-machine 9-node system demonstrates that proposed method markedly enhances the performance of intelligent management and fault diagnosis in power systems."
  },
  {
    "date": "2026-2-23",
    "title": "Prediction of Battery Thermal Runaway Gas Products Based on FT-Transformer Neural Network",
    "authors": "Haisen Zhang, Hua Xiao, Yonghui Guo, Xiaobin Lin, Xinyue Li, Ximin Huang, Ning Qi, Shufan Chen",
    "publish": "2025 International Conference on Energy Power and Electrical Technology (CEPET)",
    "url": "https://doi.org/10.1109/cepet67280.2025.11390753",
    "source": "IEEE",
    "abstract": "Thermal runaway (TR) remains a critical safety concern for lithium-ion batteries, where the composition of flammable gases produced directly determines combustion and explosion risks. Traditional experimental methods are costly and time-consuming, failing to meet rapid prediction requirements. This paper proposes an FT-Transformer based prediction model for battery TR gas generation, addressing small-sample and multioutput regression challenges. The model achieves high-precision predictions for $\\mathbf{1 1}$ gas components including $\\mathbf{H}_{\\mathbf{2}}$ and $\\mathbf{C H}_{4}$. Through feature tokenization and self-attention mechanisms, it effectively captures complex relationships between battery states, charging rates, and gas release. Experimental results demonstrate FTTransformer’s superiority over traditional models such as the Multi-Layer Perceptron (MLP) across multiple evaluation metrics, with an average $\\mathbf{R}^{2}$ of 0.9519, verifying its practical utility and advancement in battery safety prediction."
  }
]