[
  {
    "date": "2026-1-27",
    "title": "Leveraging Blockchain for Secure Mobile Payment Systems: A Privacy Centric Approach",
    "authors": "Vinayak Musale, Poonam Bhosale, Sumegh Tharewal, Madhuri Rao, Ojas Ninawe, Amruta Amune",
    "publish": "2025 International Conference on Intelligent and Cloud Computing (ICoICC)",
    "url": "https://doi.org/10.1109/icoicc64033.2025.11052073",
    "source": "IEEE",
    "abstract": "Mobile payment systems have transformed financial transactions with unprecedented ease and accessibility. But the explosion in their numbers has been met with increasing security threats and issues of privacy. This paper puts forward a new blockchain-based paradigm for mobile payment systems that prioritizes privacy but retains high-security standards. This design leverages the essential capabilities of blockchain technology like decentralization, immutability, and cryptographic protection. It incorporates advanced privacy-protecting techniques such as zero-knowledge proofs and homomorphic encryption. The system design intended here is to mitigate common vulnerabilities present in centralized systems, reduce the risk of data breaches, and provide users with more control over their financial data. By comparative analysis and simulations, we show that our privacy-oriented blockchain solution strongly improves transaction security, minimizes fraud, and maintains user anonymity without sacrificing system performance or compliance with regulations. This work is a contribution to the ongoing work on developing more secure and privacy-aware financial technologies in a rapidly digitalizing economy."
  },
  {
    "date": "2026-1-27",
    "title": "Accelerated Aging of HV Metallized Polypropylene Film Capacitors at Sub-kHz Pulsing and Elevated Temperature",
    "authors": "Alex Pokryvailo, A. Felicetta",
    "publish": "IEEE Transactions on Plasma Science",
    "url": "https://doi.org/10.1109/tps.2026.3653655",
    "source": "IEEE",
    "abstract": "Aging of three types of 5-nF, 15-kV multisectioned metallized polypropylene (PP) capacitors was investigated under pulsed conditions, typically at 13.7 kV and 500 Hz, up to a hundred of millions of shots. Two of the types are built with regular PP specified up to <inline-formula xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\"> <tex-math notation=\"LaTeX\">$105~^{\\circ }$</tex-math> </inline-formula>C, and the third type, dubbed “HT,” uses a high-temperature PP film specified up to <inline-formula xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\"> <tex-math notation=\"LaTeX\">$130~^{\\circ }$</tex-math> </inline-formula>C. All parts were tested at room temperature (RT), <inline-formula xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\"> <tex-math notation=\"LaTeX\">$85~^{\\circ }$</tex-math> </inline-formula>C, and <inline-formula xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\"> <tex-math notation=\"LaTeX\">$100~^{\\circ }$</tex-math> </inline-formula>C, and HT parts were tested at <inline-formula xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\"> <tex-math notation=\"LaTeX\">$130~^{\\circ }$</tex-math> </inline-formula>C. Control tests were done at dc at the same voltage, at <inline-formula xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\"> <tex-math notation=\"LaTeX\">$100~^{\\circ }$</tex-math> </inline-formula>C. In addition, selected parts were subjected to pure thermal aging at <inline-formula xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\"> <tex-math notation=\"LaTeX\">$100~^{\\circ }$</tex-math> </inline-formula>C. The rationale of pulsed testing was a highly accelerated aging compared to dc aging. Aging of the three capacitor types at different temperatures shows a tendency of aging being independent of temperature (in the specified ranges) at a large number of shots. Based on the results obtained with different discharge loads, it was concluded that the discharge current has no appreciable impact on aging at current levels typical for high voltage power supplies (HVPSs); voltage is the dominant factor. Pulsed aging results in capacitance loss (CL) of several percent at millions of pulses, whereas dc aging at the same and even higher voltages for more than 1000 hr yielded CL of fractions of a percent only. CL empirical fits using inverse power law are also offered. One regular PP type lost capacitance through self-healing, with the film exhibiting clearings’ pockmarks; the films of the other two types did not have the same pattern. The HT film was partially fused; the film of the other regular PP type that lost more than 10% of capacitance was largely indistinguishable from a fresh film, except for receding metallization edges. The edge recession, as evidenced by microphotography, caused by electrochemical corrosion, is responsible for CL."
  },
  {
    "date": "2026-1-27",
    "title": "A MQTT-Based Infrastructure to Support COIL Activities Through Real Remote Labs",
    "authors": "Hélio Sousa Mendonça, José Carlos Alves",
    "publish": "2025 7th Experiment@ International Conference (exp.at'25)",
    "url": "https://doi.org/10.1109/exp.at2565440.2025.11348604",
    "source": "IEEE",
    "abstract": "This demo shows an infrastructure that allows for easy implementation of real remote labs. In this infrastructure, several nodes are remotely interconnected by publishing/subscribing MQTT messages. There are physical nodes ca-pable of connecting to real circuits and/or sensors/actuators, and virtual nodes that implement simulated versions of circuits that interact remotely with signals from other nodes. The latencies that occur are low enough for groups of students located in different physical locations to benefit from a near realtime experience in interacting with the circuits thus implemented."
  },
  {
    "date": "2026-1-27",
    "title": "Meta Learning Technique for Few-Shot Image Recognition",
    "authors": "Abhishek Kumar, Ravi Kumar Burman, Jyoti Kumari, Anurag Sinha, Binod Kumar, Shrikant Upadhyay",
    "publish": "2025 International Conference on Communication and Smart Devices (ICCoSD)",
    "url": "https://doi.org/10.1109/iccosd66074.2025.11348221",
    "source": "IEEE",
    "abstract": "Few-shot learning (FSL) enables models to perform well with limited labeled data, overcoming traditional ML limitations. This paper compares key meta-learning methods-MAML, Prototypical Networks, Matching Networks, Siamese Networks, and Relation Networks-each tackling FSL through either optimization-based or metric-based approaches. Evaluation metrics include Accuracy, Precision, Recall, and F1-Score on the CIFAR-FS dataset. Relation Network outperforms others in generalization and adaptability with minimal data. MAML adapts quickly but lacks computational efficiency. The study provides insights into the strengths, weaknesses, and ideal use cases of each method, offering direction for future performance enhancements in real-world applications."
  },
  {
    "date": "2026-1-27",
    "title": "Manifold Subspace Projection-Based MIG Detectors in Sample-Starved Clutter",
    "authors": "Jiayi Chen, Xiaoqiang Hua, Yongqiang Cheng, Hao Wu, Hongqiang Wang, Kang Liu",
    "publish": "2025 17th International Conference on Signal Processing Systems (ICSPS)",
    "url": "https://doi.org/10.1109/icsps66615.2025.11347954",
    "source": "IEEE",
    "abstract": "This paper proposes a class of manifold subspace projection (MSP)-based matrix information geometry (MIG) detectors to deal with the challenge of detecting targets in samplestarved clutter. In accordance with common practice, the sample data can be modeled using Hermitian positive-definite (HPD) matrices, while the clutter covariance matrix is estimated as the geometric mean of the secondary HPD matrices. We define a projection that maps the HPD matrices to a submanifold with reduced clutter, aiming to increase the degree of separation of targets and clutter. Three MSP-MIG detectors corresponding to different geometric measures are proposed. Experimental results confirm the advantage of the MSP-MIG detectors compared with the conventional detectors as well as their counterparts without using MSP in sample-starved clutter."
  },
  {
    "date": "2026-1-27",
    "title": "ProMoT: Progressive Prompting of Modality and Temporal Dynamics for RGB-T Tracking",
    "authors": "Jia Chen, Rui Xu, Si Chen, Yuzhen Niu, Yan Yan, Da-Han Wang",
    "publish": "IEEE Transactions on Circuits and Systems for Video Technology",
    "url": "https://doi.org/10.1109/tcsvt.2026.3657773",
    "source": "IEEE",
    "abstract": "RGB-T tracking benefits from the complementary nature of RGB and TIR modalities, yet their relative reliability for target localization often shifts over time. Most existing trackers fail to adapt to such modality and temporal dynamics in a unified and effective manner, resulting in target representations that are neither discriminative nor temporally consistent. In this paper, we propose ProMoT, a novel tracking framework that jointly integrates cross-modal and temporal cues into a progressive prompting process, enabling continuous retrieval of target-aware representations. Specifically, we design an adaptive target query generator (QueryGen), which selectively aggregates informative spatio-temporal cues from diverse ghost representations through the dynamic sparse ghost fusion mechanism, thereby enabling the generation of target-aware queries. To further preserve fine-grained, temporally consistent target cues, we introduce a high-order contextual prompt updater (PromptUpdater), which encodes high-order cross-modal representations from current and previous frames. These prompts establish the compact and discriminative inter-frame context to not only refine the current frame’s features but also guide target localization in future frames. All components are built upon a parameter-shared backbone for RGB and TIR inputs, forming our complete ProMoT framework. Extensive experiments on both complete and missing modality RGB-T tracking benchmarks show that ProMoT consistently achieves state-of-the-art performance while balancing efficiency."
  },
  {
    "date": "2026-1-27",
    "title": "RIS-based Communication Enhancement and Location Privacy Protection in UAV Networks",
    "authors": "Ziqi Chen, Jun Du, Chunxiao Jiang, Tony Q. S. Quek, Zhu Han",
    "publish": "IEEE Transactions on Wireless Communications",
    "url": "https://doi.org/10.1109/twc.2026.3655342",
    "source": "IEEE",
    "abstract": "With the explosive advancement of unmanned aerial vehicles (UAVs), the security of efficient UAV networks has become increasingly critical. Owing to the open nature of its communication environment, illegitimate malicious UAVs (MUs) can infer the position of the source UAV (SU) by analyzing received signals, thus compromising the SU location privacy. To protect the SU location privacy while ensuring efficient communication with legitimate receiving UAVs (RUs), we propose an Active Reconfigurable Intelligent Surface (ARIS)-assisted covert communication scheme based on virtual partitioning and artificial noise (AN). Specifically, we design a novel ARIS architecture integrated with an AN module. This architecture dynamically partitions its reflecting elements into multiple sub-regions: one subset is optimized to enhance communication between the SU and RUs, while the other subset generates AN to interfere with the localization of the SU by MUs. We first derive the Cramér-Rao Lower Bound (CRLB) for localization with received signal strength (RSS), based on which, we establish a joint optimization framework for communication enhancement and localization interference. Subsequently, we derive and validate the optimal ARIS partitioning and power allocation under average channel conditions. Finally, tailored optimization methods are proposed for the reflection precoding and AN design of the two partitions. Simulation results validate that, compared to baseline schemes, the proposed scheme significantly increases the localization error of MUs by approximately 37.65% with only a 3.69% reduction in the communication rate between the SU and RUs, thereby effectively protecting the SU location privacy."
  },
  {
    "date": "2026-1-27",
    "title": "Revisiting The Cramer-Rao Lower Bound via Wiener Filtering",
    "authors": "Qun Wan, Weiyu Liu, Yanhong Liu, Kehao Zhang, Xiangyu Peng, Lin Zou, Yipeng Liu",
    "publish": "2025 17th International Conference on Signal Processing Systems (ICSPS)",
    "url": "https://doi.org/10.1109/icsps66615.2025.11347705",
    "source": "IEEE",
    "abstract": "This paper explores the derivation of the CramerRao Lower Bound (CRLB) from the perspective of Wiener filtering. Both CRLB and Wiener filtering are crucial topics in statistical signal processing, yet few scholars have examined the connection between the two. In this paper, by setting specific random vectors and parameters to be estimated, we study the principles of Wiener filtering and its application in estimation problems. We ultimately derive results similar to CRLB and emphasize the conditions required to achieve this bound. This article helps students view CRLB from a different angle and gain a deeper understanding of the relationship between Wiener filtering and CRLB."
  },
  {
    "date": "2026-1-27",
    "title": "Conference General Information",
    "authors": "N/A",
    "publish": "2025 7th Experiment@ International Conference (exp.at'25)",
    "url": "https://doi.org/10.1109/exp.at2565440.2025.11348355",
    "source": "IEEE",
    "abstract": null
  },
  {
    "date": "2026-1-27",
    "title": "Asynchronous Grid Connections Providing Fast-Frequency Response: System Integration Study",
    "authors": "Felix Wald, Amir Sajadi, Barry Mather, Giovanni De Carne",
    "publish": "IEEE Transactions on Power Delivery",
    "url": "https://doi.org/10.1109/tpwrd.2026.3657602",
    "source": "IEEE",
    "abstract": "This paper presents an integration study for the recent power electronic-based fast-frequency response technology, “asynchronous grid connection” which operates as an aggregator for behind-the-meter resources and distributed generators. Both technical feasibility and techno-economic viability studies are presented. The fast-frequency response characteristics, validated against Power Hardware-in-the-Loop experiments, are integrated into an IEEE 9- bus system in DigSilent PowerFactory for system-level dynamic analysis. It demonstrates that droop-based control enhancements to local distributed generators allow their aggregation to provide grid-supporting functionalities and participate in the ancillary service markets. To this end, a long-term simulation embedding the system within the ancillary service market framework of PJM has been performed. The fast-frequency response regulation is subsequently used to calculate the potential revenue and project the results on a 15-year investment horizon. Finally, the techno-economic analysis provides recommendations for enhancements to access the full potential of distributed generators on a technical and regulatory level."
  },
  {
    "date": "2026-1-27",
    "title": "Client Side Experimenting with uDAQ28/LT",
    "authors": "Katarína Žáková, Jakub Lengvarský, Jakub Matišák",
    "publish": "2025 7th Experiment@ International Conference (exp.at'25)",
    "url": "https://doi.org/10.1109/exp.at2565440.2025.11348228",
    "source": "IEEE",
    "abstract": "This paper presents an approach to experimental work in control engineering designed for easily portable and small-sized laboratory devices. The Web Serial API allows web applications to directly communicate with serial devices via the browser, expanding possibilities for hardware interaction. Leveraging this technology, we have developed an application for controlling the presented system."
  },
  {
    "date": "2026-1-27",
    "title": "Sentiment Analysis of Empathetic Dialogues- A Comprehensive Study on Machine Learning Algorithms and End-to-End Implementation",
    "authors": "Dibas Kumar De, Amiya Ranjan Panda, Rimita Misra, Mahendra Kumar Gourisaria, Manoj Kumar Mishra, Biswajit Sahoo",
    "publish": "2025 International Conference on Intelligent and Cloud Computing (ICoICC)",
    "url": "https://doi.org/10.1109/icoicc64033.2025.11052113",
    "source": "IEEE",
    "abstract": "The current research project evaluates the efficiency and accuracy of diverse machine learning algorithms by employing the Empathetic Dialogues dataset, developed by the Hugging Face community for studying the underlying sentiments of different utterances. The sentiment classification accuracy was predicted using Random Forest Classifier, Voting Classifier, CatBoost Classifier, XGBoost Classifier, Extra Trees, Passive Aggressive Classifier, Support Vector Machines, Multi-Layer Perceptron Classifier, AdaBoost Classifier, LightGBM Algorithm, Decision Tree Classifier, Ridge Classifier, Gradient Boosting Classifier, Stochastic Gradient Descent Algorithm, k-Nearest Neighbors, Naive Bayes, and Logistic Regression. Confusion Matrix, ROC-AUC Curve and Precision-Recall (PR) Curve were employed to ensure model robustness, with test and training data being utilized to assure the models' reliability. From the analysis it is evident that the CatBoost Classifier attained the peak accuracy of 97.95%, succeeded by Voting Algorithm with 93.23% and Random Forest with 91.69%. k-NN and Naive Bayes Classifier recorded the lowest accuracies of 70.87% and 71.11%, respectively. The best-performing model was deployed on a Flask-based web application for real-time sentiment analysis, facilitating practical applications of the research. This paper provides valuable insights into developing accurate and robust sentiment analysis models with ML techniques."
  },
  {
    "date": "2026-1-27",
    "title": "Efficient Classification of Multi-Lesion Brain Tumors Using Vision Transformer (ViT) Models",
    "authors": "Vani H, R Venkata Siva Reddy",
    "publish": "2025 International Conference on Intelligent and Cloud Computing (ICoICC)",
    "url": "https://doi.org/10.1109/icoicc64033.2025.11052035",
    "source": "IEEE",
    "abstract": "Brain tumor classification and segmentation from MRI images are crucial for enhancing diagnosis accuracy as well as patient outcome. Traditional deep learning architectures like Convolutional Neural Networks (CNN), ResNet50, Hybrid 3B Net with EfficientNetB2, EfficientNet-B0, as well as MobileNetV2 have gained widespread application for the same. Still, these models suffer from the limitation of capturing global spacial details, resulting in poor classification as well as segmentation accuracy for complex multiple-lesion cases. To overcome these issues, it is proposed to design an efficient Vision Transformer (ViT)-based model for multiple-lesion classification as well as segmentation of brain tumors. The said method makes effective utilization of the self-attention mechanism for capturing long-range dependencies within MRI images for identifying tumors with high precision. Extended experiments prove the ViT model achieved classification accuracy of 97.8%, precision of 97.3%, recall of 97.5%, F1-score of 97.4%, as well as Dice Similarity Coefficient of 94.6%, exhibiting the highest performance compared to all traditional methods. It is proven that the proposed ViT framework decreases validation loss by almost 2/3 as compared to baseline methods while boosting robustness tremendously. It is a strong candidate for clinical diagnostic options for neuro-oncology."
  },
  {
    "date": "2026-1-27",
    "title": "Pneumonia Classification from X-ray Images with Convolutional Neural Network",
    "authors": "Nadia Shamsulddin Abdulsattar",
    "publish": "2025 12th International Conference on Information Technology (ICIT)",
    "url": "https://doi.org/10.1109/icit64950.2025.11049246",
    "source": "IEEE",
    "abstract": "A severe lung infection, pneumonia is a major global health concern. A precise diagnosis made early on is crucial for successful treatment. Although human interpretation of chest X-rays is labor-intensive and prone to errors, it is a common diagnostic tool for pneumonia. One interesting method is to automate this procedure using Convolutional Neural Networks (CNNs). This study demonstrates the efficiency of deep networks by building a new CNN model. A distributed training approach using TensorFlow's TPU (Tensor Processing Unit) maximizes the model training process. The suggested CNN model is parallelized with TPU's numerous cloud-based instances, which allows for effective compute parallelization and drastically cuts down on model training durations. According to the experimental results, training the CNN model with the TPU significantly reduces model training times. The architecture of this CNN constitutes various layers, including Conv2D layers, which apply convolution operations, and conv_blocks, which typically consist of several Conv2D layers with activation functions like ReLU, often accompanied by batch normalization. These components work together to process data to learn complex patterns. As a result, the CNN model's accuracy increased to 99.13%."
  },
  {
    "date": "2026-1-27",
    "title": "An Efficient Continual Learning Grasp Detection Method With Lightweight RGB-D Fusion and Automated Data Annotation for Kitchen Waste Sorting_supp1-3650331.mp4",
    "authors": "Qiaokang Liang",
    "publish": "N/A",
    "url": "https://doi.org/10.1109/tmech.2025.3650331/mm1",
    "source": "IEEE",
    "abstract": "Utilizing robots for sorting and impurity removal of kitchen waste presents a challenging task. When performing such tasks, visual servo systems often require a mechanism to continuously accommodate the new tasks and environments. First, we propose a lightweight RGB-D fusion module, which efficiently fuses RGB and depth information at the channel level, achieving an over 2.1% improvement in grasping accuracy compared to traditional RGB-D fusion methods without increasing computational burden. Second, we introduce a labels automated annotation module based on detecting the degree of gripper closure. This module determines grasp success or failure by assessing the actual closure of the gripper. Finally, through these labels and manual correction, we constructed five grasping tasks to build a new continual learning dataset [kitchen waste grasp on continual learning (KWG-CL)] and proposed a novel continual learning method. By using this method, our algorithm achieves the highest average image-level grasp accuracy (77.28%) on the KWG-CL compared to state-of-the-art approaches, while exhibiting the least catastrophic forgetting. In addition, we also validated this in a real-world robot system. To the best of the authors' knowledge, this is the first application of the continual learning method in kitchen waste sorting."
  },
  {
    "date": "2026-1-27",
    "title": "Leveraging Early Diagnosis of Alzheimer's Disease Using Deep Learning and XAI",
    "authors": "Enad Alrougi, Hossam Meshref",
    "publish": "2025 1st Future International Conference on Artificial Intelligence and Cybersecurity (FICAC)",
    "url": "https://doi.org/10.1109/ficac65757.2025.11341770",
    "source": "IEEE",
    "abstract": "This paper presents a high-performance and interpretable deep learning system for early diagnosis and stage classification of Alzheimer's disease (AD) using brain MRI data. Using the clinically validated ADNI dataset, which was supplemented with a numerical Alzheimer's dataset from Kaggle, the proposed models achieved remarkable accuracy: 99.14 % with CNN+K-Nearest Neighbors (KNN), 98.12% with standalone CNN, 97.34 % with AdaBoost, and 91.33 % with Random Forest. To address the severe class disparity, particularly in the “Moderate Demented” category, sophisticated data augmentation and resampling techniques were employed. Explainable AI (XAI) tools like Grad-CAM, SHAP, and LIME were used to display and quantify the brain regions and traits that most affected the designed models' predictions. These results demonstrate the technical soundness and high accuracy of the proposed AI system. Future studies could look into expanding multi-modal data (like genetic and cognitive tests), integrating with clinical decision support systems, and deploying advanced ensemble CNN architectures (like ResNet, VGG16, and Inception) to enhance generalization and real-world scalability."
  },
  {
    "date": "2026-1-27",
    "title": "Towards Robust Agents: A Survey of Adversarial Attacks and Defenses in Deep Reinforcement Learning",
    "authors": "Adithya Mohan, Torsten Schön",
    "publish": "IEEE Access",
    "url": "https://doi.org/10.1109/access.2026.3657855",
    "source": "IEEE",
    "abstract": "Deep Reinforcement Learning (DRL) has demonstrated remarkable success in autonomous decision-making across diverse domains, including robotics, autonomous driving, and game playing. However, recent studies have uncovered a critical vulnerability: DRL agents are highly susceptible to adversarial attacks that can significantly degrade their performance or lead to catastrophic failure. These attacks exploit different components of the learning pipeline observations, actions, rewards, and policies exposing new challenges unique to DRL compared to supervised learning. This survey provides a comprehensive examination of adversarial threats and corresponding defense mechanisms within the DRL paradigm. We begin with an in-depth background on DRL fundamentals, distinguishing between online and offline settings, and contrasting on-policy versus off-policy algorithms. We then present a taxonomy of adversarial attacks based on the point of intervention in the DRL pipeline: observation perturbations, action manipulation, reward poisoning, and policy corruption. This also aims to serve as a foundational reference for researchers and practitioners seeking to understand and mitigate adversarial vulnerabilities in DRL."
  },
  {
    "date": "2026-1-27",
    "title": "Super-Twisting Current Regulator for a Six-Phase Induction Motor in Field Weakening Conditions",
    "authors": "Magno Ayala, Jesus Doval-Gandoy, Yassine Kali, Jorge Rodas, Osvaldo Gonzalez, Larizza Delorme, Raul Gregor",
    "publish": "IEEE Transactions on Power Electronics",
    "url": "https://doi.org/10.1109/tpel.2026.3657622",
    "source": "IEEE",
    "abstract": "This paper addresses the regulation of stator currents in a six-phase asymmetrical induction machine during field-weakening operation, accounting for disturbances and parameter variations. Current control is performed in the d–q, α–β, and x–y reference planes. A novel double-loop current controller based on a discrete-time super-twisting algorithm is proposed to enhance current regulation, particularly under field-weakening conditions where current tracking errors typically deteriorate. This controller ensures precise current tracking with fast error convergence and improved robustness to uncertainties. Experimental results confirm the effectiveness of the controller under both transient and steady-state conditions, including during the field weakening operation."
  },
  {
    "date": "2026-1-27",
    "title": "Leprosy Patient's Chronic Wounds Detection and Segmentation Using Different Yolo Versions and Unet Algorithm",
    "authors": "Noura El-Rashidy, Ibrahim Hendawi, Hagar Ghazy, Mohamed Fathy",
    "publish": "2025 1st Future International Conference on Artificial Intelligence and Cybersecurity (FICAC)",
    "url": "https://doi.org/10.1109/ficac65757.2025.11341872",
    "source": "IEEE",
    "abstract": "Chronic wounds are a common health problem around the world, caused by many diseases such as diabetes and leprosy. These wounds affect about 40 million people around the world. There are about <tex xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">$\\mathbf{2. 4}-\\mathbf{4. 5}$</tex> million patients in the United States, which is a large percentage. A chronic wound is a wound that does not heal within three months as these wounds are unresponsive to normal wound healing signals. Because these wounds are associated with conditions such as aging and diseases such as leprosy and diabetes, and because the number of cases of diabetes is increasing, the number of people with chronic wounds is also increasing. In recent times, using image processing and segmentation algorithms is necessary to make analysis on wounds images to effectively identify and detect wounds and highlight area in the image where the wound is present to determine its size in order to determine whether there is progress or not in the phase of wound healing. In this paper we will use different Yolo versions and UNet algorithm in detecting and segmenting the wounds images and determine their performance in terms of accuracy and speed. Chronic wounds dataset of 602 images taken from 69 leprosy patients which are RGB is used before applying data augmentation and 1562 RGB images are used after the upsampling to avoid the overfitting problem which leads to performance degradation."
  },
  {
    "date": "2026-1-27",
    "title": "Self-Distillation for Nonlinear Process Monitoring",
    "authors": "Honghai Zhang, Guangjie Chen, Le Zhou",
    "publish": "2025 9th International Symposium on Computer Science and Intelligent Control (ISCSIC)",
    "url": "https://doi.org/10.1109/iscsic67494.2025.11351983",
    "source": "IEEE",
    "abstract": "Currently, lightweight deep latent variable models are widely applied in industrial process monitoring, combining the strengths of traditional latent variable methods and deep neural networks. However, the growing complexity of modern industrial systems requires further improvements to guarantee reliable monitoring outcomes. In this study, we develop a self-distilled Deep PCA-KPCA framework, where knowledge from kernel principal component analysis (KPCA) is transferred into shallow principal component analysis (PCA). The features extracted by both PCA and KPCA are transformed into posterior probabilities through Bayesian inference. Based on the consistency between teacher and student models, weighting coefficients are adaptively determined to perform dynamic fusion, generating probability statistics that integrate different posterior probabilities and yield more comprehensive monitoring results. The effectiveness of the proposed self-distillation approach is validated on the Tennessee Eastman process."
  },
  {
    "date": "2026-1-27",
    "title": "Transformer-Based Fusion of Time-Domain and Time-Frequency Features for Robust Radar Jamming Recognition",
    "authors": "Yaobo Liu",
    "publish": "2025 17th International Conference on Signal Processing Systems (ICSPS)",
    "url": "https://doi.org/10.1109/icsps66615.2025.11347647",
    "source": "IEEE",
    "abstract": "The escalating sophistication of electronic warfare technologies underscores the critical and challenging need for accurate radar jamming recognition in highly dynamic electromagnetic environments, which is pivotal for precise target tracking. While contemporary deep learning-based jamming recognition methods predominantly leverage time-frequency (TF) maps derived from Short-Time Fourier Transform (STFT) as primary features, this transformation inherently discards crucial fast transient information from the original time-domain signals. To address this limitation, we propose a novel time-frequency multi-representation jamming recognition algorithm. This algorithm synergistically integrates fine-grained time-domain features with the signal energy distribution from TF representations, thereby substantially enhancing recognition accuracy within intricate deceptive jamming scenarios. Furthermore, to capture global contextual dependencies often missed by local operations, a Transformer-based prediction framework is employed. This leverages its intrinsic self-attention mechanism, enhancing the model’s ability to discern complex patterns and thereby bolstering overall recognition robustness. Comprehensive experimental evaluations across diverse simulated complex deceptive jamming environments demonstrate that the proposed algorithm consistently achieves a recognition accuracy surpassing 99%, unequivocally validating its superior performance and practical efficacy."
  },
  {
    "date": "2026-1-27",
    "title": "fMRI-Based Brain Tumor Classification Using Deep Learning",
    "authors": "Osama Zulfiqar, Urooj Abid, Hammad Nazeer, Noman Naseer",
    "publish": "2025 27th International Multitopic Conference (INMIC)",
    "url": "https://doi.org/10.1109/inmic65900.2025.11348449",
    "source": "IEEE",
    "abstract": "Automated and precise segmentation of brain tumors in Magnetic Resonance Imaging (MRI) is important in early diagnosis and proper treatment formulation. This study tests the performance of two object detection models, namely YOLOv8m (medium) and YOLOv8n (nano) in case of multi-label classification and localization of four classes of brain tumor, each represented by glioma, meningioma, pituitary, and no tumor. Although methods based on traditional CNN do attain classification accuracies, they cannot achieve spatial localization. Conversely, our solution also provides localization in addition to detection by use of YOLOv8. Experimental data demonstrate that YOLOv8m overperforms YOLOv8n on mAP@0.5 (0.927 versus 0.896) as well as the accuracy on different classes (96.46% versus 90.98% meningioma, 93.22% versus 90.98% pituitary, 93.22% versus 90.98% no tumor, and 72.45% versus 63.5% glioma. The enhanced localization and lower rates of misclassification of YOLOv8m are verified by the qualitative assessment provided with the help of prediction images and confusion matrices. These findings show the potential of YOLOv8m as a stable and precise approach to tumor detection in real-time with the potential to be implemented within the clinical diagnostic systems."
  },
  {
    "date": "2026-1-27",
    "title": "High-Sensitivity TMR Sensor System for Magnetic Field Detection for Biomedical Applications",
    "authors": "Saad Abdullah, Jawad Hussain",
    "publish": "2025 27th International Multitopic Conference (INMIC)",
    "url": "https://doi.org/10.1109/inmic65900.2025.11348578",
    "source": "IEEE",
    "abstract": "High-sensitivity tunnel magneto resistance (TMR) sensors offer promising capabilities for non-invasive biomedical applications including magnetocardiography and magnetoencephalography. This study investigates a practical micro controller-based implementation using a TMR2905 sensor to simultaneously measure DC and AC magnetic fields. For DC and low-frequency measurements below 5 Hz, a timing-based direct capacitor interface was implemented, for higher AC frequencies, analog signal conditioning and filtering enables direct ADC conversion. Experimental validation against calibrated reference magnetometers demonstrates 99% accuracy for both DC and low-frequency AC measurements up to 8 kHz across all three orthogonal axes. The AC field response exhibits the expected logarithmic decrease with distance from the field source, with reliable detection maintained out to 150 mm separation. These results confirm the viability of integrating TMR sensors with standard microcontrollers for portable, multi-axis biomedical magnetic field monitoring without requiring cryogenic cooling."
  },
  {
    "date": "2026-1-27",
    "title": "HLIF: A History-Aware Model Boosting Neuronal Heterogeneity in SNNs",
    "authors": "Fan Luo, Yanfeng Lu, Zeyu Gao",
    "publish": "2025 International Conference on Machine Intelligence and Nature-Inspired Computing (MIND)",
    "url": "https://doi.org/10.1109/mind67540.2025.11351893",
    "source": "IEEE",
    "abstract": "Spiking Neural Networks (SNNs) offer biological plausibility and energy efficiency, but conventional Leaky Integrate-and-Fire (LIF) neurons with shared parameters limit adaptability and diversity. We propose a history-aware LIF (HLIF) model that adaptively adjusts firing thresholds based on spiking history, enhancing intra-layer heterogeneity. This adaptable threshold modulation is a general mechanism that can be integrated with various trainable neuron models. Experiments show that HLIF achieves 95.17 % on CIFAR-10, 77.70 % on CIFAR100, and 68.20 % top-1 accuracy on ImageNet, demonstrating competitive results within state-of-the-art SNN frameworks."
  },
  {
    "date": "2026-1-27",
    "title": "A Distributed Brute-Force Attack and Misleading Countermeasure for Securing ModbusTCP Implementations in PLCs",
    "authors": "Mohammd Abdul Jawad, Mohammad Z. Masoud, Álvaro Álesanco, José García",
    "publish": "2025 12th International Conference on Information Technology (ICIT)",
    "url": "https://doi.org/10.1109/icit64950.2025.11049239",
    "source": "IEEE",
    "abstract": "this paper demonstrates a brute-force attack on password based ModbusTCP implementations in PLCs and HMIs using a swarm of 20 microcontrollers. To counter this attack, a misleading LADDER-based algorithm that misleads attackers with false register values and randomized passwords is proposed. To evaluate the attack and the proposed protocol, two attack scenarios and two password lengths have been leveraged on a PLC in a LAN environment. Results show that the misleading protocol causes each attacker to receive different passwords and data, disrupting brute-force attempts while enabling attacker identification. When tested with one thread and 20 Arduino kits, each kit found a different password and received different data when reading PLC registers. This approach not only prevents unauthorized access but also allows administrators to track attackers' IP addresses, highlighting the effectiveness of deception-based defenses in industrial security."
  },
  {
    "date": "2026-1-27",
    "title": "Boosting Brain Tumor Classification with Attention-Enhanced Xception Architecture",
    "authors": "Soumyarashmi Panigrahi, Dibya Ranjan Das Adhikary, Binod Kumar Pattanayak",
    "publish": "2025 International Conference on Intelligent and Cloud Computing (ICoICC)",
    "url": "https://doi.org/10.1109/icoicc64033.2025.11052029",
    "source": "IEEE",
    "abstract": "Our study investigates the impact of attention mechanisms on the performance of pre-trained Convolutional Neural Networks (CNNs) in classifying brain Magnetic Resonance Imaging (MRI) images. Attention mechanisms are designed to dynamically emphasize relevant input data regions, enhancing feature extraction and boosting model performance. We explore the efficacy of integrating attention mechanisms into established pre-trained CNN architectures, specifically Xception and VGG19, using the publicly available \"Br35H: Brain Tumor Detection 2020\" dataset. Our comprehensive evaluation employs a range of metrics, including accuracy, Jaccard index, precision, recall, specificity, F1-Score, and F2-Score. The results highlight the significance of attention mechanisms in improving the analysis of medical images, particularly in brain tumor classification using MRI scans. Our study provides valuable insights for developing more accurate and efficient deep learning-based diagnostic tools by elucidating the influence of attention mechanism selection on pre-trained model performance."
  },
  {
    "date": "2026-1-27",
    "title": "Deep Learning-Based Phishing Email Spam Detection with Region Attention Convolution and Adaptive Optimization",
    "authors": "Naresh Jetty, Madhura G K, Sanat Pattanaik, Srinivasa Rao Bittla",
    "publish": "2025 International Conference on Intelligent and Cloud Computing (ICoICC)",
    "url": "https://doi.org/10.1109/icoicc64033.2025.11052027",
    "source": "IEEE",
    "abstract": "Phishing emails are a common kind of cyberattack that aim to trick victims into giving over personal information, financial data, and login credentials. Traditional spam filters have a hard time detecting phishing emails because they often look like they came from a trusted source. The need for more sophisticated detection procedures to distinguish between legitimate and malicious emails is growing in response to the sophistication of phishing assaults. With the help of an Adaptive Reproductive Harris Hawks Optimisation (ARHHO) fine-tuner, to provide EfficientNet, a phishing email spam detector based on residual attention mechanisms (RAM). By zeroing in on important parts of the email's content, metadata, and embedded links, the RAC module improves feature extraction, which in turn improves classification accuracy and decreases false positives. At its core, EfficientNet guarantees scalable and efficient deep learning processing thanks to its optimised depth and breadth scaling. Furthermore, ARHHO optimises the model's hyperparameters in real-time to enhance generalisability and resilience through better classification performance. Extensive tests on benchmark phishing datasets are conducted to evaluate the proposed approach. Our model beats traditional deep learning methods like CNNs, LSTMs, and transformers in every metric to measured: accuracy, precision, recall, and F1-score. The use of attention-driven feature extraction in conjunction with adaptive optimisation techniques allows us to significantly improve phishing detection skills while simultaneously reducing the sum of false positives. By developing a sophisticated, effective, and scalable method for detecting phishing emails, this study makes a contribution to cybersecurity. Improvements based on transformer models, detection techniques that work in real-time, and strategies to withstand adversarial attacks are all part of the future. Enterprise email security solutions can effectively implement the suggested structure to reduce the risks of phishing attacks."
  },
  {
    "date": "2026-1-27",
    "title": "DLDSS: Dual-Layered Decision Support System for Retail Recommendation",
    "authors": "Swadhin Kumar Barisal, Bijayini Mohanty, Santilata Champati, Gayatri Nayak, Bharat Jyoti Ranjan Sahu, Lambodar Jena",
    "publish": "2025 International Conference on Intelligent and Cloud Computing (ICoICC)",
    "url": "https://doi.org/10.1109/icoicc64033.2025.11052025",
    "source": "IEEE",
    "abstract": "Predictive decision-making has emerged in the dynamic retail landscape to maximize sales and enhance customer satisfaction. This study introduces an Advanced Dual-Layered Predictive Decision-Making Approach to address challenges in retail decision-making by leveraging analytics and machine learning techniques. The proposed model integrates Association Rule Mining (ARM) for uncovering hidden patterns, Feature Engineering to enrich data representation, and a Dual-Layered recommendation system. The first layer generates personalized recommendations and prioritizes the recommendations, while the second layer generates outliers. To ensure robust decision-making, the model incorporates Isolation Forest for outlier detection, enabling the identification and exclusion of anomalous data points. Precision, recall, F1 score, and mean absolute error (MAE) metrics evaluate the system’s performance. Experimental results in a retail dataset demonstrate significant improvements in predictive accuracy, with an F1 score of 0.92 and an MAE reduction of 15% compared to baseline models. This approach provides a scalable and adaptive framework for retail decision-making, enabling real-time optimization of inventory, promotions, and customer engagement strategies. Integrating ARM and machine learning ensures both interpretability and predictive power, making it a valuable tool for modern retail analytics."
  },
  {
    "date": "2026-1-27",
    "title": "Optical Radiation Source Encoding for Long-Range Multispectral Communication",
    "authors": "Chenshuo Chang, Haoting Liu",
    "publish": "2025 9th International Symposium on Computer Science and Intelligent Control (ISCSIC)",
    "url": "https://doi.org/10.1109/iscsic67494.2025.11351984",
    "source": "IEEE",
    "abstract": "This paper presents a novel optical encoding and decoding framework for long-distance UAV-based communication using multispectral imaging. By leveraging compact binary representation, Gray code transformation, XOR encryption, and Hamming error correction, the system enables accurate transmission of 3D coordinate data via visible light at distances up to 5 kilometers. Simulations show over 98% coordinate recovery accuracy with a low bit error rate and high tolerance to interference. This work contributes to a lightweight and scalable encoding method for airborne visible light communication systems."
  },
  {
    "date": "2026-1-27",
    "title": "Unified Local and Global Transformer for Infrared Small UAV Tracking",
    "authors": "Yaohong Chen, Tianlei Ma, Donglin Xue, Xinhao Liu, Weining Chen",
    "publish": "IEEE Transactions on Geoscience and Remote Sensing",
    "url": "https://doi.org/10.1109/tgrs.2026.3657906",
    "source": "IEEE",
    "abstract": "Long-term tracking of infrared small unmanned aerial vehicle (UAV) poses substantial challenges, including dynamic backgrounds, clutter interference, and target occlusion. This study introduces an innovative method that integrates a local tracking network with a global search strategy to effectively address these issues. Firstly, a background motion estimation module is proposed to mitigate dynamic background interference by aligning consecutive frames through motion state assessment. Secondly, a full-transformer local tracking network is developed to suppress background clutter. It enhances feature representation using Spectformer as the backbone and leverages cross-attention mechanisms to robustly handle clutter. Finally, a global search strategy featuring a large-scale search module is designed to address target occlusion. This module provides reliable local search regions for the tracking network when occlusion occurs. Extensive experiments on infrared drone datasets validate that the proposed method outperforms state-of-the-art approaches, achieving high success rates, high precision, and high real-time processing at 45 FPS under specific configurations."
  },
  {
    "date": "2026-1-27",
    "title": "Secure Sum-Rate Optimization in RIS-Assisted RSMA HAP Systems With Untrusted Users",
    "authors": "Zain Ali, Saud Althunibat, Mazen Omar Hasna, Khalid Qaraqe",
    "publish": "IEEE Transactions on Aerospace and Electronic Systems",
    "url": "https://doi.org/10.1109/taes.2026.3657736",
    "source": "IEEE",
    "abstract": "Non-terrestrial networks (NTNs) leveraging high-altitude platforms (HAPs) are pivotal for bridging coverage gaps in remote regions and ensuring service continuity when terrestrial infrastructure fails (e.g., during disasters) or becomes congested (e.g., mass events). While integrating rate-splitting multiple access (RSMA) and reconfigurable intelligent surfaces (RISs) enhances spectral efficiency, securing transmissions against unknown eavesdroppers with imperfect channel state information (CSI) remains a critical challenge. We propose a secure multi-user, multi-cluster RIS-assisted RSMA system for HAPs, jointly optimizing precoding, RIS beamforming, and cluster time allocation to maximize sum-rate under secrecy rate constraints. The non-convex problem is transformed into a tractable semidefinite program (SDP) via successive convex approximation, auxiliary variable bounding, and a rank-1 penalty method. Simulations demonstrate significant performance gains over benchmarks, robustness to practical RIS phase quantization, and scalability across varying numbers of users per cluster, validating the framework's efficacy."
  },
  {
    "date": "2026-1-27",
    "title": "Joint 3D Parameter Estimation in ISAC Systems Based on OTFS Modulation",
    "authors": "Yuxing Gao, Tong Wei, Bin Liao",
    "publish": "2025 17th International Conference on Signal Processing Systems (ICSPS)",
    "url": "https://doi.org/10.1109/icsps66615.2025.11347636",
    "source": "IEEE",
    "abstract": "Integrated sensing and communication (ISAC) has emerged as an enabling technology for sixth-generation wireless systems. This paper proposes an efficient algorithm for the joint estimation of angle, range, and velocity in ISAC system employing orthogonal time frequency space (OTFS) modulation. Leveraging the distinctive structure of OTFS waveforms, the transmit data symbols are first mapped into the delay-Doppler (DD) domain. Then, for each coherent processing interval, beamforming is performed on each DD bin for the steering vector. We then proposed the spectrum peak-finding method in spatial-delay-Doppler domain to estimate the three-dimensional (3D) parameters, i.e., angle, range, and velocity, simultaneously. Numerical results demonstrate that the proposed method achieves the lower root mean square error in 3D parameter estimation, particularly under low signal-to-noise ratio conditions."
  },
  {
    "date": "2026-1-27",
    "title": "EEG Insights into Visual Attention and Affective Prosody Processing in Children with Autism Spectrum Disorder: Examining the Theta/Alpha Ratio",
    "authors": "Muhammad Zakir Ullah, Dongchuan Yu",
    "publish": "2025 17th International Conference on Signal Processing Systems (ICSPS)",
    "url": "https://doi.org/10.1109/icsps66615.2025.11347869",
    "source": "IEEE",
    "abstract": "Attention is a fundamental cognitive process, and individuals with Autism Spectrum Disorder (ASD) often experience challenges in both cognitive and emotional regulation. Although multiple object tracking (MOT) tasks are frequently used to assess attention impairments in ASD, most studies focus solely on behavioral responses and overlook physiological measures such as electroencephalogram (EEG). Moreover, the interaction between cognition and emotion during MOT tasks remains underexplored. This study addresses these gaps by examining cognitive load variations using the Theta/Alpha Ratio (TAR) in 31 ASD and 31 typically developing (TD) children, based on publicly available EEG data. Participants completed three tasks: neutral image viewing (IPAS), one-target 4-disc (MOT4), and one-target 8-disc (MOT8), representing low, intermediate, and high attentional loads, respectively, while listening to happiness and sadness prosodies. For each participant, TAR was calculated, and five EEG features were extracted: averaged TAR across all channels (allTAR) and TAR values from the frontal (fTAR), temporal (tTAR), parietal (pTAR), and central (cTAR) regions. A three-factor ANOVA (emotion types × attention levels × subject groups) was conducted, followed by post-hoc t-tests for multiple comparisons, and correlation analyses were performed between the five EEG features and clinical measures. Results revealed: (1) a significant interaction between attention level and emotional prosody for tTAR; (2) significant main effects of attention level in fTAR and cTAR, but no interaction with emotional prosody; (3) higher allTAR, fTAR, tTAR, cTAR, and pTAR in the ASD group compared to TD; and (4) stronger EEG clinical correlations in the ASD group during MOT-4. These findings confirm visual attention deficits and highlight the interplay between emotion and cognition in ASD, suggesting TAR as a potential biomarker for cognitive load and emotional modulation."
  },
  {
    "date": "2026-1-27",
    "title": "Manufacturer-Oriented Risk Assessment of Imaging Systems with Multi-Criteria Decision Making and Machine Learning",
    "authors": "Kholoud E. Nassar, Ahmed M. Salaheldin, Manal Abdel Wahed, Neven Saleh",
    "publish": "2025 1st Future International Conference on Artificial Intelligence and Cybersecurity (FICAC)",
    "url": "https://doi.org/10.1109/ficac65757.2025.11341886",
    "source": "IEEE",
    "abstract": "This study presents a hybrid Multi-Criteria Decision Making (MCDM) and Machine Learning (ML) framework designed to support operational decisions related to the upgrade or replacement of medical imaging systems. Focusing on Computed Tomography (CT) and Magnetic Resonance Imaging (MRI) units installed across healthcare facilities in Egypt, the research offers a novel contribution by analyzing equipment lifecycle management from the manufacturer's perspective, rather than that of the healthcare provider. A real-world dataset from Siemens Healthineers was used, incorporating six performance indicators such as system age, utilization rate, and downtime. Two sets of weights were applied-objective CRiteria Importance Through Intercriteria Correlation (CRITIC) and expert-based (Service Marketing Head)-within the Evaluation based on Distance from Average Solution (EDAS) method to generate replacement prioritization rankings. Furthermore, four supervised ML algorithms were trained to classify systems into three lifecycle stages. This hybrid approach demonstrated a classification accuracy of up to 96.5 % in identifying these classes. Results highlight the value of integrating domain expertise and data-driven techniques for supporting lifecycle planning, installed base retention, and service strategy development in the medical imaging industry."
  },
  {
    "date": "2026-1-27",
    "title": "Experimental Validation Of Information-Theoretic Physical Layer Security",
    "authors": "Johannes Voichtleitner, Moritz Wiese, Anna Frank, Holger Boche",
    "publish": "IEEE Transactions on Information Forensics and Security",
    "url": "https://doi.org/10.1109/tifs.2026.3657885",
    "source": "IEEE",
    "abstract": "The maximum likelihood attack strategy is known to be the optimal attack strategy for an eavesdropper in a wiretap channel scenario with additive white Gaussian noise channels under the distinguishing security criterion. The main drawback of this optimal attack is its high computational complexity. While this complexity doesn’t hinder the eavesdropper since he has unlimited computing power, it does present a significant challenge for legitimate parties. For them, it is extremely difficult, if not impossible, to estimate the outcome of the optimal attacker strategy to validate the secrecy of their communication system. In this paper, we introduce a low complexity method for generating upper and lower bounds on the attack performance of the eavesdropper to validate the security against the maximum likelihood attack strategy. We theoretically establish that the derived bounds represent valid constraints on the attack success probability under suitable constraints. The validation method is based on list generation and can be used for any linear block code. Furthermore, we propose a list generation algorithm for this validation method and show different ways to further reduce the complexity. We compare the proposed validation method with state-of-the-art attack strategies in numerical simulations for various error-correcting codes."
  },
  {
    "date": "2026-1-27",
    "title": "An Improved OS-CFAR Algorithm based on Otsu’s Preprocessing",
    "authors": "Shaozhuo Tang, Xianpeng Wang, Mingcheng Fu, Yuehao Guo",
    "publish": "2025 17th International Conference on Signal Processing Systems (ICSPS)",
    "url": "https://doi.org/10.1109/icsps66615.2025.11347765",
    "source": "IEEE",
    "abstract": "The performance of Ordered-Statistic CFAR (OSCFAR) algorithms is inherently constrained by their dependence on predefined parameters, which leads to missed detections as the number of targets approaches the theoretical detection capacity. In this paper, an improved Ordered-Statistic CFAR algorithm based on Otsu’s preprocessing (OOS-CFAR) is proposed to address the issue. Different from traditional OS-CFAR, the proposed algorithm adopts the maximum between-class variance as a criterion to partition interference and background clutter regions, whereby interference signals are adaptively separated before clutter power estimation, thus avoiding the masking effect caused by fixed parameters. Monte Carlo simulations are conducted under various multi-target scenarios, and the results demonstrate that the proposed algorithm exhiits both superior performance and robust property, particularly in cases where OSCFAR fails."
  },
  {
    "date": "2026-1-27",
    "title": "Image Processing Algorithm Based on Prior Information Entropy Coupled with Equalized Machine Learningaper",
    "authors": "Zijian Zhang, Jianqiang Luo, Dongwei Lin, Xinghao Feng, Jian Wang, Fan Liu",
    "publish": "2025 9th International Symposium on Computer Science and Intelligent Control (ISCSIC)",
    "url": "https://doi.org/10.1109/iscsic67494.2025.11351995",
    "source": "IEEE",
    "abstract": "The camera of a certain optical measurement system is the infrared thermal imager CM/ST320 developed by Shanghai Institute of Technical Physics. During the imaging process, it produces a large number of defective pixels, i.e., bad pixels, and the imaging uniformity of the camera is poor, which greatly affects the quality of image output. To address the problem of poor image quality, the maximum inter-class variance method is first used to perform binarization processing on the image. On this basis, combined with the polarization distribution law, weight adaptive filtering is applied for denoising. The prior information entropy is extracted from the denoised image, which is then coupled with the atmospheric scattering model for equalization processing. Then, the complex wavelet is used to describe the image features, and the least squares support vector machine classifier is utilized to obtain the optimal decision criterion function. Finally, the optimally matched and enhanced target sub-image is output, and the image feature information is further enhanced. Experimental results show that the proposed algorithm achieves better subjective effects, and the objective evaluation parameters of the resulting image, such as peak signal-to-noise ratio, edge preservation index, equivalent number of looks, and Brownian random variance, are all improved compared with those of other commonly used algorithms."
  },
  {
    "date": "2026-1-27",
    "title": "Risk-Tunable Safe Adaptive Control for Nonlinear Systems Under Dynamical Uncertainties",
    "authors": "Vipul K. Sharma, S. Sivaranjani",
    "publish": "IEEE Open Journal of Control Systems",
    "url": "https://doi.org/10.1109/ojcsys.2026.3657701",
    "source": "IEEE",
    "abstract": "We address the problem of safe adaptive control for a class of nonlinear systems with dynamical uncertainties, while satisfying control barrier function (CBF) type safety constraints with user-defined risk tolerances at all times. We develop a model reference adaptive control framework that provably guarantees safety in two stages. In the first stage, we design a safe reference model to generate reference trajectories that satisfy CBF-based safety conditions. However, asymptotically tracking a safe reference trajectory does not automatically guarantee safety at every time step. Therefore, in the second stage, we formulate a chance-constrained optimization problem for the nonlinear system with dynamical uncertainties to track the reference model, while provably guaranteeing CBF-based safety constraint satisfaction at each time step up to a user-defined risk bound. We then provide a risk-tunable sampling-based scenario design approach to tune parameterized controllers that solve this optimization problem. In addition, for the special case of linear dynamics, we provide conditions on the uncertainty samples for the existence of controller parameters that can guarantee safe tracking. We illustrate the performance of our framework on a quadcopter navigation problem with obstacle avoidance constraints."
  },
  {
    "date": "2026-1-27",
    "title": "AI-Driven Predictive Maintenance in Smart Manufacturing Using Cyber-Physical Systems and Industrial IoT",
    "authors": "S. Meenakshi, Aaquib Hussain Ganai, T P Saravanan, A Shaji George, Murugananth Gopal Raj, Reshma S, Monica Bhutani",
    "publish": "2025 International Conference on Communication and Smart Devices (ICCoSD)",
    "url": "https://doi.org/10.1109/iccosd66074.2025.11348447",
    "source": "IEEE",
    "abstract": "The combined role of Artificial Intelligence (AI), Cyber-Physical Systems (CPS), and the Industrial Internet of Things (IIoT) is transforming smart manufacturing changing paradigms of its operations into the proactive mode. The common maintenance approaches result in unplanned outage, and subsequent downfalls in operation expenses. The proposed paper discusses the latest methods of predictive maintenance (PdM) that is driven by AI with a particular emphasis on CPS and IIoT structures to obtain real-time data and make intelligent decisions. It presents comparative methods of the mentioned techniques, using their efficiency in fault diagnosis, identification of anomalies, and residual useful life (RUL) estimation procedures. To reinforce the contributions of the paper to more than a review, a mathematical model and parametric research are provided which shows how predictive models (e.g LSTM based regression) react to changes in training size, model complexity and sensor noise. The results indicate that a quantifiable increase in the accuracy of the predictions and latency in comparison with benchmark approaches can be achieved. Other important issues that are addressed in the paper refer to model interpretability, data quality, and interoperability, as well as to the upcoming directions, which are explainable AI, adaptive learning, and sustainable PdM frameworks. The described observations should assist scholars and business representatives in developing high-quality, effective, and environmentally-friendly PdM systems in line with Industry 4.0 and Industry 5.0 objectives."
  },
  {
    "date": "2026-1-27",
    "title": "A systematic review of recent models for agri-food supply chain management with emphasis on the application of artificial intelligence and sustainability",
    "authors": "Israel D. Herrera-Granda, MME Alemany, Diego Peluffo, Erick P. Herrera-Granda, Giovanni D’Ambrosio",
    "publish": "IEEE Access",
    "url": "https://doi.org/10.1109/access.2026.3657974",
    "source": "IEEE",
    "abstract": "This work consists of a systematised review examining recent models for agri-food supply chain management (AFSCM), focusing on artificial intelligence (AI) applications and sustainability integration. Through PRISMA methodology, we conducted a descriptive statistical analysis of 183 articles published between 2019 and 2023. The dimensional analysis revealed that strategic modelling represented 55% of approaches, while perishable products were considered in 58% of studies. Sustainability principles were integrated into 74% of the models, while AI applications showed a limited 14% adoption across AFSCM. The analysis of AI implementations showed distribution in agricultural production management at 27%, transportation and logistics at 8%, and sustainability planning at 19%. A novel AFSCM taxonomy was developed through systematic classification, combining quantitative bibliometric analysis, qualitative thematic analysis and expert interpretation. The results identified gaps in mixed methods approaches and tactical or operational modelling, providing a structured framework for future research directions in AI integration and sustainable practices across agri-food supply chains."
  },
  {
    "date": "2026-1-27",
    "title": "Is Deciphering Cell Types in Complex Tissues the Next Frontier for Protein Language Models?",
    "authors": "Haohuai He, Zhi-An Huang, Jibin Wu, Kay Chen Tan",
    "publish": "2025 International Conference on Machine Intelligence and Nature-Inspired Computing (MIND)",
    "url": "https://doi.org/10.1109/mind67540.2025.11351583",
    "source": "IEEE",
    "abstract": "Spatial proteomics allows for the analysis of protein expression within tissue contexts. While cellular expression and spatial location are commonly utilized, the properties of protein markers can offer additional valuable information. Therefore, we propose a deep learning framework that utilizes embeddings from the ESM2 protein language model to incorporate prior biological knowledge of protein markers. Our framework integrates these marker priors with single-cell expression and spatial information through a cross-attention mechanism to generate informative cell representations. We demonstrate that this integration significantly improves cell type annotation performance across multiple spatial proteomics datasets, highlighting the value of leveraging PLM-derived marker knowledge."
  },
  {
    "date": "2026-1-27",
    "title": "AWSUM Filter Aided ADMM for Reverberation Suppression in Very Shallow Water",
    "authors": "Siyuan Tian, Xionghou Liu, Yixin Yang",
    "publish": "2025 17th International Conference on Signal Processing Systems (ICSPS)",
    "url": "https://doi.org/10.1109/icsps66615.2025.11347690",
    "source": "IEEE",
    "abstract": "The water depth of very shallow water environment is much smaller than the that of a shallow water environment. The water depth of a typical very shallow water environment leads to a more severe interface scattering effect during the propagation of the sound wave, hence producing stronger sea-surface and bottom reverberation than those in shallow water environment. To address the reverberation suppression problem in the very shallow water environment, we propose advanced WISPR (Wagstaff’s Integration Silencing Processor) summation (AWSUM) filter aided alternating direction method of multipliers (ADMM). The focus of this method is selecting feasible and reasonable approaches to suppress different reverberation components step by step. Firstly, we utilize ADMM to realize the low-rank and sparse matrix decomposition and then remove the low-rank matrix, and hence suppressing the bottom reverberation. Secondly, we employ the AWSUM filter to suppress the sea-surface reverberation, the volume reverberations and some residual of the bottom reverberation. Finally, we apply the hard thresholding operator to the output of AWSUM to suppress the weak reverberation around the target highlights. Compared to other robust principal component analysis (RPCA) methods and AWSUM Filter aided RPCA methods, the Bias of Integral Side Lobe Ratio (BISLR) of our method stabilizes at high value. This demonstrates the effectiveness of our method for reverberation suppression in the very shallow water environment."
  },
  {
    "date": "2026-1-27",
    "title": "Time-Domain Modeling and Power Decoupling of the Cross-Coupled Active Power Flow in a Multi Active Bridge (MAB) Converter",
    "authors": "Ayooluwa Ajiboye, Chanaka Singhabahu, Benjamin Shani, Hassan Habib Chaudhry, Alireza Khaligh",
    "publish": "IEEE Transactions on Power Electronics",
    "url": "https://doi.org/10.1109/tpel.2026.3658014",
    "source": "IEEE",
    "abstract": "The principal component within the multi active bridge (MAB) topology is the high-frequency magnetic link (HFML) interconnecting multiple ports, thereby facilitating multidirectional power flow. However, a byproduct of this unifying AC magnetic link is the cross-coupled power flow induced by the inter-port phase shifts, subsequently preventing independent port-wise operation. Therefore, this work presents a time-domain analytical framework for the accurate estimation of the cross-coupled active power flow by applying a superposition-based approach to the MAB port-equivalent models. These port-equivalent models are derived from the full-order <inline-formula xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\"><tex-math notation=\"LaTeX\">$n \\times n$</tex-math></inline-formula> inductance matrix (<inline-formula xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\"><tex-math notation=\"LaTeX\">$\\mathbf {L}$</tex-math></inline-formula>-matrix) extracted from an asymmetric integrated-leakage HFML via a single-port impedance measurement scheme. Furthermore, a control-integrated power decoupling (IPD) feedforward compensator is developed to suppress undesirable propagative voltage fluctuations during transient power flows, thereby ensuring port-wise decoupling of the converter. Steady-state experiments conducted on a 3.2 kW SiC-based four-port MAB prototype are used to validate the accuracy of the proposed time-domain model with respect to the terminal active powers. Whereas transient experiments with output-voltage step-changes are used to verify the improved decoupling performance of the proposed full-order <inline-formula xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\"><tex-math notation=\"LaTeX\">$\\mathbf {L}$</tex-math></inline-formula>-matrix IPD scheme, in comparison with an uncompensated PI (Proportional-Integral) controller, and the existing <inline-formula xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\"><tex-math notation=\"LaTeX\">$Y$</tex-math></inline-formula>-<inline-formula xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\"><tex-math notation=\"LaTeX\">$\\Delta$</tex-math></inline-formula> (star-delta) decoupling method."
  },
  {
    "date": "2026-1-27",
    "title": "Real-Time Resilient Traffic Prediction for LEO Access Networks via Adjacent Satellite Collaboration",
    "authors": "Quan Chen, Lizeng Gong, Lei Yang, Yi Wang, Kanglian Zhao, Wen Yao",
    "publish": "IEEE Communications Magazine",
    "url": "https://doi.org/10.1109/mcom.001.2500548",
    "source": "IEEE",
    "abstract": "Emerging Low Earth Orbit (LEO) satellite networks, represented by Starlink, have developed a rapidly growing user base and increasing network traffic. Accurate and reliable satellite traffic prediction is essential for optimizing network performance and resource management. However, the high-speed motion of satellites and the uneven geographic distribution of users pose significant challenges to satellite network traffic prediction. Yet, empowered by Artificial Intelligence (AI) and inter-satellite links (ISLs), new opportunities arise. This article proposes a Real-time Resilient Traffic Prediction (RRTP) framework via adjacent satellite collaboration. Unlike existing methods that rely solely on historical data and delayed ground updates, by exchanging real-time traffic data, the onboard collaborative prediction learns the spatiotemporal traffic correlations among adjacent satellites, updates the parameters of the neural network models, and timely corrects the predicted traffic volume. The base model can be pre-trained on the ground and uploaded to satellites to save computations. Since RRTP requires neither global nor continuous long-term data exchange, RRTP enhances resilience to abrupt traffic changes and unexpected events, such as link/satellite failures. The overhead, cost, and applicability of RRTP are further discussed and validated through comparative simulations of a series of mega-constellation case studies."
  },
  {
    "date": "2026-1-27",
    "title": "Change and be changed: Looking back at ten years of the soma design research program",
    "authors": "Kristina Höök, Jonas Löwgren, Anna Ståhl",
    "publish": "ACM Transactions on Computer-Human Interaction",
    "url": "https://doi.org/10.1145/3793670",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-1-27",
    "title": "AI-Driven Exterior Damage Assessment for Shared Vehicle Systems: A Benchmarking Study of Segmentation and Detection Models",
    "authors": "Cátia Loureiro, Sandra Dixe, Hugo Baptista, Cristiana Neto, Tiago Aston, Duarte Fernandes",
    "publish": "2025 7th Experiment@ International Conference (exp.at'25)",
    "url": "https://doi.org/10.1109/exp.at2565440.2025.11348523",
    "source": "IEEE",
    "abstract": "Shared vehicle systems, which rely heavily on user-to-user condition verification, require robust automated damage assessment for vehicle safety. This paper addresses that need by providing a comprehensive benchmark of deep learning models for automated vehicle exterior damage identification, focusing on two critical tasks: vehicle region segmentation and damage detection. For segmentation, the following models were evaluated: YOLOv8, RTMDet, Mask-RCNN, Mask2Former, Mask-DINO, and QueryInst, assessing precision, recall, mAP, and inference time. The findings revealed that transformer-based models, Mask2Former (84.8% mAP50) and Mask-DINO (88.6% mAP50), achieved notable segmentation performance. However, YOLOv8 (up to 88.9% mAP50) demonstrated the best balance between performance metrics and speed. For damage detection, models from the YOLO family, RTMDet, RT-DETR, DINO, and YOLO-NAS were benchmarked. Performance in this more challenging task was notably lower, with RT-DETR (L) achieving the highest mAP50. These results highlight the challenges affecting model per-formance, including class imbalances and variability in damage representation. Thus, this study provides important insights into the limitations and potential of current deep learning models when applied to a publicly available dataset, supporting the development of next-generation solutions for vehicle damage assessment."
  },
  {
    "date": "2026-1-27",
    "title": "A Blockchain Based Decentralized Identifiers for Entity Authentication in Electronic Health Records",
    "authors": "Gunjan Kumar Chouhan, Shubhangi Singh, Aanya Jaduvansy, Priya Rai, Adyasha Rath",
    "publish": "2025 International Conference on Intelligent and Cloud Computing (ICoICC)",
    "url": "https://doi.org/10.1109/icoicc64033.2025.11052007",
    "source": "IEEE",
    "abstract": "Electronic Health Records (EHRs) are essential in contemporary healthcare as they facilitate the storage and sharing of personal patient data. Traditional cloud-based EHR systems, though, are afflicted with centralized control, privacy threats, restricted interoperability, and susceptibility to data breaches. To alleviate these challenges, this paper suggests a blockchain-based, patient-centered EHR management system that uses Ethereum smart contracts, Decentralized Identifiers (DIDs), and InterPlanetary File System (IPFS) for safe, distributed, and effective handling of health data.The system put forward puts patients at the forefront of EHR access and control, allowing them to grant or withdraw permissions to healthcare providers, insurers, or researchers using fine-grained, attribute-based policies executed through smart contracts. DIDs remove the need for third-party identity providers, providing secure and verifiable user authentication directly on the blockchain. IPFS, on the other hand, provides cost-effective, tamper-proof off-chain storage of medical records, with metadata and access logs stored on-chain to minimize gas usage.Extensive testing on the Ethereum Goerli testnet proves that the system provides greater security, lower storage costs, efficient access control, and better interoperability than conventional models. This method not only solves existing shortcomings in EHR systems but also opens the door to scalable, transparent, and patient-enabled healthcare data management."
  },
  {
    "date": "2026-1-27",
    "title": "A Blockchain-Based IoT Framework for Smart Homes: Enhancing Energy Prediction and Security with LSTM and Equilibrium Optimization",
    "authors": "Priyanka Pramod Pawar, Deepak Kumar, Santosh Reddy Addula, Qasim Naveed Cheema, Anwar Ul Haq, Mohan Kumar Meesala",
    "publish": "2025 International Conference on Intelligent and Cloud Computing (ICoICC)",
    "url": "https://doi.org/10.1109/icoicc64033.2025.11052010",
    "source": "IEEE",
    "abstract": "This research aims to develop a secure smart home system capable of forecasting energy consumption and user profiles through deep learning techniques and an edge computing strategy utilizing blockchain technology. The proposed system monitors Internet of Things (IoT) devices, such as refrigerators, dishwashers, smart microwaves, and furnaces, leveraging blockchain for enhanced security and transparency. The study highlights the effectiveness of Long Short-Term Memory (LSTM) neural networks—a specialized deep learning approach for time series prediction—in achieving favorable forecasting outcomes. The findings indicate that the optimal window size significantly affects model uncertainty estimates and prediction performance. By employing the Equilibrium Optimization (EO) algorithm for hyperparameter tuning, the study enhances the efficiency of the LSTM model. Overall, the results demonstrate that the LSTM model is effective in accurately predicting the energy requirements of smart homes."
  },
  {
    "date": "2026-1-27",
    "title": "QoE-Aware Quantization in Buffer-Based Adaptive Bitrate Control with PD Controller for MPEG-DASH",
    "authors": "Eiki Asada Ryogo Kubo",
    "publish": "2025 IEEE Virtual Conference on Communications (VCC)",
    "url": "https://doi.org/10.1109/vcc67261.2025.11351022",
    "source": "IEEE",
    "abstract": "Adaptive video streaming using Moving Picture Expert Group dynamic adaptive streaming over a Hypertext Transfer Protocol (MPEG-DASH) has become widely used on the internet recently. Various adaptive bitrate (ABR) algorithms have been proposed for video streaming. Buffer-based control-theoretic approaches for ABR control switch video bitrates in response to changing network conditions. However, the bitrate variations caused by frequent throughput variations can degrade the quality of experience (QoE). This study proposes a quantization scheme for buffer-based ABR control using a proportional-derivative controller for MPEG-DASH. The proposed scheme selects a quantized bitrate based on the output of the ABR controller, buffer level, its change, and throughput variation. In the quantization scheme, two kinds of algorithms are installed to detect throughput variation: Detection using one previous segment (PS1) and detection using three previous segments (PS3). The PS1 and PS3 algorithms are based on the variation in estimated throughput for a segment and three segments, respectively. Simulations confirm that the proposed scheme detects throughput variations earlier and more accurately than the conventional method and improves QoE."
  },
  {
    "date": "2026-1-27",
    "title": "Frame-Correlation Exploitation for Secure Audio Watermarking: A Parallel Multi-Watermarking Framework with Enhanced Robustness",
    "authors": "Qiutong Li, Zheng Xing, Qingyang Xu, Xiaochen Yuan",
    "publish": "2025 17th International Conference on Signal Processing Systems (ICSPS)",
    "url": "https://doi.org/10.1109/icsps66615.2025.11347692",
    "source": "IEEE",
    "abstract": "To further balance the robustness and imperceptibility of audio watermarking technology and protect the global market information security, this paper proposes an inter-frame correlation-based multiple parallel audio watermarking scheme (ICMP). Adjacent Frame Extraction Process (AFEP) is proposed to select the adjacent frame. Then, Discrete Cosine Transform (DCT) is applied to each embedding frame and its adjacent frame to extract their corresponding frequency domain coefficients. To improve robustness, midfrequency DCT coefficients are selected to embed multiwatermarks. For enhancing embedding capacity, randomly generated vectors are transformed into orthogonal unit vectors using Gram-Schmidt orthogonalization. By projecting each interframe difference coefficient onto orthogonal vectors, multiwatermarks are embedded in parallel by adjusting the projections into a predefined range. Experimental results show that, compared to existing schemes, the proposed scheme generally offers superior imperceptibility and robustness."
  },
  {
    "date": "2026-1-27",
    "title": "A user-friendly Google Earth Engine Web Application for vegetation trait mapping and time series analysis from Sentinel-2 and Sentinel-3 imagery",
    "authors": "Emma De Clerck, Jochem Verrelst",
    "publish": "IEEE Geoscience and Remote Sensing Letters",
    "url": "https://doi.org/10.1109/lgrs.2026.3658233",
    "source": "IEEE",
    "abstract": "A Google Earth Engine (GEE) web application is introduced for automated mapping of a suite of quantitative vegetation traits (e.g., LAI, fAPAR, GPP, chlorophyll/nitrogen/water content) from Sentinel-2 and Sentinel-3 imagery, covering both surface reflectance and top-of-atmosphere radiance. The system operationalizes validated Gaussian Process Regression (GPR) models based on radiative transfer simulations within a fully cloud-based workflow, enabling on-demand generation of vegetation trait maps at 20–300 m resolution without requiring coding expertise. Key innovations include: (1) dynamic model loading for 30 GPR models enabling estimation of 11 vegetation traits, (2) automated masking/compositing for trait mapping, and (3) Savitzky-Golay smoothing for noise-reduced temporal analysis. The application demonstrates the potential of GEE to bridge advanced machine-learning-based retrieval methods and practical, operational Earth observation use."
  },
  {
    "date": "2026-1-27",
    "title": "Templse: Cloud Integrated Health Monitoring System",
    "authors": "Arnab Abhijit Chaudhuri, Anadi Chakraborty, Avinash More, Vipul Gohil",
    "publish": "2025 International Conference on Communication and Smart Devices (ICCoSD)",
    "url": "https://doi.org/10.1109/iccosd66074.2025.11348269",
    "source": "IEEE",
    "abstract": "This paper presents Templse (Temperature and Pulse Rate), a unified IoT-based health monitoring system that combines a contactless infrared thermometer and a pulse rate monitor in a single compact device. Built around an ESP32 microcontroller with onboard Wi-Fi connectivity and powered by a rechargeable lithium-ion battery pack for portability, the system enables real-time vital sign acquisition and cloud integration. A GY-906 MLX90614ESF IR sensor measures body temperature without contact, while a SEN-11574 PPG sensor captures heart rate. To ensure reliable pulse detection in noisy conditions, the device firmware incorporates adaptive filtering and thresholding algorithms. Measured temperature and heart rate are displayed locally on an OLED display and simultaneously uploaded via Wi-Fi to the cloud services (Blynk and ThingSpeak) for remote monitoring. The device demonstrates temperature accuracy within ±0.3°C and heart rate accuracy within a few BPM compared to reference devices."
  },
  {
    "date": "2026-1-27",
    "title": "The Need for Up- &amp; Re-Skilling of Staff of Universities of Applied Sciences in Ethiopia",
    "authors": "Ephrem Tekle, Margareth Gfrerer",
    "publish": "2025 7th Experiment@ International Conference (exp.at'25)",
    "url": "https://doi.org/10.1109/exp.at2565440.2025.11348287",
    "source": "IEEE",
    "abstract": "Universities of Applied Sciences (UAS) are new to Ethiopia. On the Ethiopian Ministry of Education's initiative fifteen universities were transformed to U ASs. Neither the academic staff nor the administrative staff of these universities are prepared to fit into the requirements of an UAS. Therefore, up-skilling and re-skilling have become an important issue. Together with European partners the Ethiopian UASs are trying to learn what it means to be staff (academic or administrative) of an UAS. The research question works on “How to qualify lecturers for the future - the unknown?” It is of special interest, whether the ongoing up-skilling and re-skilling projects have a certain focus on the future as described by A. Toffler. This research checks in a first step A. Toffler's vision on ‘Education in the Future Tense’ against the two ongoing Erasmus+ capacity building higher education projects in order to find out whether the ongoing projects meet the requirements as set out in the book ‘Future Shock’ published in 1970. The literature review presents a brief summary of the book's chapter on education. Followed by an insight of the two projects and the clarification of the important terms of uncertainty-future-futureness. The discussion brings light on what has been or has not been considered in the ongoing projects. A comparison of Bloom's Taxonomy with the Ahvenainen's futureness approach will demonstrate how academic staff could/should be trained to gain interest in playing with uncertainty for the sake of preparing students for the unknown future."
  },
  {
    "date": "2026-1-27",
    "title": "Research on Obstacle Avoidance Maneuver Decision-Making Technology Based on Safety Reinforcement Learning",
    "authors": "Shi Qiu, Zhiyuan Gu, Ziwei Zheng, Shouzhao Sheng",
    "publish": "2025 9th International Symposium on Computer Science and Intelligent Control (ISCSIC)",
    "url": "https://doi.org/10.1109/iscsic67494.2025.11351967",
    "source": "IEEE",
    "abstract": "This research tackles the critical challenge of maneuver decision-making for obstacle avoidance in high-speed helicopter nap-of-the-earth (NOE) flight by proposing a safetyenhanced Reinforcement Learning (RL) approach. To address the significant limitation of conventional SAC-Lagrangian algorithms, which often impose insufficient penalties for safety constraint violations, we introduce a novel Lyapunov-Barrier Soft Actor-Critic (LB-SAC) algorithm. This method synergistically integrates Lyapunov stability theory with control barrier functions, creating a dual-layer safety assurance mechanism that explicitly enforces stability constraints and hard safety boundaries during policy optimization. Extensive experimental results in complex mountainous terrains demonstrate the superiority of the LB-SAC-based decisionmaking model, showing a remarkable reduction in constraint violation rates to just <tex xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">$\\mathbf{1 8 \\%}$</tex> of baseline algorithms and a 32% improvement in mission completion efficiency. Our approach significantly outperforms existing deep RL methods, establishing a new paradigm for autonomous flight decisionmaking that harmonizes stringent safety guarantees with high operational performance in high-risk environments."
  },
  {
    "date": "2026-1-27",
    "title": "Multi-Modal Semantic Segmentation Based on Spike Encoding and Early Fusion with Events and Images",
    "authors": "Zhuxi Li, Qiugang Zhan, Ran Tao, Peiming Kan, Zhiguang Qin, Guisong Liu",
    "publish": "2025 International Conference on Machine Intelligence and Nature-Inspired Computing (MIND)",
    "url": "https://doi.org/10.1109/mind67540.2025.11351727",
    "source": "IEEE",
    "abstract": "Event and frame-based cameras provide complementary sensing modalities for semantic segmentation: event streams capture fine-grained temporal dynamics, while frame-based images offer dense spatial and semantic information. Spiking Neural Networks (SNNs), inspired by biological neural computation, are inherently suited to modeling the temporal characteristics of event data. Therefore, we propose a hybrid ANN-SNN segmentation framework that leverages a Spiking Dynamics Encoding (SDE) module for temporal encoding of event streams and Artificial Neural Network (ANNs) for extracting spatial and semantic features from images. The SDE employs Leaky Integrate-and-Fire (LIF) neurons to transform asynchronous event streams into spatiotemporal confidence maps, enabling adaptive capture of motion-sensitive cues. Besides, to effectively integrate heterogeneous features from both modalities, we design an Early Cross-Modal Fusion (ECMF) module that concatenates and fuses low-level features from both branches through a shared convolutional layer at the initial processing stage. Experimental results on the DSEC and DDD17 datasets validate the effectiveness of the proposed framework in enhancing temporal modeling and cross-modal feature integration for multimodal semantic segmentation."
  },
  {
    "date": "2026-1-27",
    "title": "A Target Detection Method of Pulse Group Frequency Agile Radar",
    "authors": "Yichen Shan, Baoqing Xu",
    "publish": "2025 17th International Conference on Signal Processing Systems (ICSPS)",
    "url": "https://doi.org/10.1109/icsps66615.2025.11347629",
    "source": "IEEE",
    "abstract": "The signals are not correlated in frequency agile radar between different pulse groups, and the signal-to-noise ratio fluctuates seriously, which brings great difficulty for target detection. In view of this, a target detection method of pulse group frequency agile radar is proposed. Firstly, the optimal number of pusle groups and pulse number inside each pulse group are determined by accumulated loss curve of fast-fluctuating signal. Secondly, the matched MTD filters are designed according to the change of the clutter spectrum width of different pulse groups, then pulse compression and MTD are performed for each group. Finally, accumulating the data of the same velocity channel in each pulse group through the mapping relationship between doppler domin and velocity domin, then perform the CFAR detection. Simulation experiments shows that the proposed method has good detection performance and clutter suppression performance, and it has a certain superiority."
  },
  {
    "date": "2026-1-27",
    "title": "Evolutionary Nanorobotic Design Based on Bioinformation Feedback",
    "authors": "Weiqi Liu, Jiawei Zou, Shaolong Shi",
    "publish": "2025 International Conference on Machine Intelligence and Nature-Inspired Computing (MIND)",
    "url": "https://doi.org/10.1109/mind67540.2025.11351792",
    "source": "IEEE",
    "abstract": "We study a novel design technology for nanorobots, aiming to address the issue of self-driven nanorobotic design based on evolutionary computation. By using evolutionary algorithms, candidate solutions for nanorobots with specific functions are automatically designed with a computer, where the biological gradient field (BGF) induced by tumor lesions provides auxiliary knowledge for the design of the morphology, function, and adaptive behavior of nanorobots in complex biological environments. Traditional robot design methods separate the design of robotic structure and control system, leading to limitations in adaptability and scalability. To tackle this problem, we adopt a ‘de novo design’ research paradigm, discovering and optimizing efficient robot structures and behaviors by simulating the process of natural selection, and uses BGF to dynamically guide the evolutionary process by embedding environmental feedback into genetic coding as auxiliary information. Furthermore, to enhance the generalizability of BGF, we employ a multi-physics field model for simulation modeling. Computer simulation experimental results validate the effectiveness and scalability of the proposed method for nanorobotic design."
  },
  {
    "date": "2026-1-27",
    "title": "A Survey of Domain-specific Fine-tuned Large Language Models",
    "authors": "Paria Sarzaeim, Akramul Azim, Gary Bauer, Masoud Makrehchi",
    "publish": "IEEE Access",
    "url": "https://doi.org/10.1109/access.2026.3658096",
    "source": "IEEE",
    "abstract": "The advancement of large language models (LLMs), such as GPT-3, BERT, and Llama, has introduced a new era in natural language processing (NLP) as they have demonstrated exceptional capabilities across diverse tasks. Fine-tuning these LLMs with domain-specific data has become a popular practice, particularly in domains like education, law, medicine, and software development. This process not only empowers LLMs with domain knowledge but also enhances their capabilities by addressing issues such as reliability and reducing the chance of hallucination. This survey examines a range of domain-specific fine-tuned models by highlighting their unique characteristics, enhancements in performance, and the challenges they address, including the demand for extensive computational resources. Furthermore, we explore the fine-tuning methodologies, including instruction tuning used in the development of these models, and ultimately, inform future research on the existing gaps and how to enhance the effective application of LLMs across diverse domains."
  },
  {
    "date": "2026-1-27",
    "title": "Quantification of Major Depressive Disorder via Spectrogram-Based Analysis of Electroencephalography Signals",
    "authors": "Maryam Khan Afridi, Aamir Arsalan, Nargis Bibi",
    "publish": "2025 27th International Multitopic Conference (INMIC)",
    "url": "https://doi.org/10.1109/inmic65900.2025.11348429",
    "source": "IEEE",
    "abstract": "This paper investigates the application of spectrogram-based analysis of electroencephalography (EEG) signals for the quantification of Major Depressive Disorder (MDD), employing a transfer learning approach with pretrained deep neural networks. The study involved creating spectrograms from EEG data collected from 61 subjects, including 32 diagnosed with MDD and 29 healthy controls. These spectrograms were used as inputs to fine-tune pre-trained models (VGG16, VGG19, and ResNet50) to classify MDD patients and healthy controls. The experimental results reveal that the ResNet50 architecture outperformed other deep learning models by achieving a classification accuracy of 98.54% by utilizing the EEG data from only the 3 parietal region electrodes. The findings of the study underscore the potential of EEG-based approaches in the effective diagnosis and quantification of MDD."
  },
  {
    "date": "2026-1-27",
    "title": "2025 7th Experiment@ International Conference (exp.at'25)",
    "authors": "N/A",
    "publish": "N/A",
    "url": "https://doi.org/10.1109/exp.at2565440.2025",
    "source": "IEEE",
    "abstract": ""
  },
  {
    "date": "2026-1-27",
    "title": "Robustness of Question Answering Systems in the Biomedical Domain: a study of the BioASQ dataset",
    "authors": "Andrew Reeves, Hang Dong",
    "publish": "2025 12th International Conference on Information Technology (ICIT)",
    "url": "https://doi.org/10.1109/icit64950.2025.11049250",
    "source": "IEEE",
    "abstract": "Robustness is a critical consideration when integrating artificial intelligence (AI) systems into decision-making processes. This concern is particularly relevant for generative AI systems, which are designed to consistently produce convincing outputs but can be prone to hallucinations, risking overconfidence in their outputs. This paper investigates the performance of fine-tuning and retrieval augmented generation (RAG) under external data quality perturbations, including typographical errors and factual inaccuracies. Results from experiments using the BioASQ Task 12b question answering dataset and PubMed articles showed nuanced trade-offs, with either RAG or fine-tuning performing better for different scenarios. Furthermore, an analysis of LLMs’ self-reported confidence scores indicated a tendency toward overconfidence, particularly in the presence of inconsistent or erroneous context data. A novel mitigation strategy, leveraging an LLM for data quality error correction was evaluated, but the results demonstrated limited effectiveness, highlighting the need for more advanced correction techniques."
  },
  {
    "date": "2026-1-27",
    "title": "Penetration Testing of a Merchant Payment Platform; Systemic Vulnerabilities and Compliance-Centric Mitigation",
    "authors": "Ahmad H. Al-Omari",
    "publish": "2025 12th International Conference on Information Technology (ICIT)",
    "url": "https://doi.org/10.1109/icit64950.2025.11049241",
    "source": "IEEE",
    "abstract": "Merchant Payment Platform (MPPs) are vital systems in today’s financial world, handling payments, transactions, and customer support all in one place. However, their complexity, especially when serving multiple businesses on the same platform makes them a magnet for cyberattacks. In this study, we rigorously tested an MPP and uncovered eleven exploitable weaknesses, including critical flaws like price manipulation, unauthorized access to sensitive data, and tampered transactions. Using a mix of automated tools (like Nessus and Burp Suite) and hands-on hacking techniques, we identified these issues while aligning our work with top security standards such as the OWASP Top 10 2023 and PCI DSS v4.0. Our findings highlight how vulnerabilities in one part of the system can cascade into others, emphasize the importance of compliance with regulations like General Data Protection Regulation (GDPR) and Payment Card Industry Data Security Standard (PCI DSS), and offer practical fixes, such as tightening access controls, validating data server-side, and embedding security into development processes to help businesses safeguard these critical platforms against evolving threats"
  },
  {
    "date": "2026-1-27",
    "title": "A Median Enhancement Attention Network for Highway Traffic Hazy Image Enhancement",
    "authors": "Xiaoyong Li, Fuchun Zhu, Haofang You, Ye Wang, Yang Chen, Wenjie Zhang, Xinyi Xu, Zheng Liang",
    "publish": "2025 17th International Conference on Signal Processing Systems (ICSPS)",
    "url": "https://doi.org/10.1109/icsps66615.2025.11347915",
    "source": "IEEE",
    "abstract": "Foggy highway images often suffer from issues like color cast, low contrast, and blurry details, primarily caused by light scattering and absorption in the atmosphere. These problems bring significant obstacles to traffic vision tasks. To solve these limitations in foggy image enhancement, we propose a median enhancement attention network based on supervised learning, named MEANet. Specifically, first, we process the image with different convolution kernels to obtain multiscale features, and then fuse these features to acquire more abundant information. Subsequently, we design a median attention module to balance color and improve details, incorporating pixel attention and channel attention. To enhance feature extraction, we introduce median pooling within the median attention module. Finally, qualitative and quantitative evaluations demonstrate that our method outperforms other methods in both dehazing for highway scenes and underwater image enhancement."
  },
  {
    "date": "2026-1-27",
    "title": "Augmented Reality as a Transformative Tool in Engineering Education: Analysing its Impact on Learning and Engagement",
    "authors": "Babatunde Azeez Agboluaje, James Uhomoibhi",
    "publish": "2025 7th Experiment@ International Conference (exp.at'25)",
    "url": "https://doi.org/10.1109/exp.at2565440.2025.11348298",
    "source": "IEEE",
    "abstract": "Augmented reality (AR) technology is being recognized as a valuable tool in the educational landscape, particularly in engineering. Despite the predominance of two-dimensional media in educational contexts, AR technology offers a unique opportunity to enhance the learning experience by integrating physical and virtual environments. This study explores the transformative potential of Augmented Reality (AR) as an innovative tool in engineering education through a systematic review of 85 peer-reviewed studies investigating AR's role within educational frameworks, specifically emphasising engineering education. Analysis was made to identify key themes, existing barriers, and gaps in current research and propose future directions for integrating AR into engineering curricula. This study highlights the significance of promoting AR as a transformative educational tool to enhance future educational results and quality. The findings suggest that augmented reality has the potential to revolutionize education by increasing accessibility and engagement for people from a variety of backgrounds."
  },
  {
    "date": "2026-1-27",
    "title": "Measurement of 5G-NR Signal in V2I Environment in 5 GHz Band by Software-defined Radio System",
    "authors": "Hiroshi Harada, Masaki Shimomura, Shota Mori, Norichika Ohmi",
    "publish": "2025 IEEE Virtual Conference on Communications (VCC)",
    "url": "https://doi.org/10.1109/vcc67261.2025.11351118",
    "source": "IEEE",
    "abstract": "A measurement system using software-defined radio technology to acquire the transmission characteristics of Fifth Generation New Radio (5 G -NR) signals was developed for vehicle-to-everything (V2X) environments. Using this system, the radio wave propagation characteristics and the block error rate characteristics of 5 G -NR signals in a vehicle-to-infrastructure (V2I) environment at a real intersection with two lanes on each side were measured in the $\\mathbf{5 ~ G H z}$ band. The results show that the 5 GHz frequency band has strong directionality; however, when the transmitter was placed at a height of approximately 13 m and the receiver was mounted on a vehicle with a height of 1.5 m, using a horizontal plane omnidirectional antenna and a vertical plane antenna with a half-power beamwidth of 9° and a transmit power of approximately 15 dBm, it was possible to maintain a communication range of roughly $40-60 \\mathrm{~m}$ around the intersection, even when the vehicle was moving within the intersection environment."
  },
  {
    "date": "2026-1-27",
    "title": "Exploiting CRUSAP: An Adversarial Security Evaluation of a Lightweight RFID Protocol",
    "authors": "Aiman Malik, Amna Amjid, Madiha Khalid",
    "publish": "2025 27th International Multitopic Conference (INMIC)",
    "url": "https://doi.org/10.1109/inmic65900.2025.11348322",
    "source": "IEEE",
    "abstract": "Ultra-lightweight authentication protocols are essential for resource-constrained environments such as RFID systems, where conventional cryptographic methods are impractical. The Cloud-based RFID Ultra-Lightweight Secure Authentication Protocol (CRUSAP) employs Bitwise Crossover rearrangement and Rotation-based primitives to achieve secure communication. This paper presents a comprehensive cryptanalytic evaluation, demonstrating that CRUSAP's reversible operations and deterministic design render it vulnerable to practical attacks. Full Disclosure, Desynchronization, and Time-Memory Trade-Off (TMTO) attacks compromise session secrecy and entity authenticity. Experimental analysis shows that 8-bit temporary identifiers (TIDS) are fully recoverable, while 96-bit TIDS can be partially recovered (60%) due to statistical leakage via a Full Disclosure attack. Time-Memory Trade-Off (TMTO) and Desynchronization attacks further allow the extraction of session keys and nonces. Although attacks on larger key sizes may demand significant computational resources, including GPUs and extensive memory, the protocol remains fundamentally vulnerable due to inherent structural weaknesses. Even with dynamic key updates, CRUSAP lacks adequate entropy isolation and structural robustness, highlighting the need for irreversible primitives, protocol redesign, or stronger lightweight authentication schemes."
  },
  {
    "date": "2026-1-27",
    "title": "Generalization Error Analysis for Attack-Free and Byzantine-Resilient Decentralized Learning with Data Heterogeneity_supp1-3657395.pdf",
    "authors": "Qing Ling",
    "publish": "N/A",
    "url": "https://doi.org/10.1109/tsp.2026.3657395/mm1",
    "source": "IEEE",
    "abstract": "Decentralized learning, which facilitates joint model training across geographically scattered agents, has gained significant attention in the field of signal and information processing in recent years. While the optimization errors of decentralized learning algorithms have been extensively studied, their generalization errors remain relatively under-explored. As the generalization error reflects the scalability of a trained model on unseen data and are crucial in determining the performance of a trained model in real-world applications, understanding the generalization error of decentralized learning is of paramount importance. In this paper, we present fine-grained generalization error analysis for both attack-free and Byzantine-resilient decentralized learning with heterogeneous data as well as under mild assumptions, in contrast to prior studies that consider homogeneous data and/or rely on a stringent bounded stochastic gradient assumption. Our results shed light on the impact of data heterogeneity, model initialization and stochastic gradient noise – factors that have not been closely investigated before – on the generalization error of decentralized learning. We also reveal that Byzantine attacks performed by malicious agents largely affect the generalization error, and their negative impact is inherently linked to the data heterogeneity while remaining independent on the sample size. Numerical experiments on both strongly convex and non-convex tasks are conducted to validate our theoretical findings."
  },
  {
    "date": "2026-1-27",
    "title": "A Two-Board Design for Interconnected Intelligence in Tiny IoT",
    "authors": "Nil Llisterri Giménez, Felix Freitag, Leandro Navarro, Mennan Selimi",
    "publish": "2025 7th Experiment@ International Conference (exp.at'25)",
    "url": "https://doi.org/10.1109/exp.at2565440.2025.11348263",
    "source": "IEEE",
    "abstract": "Machine learning is nowadays used in tiny micro-controller boards, sometimes called TinyML. At the same time, LoRa Internet of Things (IoT) communication technology can now provide LoRa mesh network topologies that interconnect remote IoT devices. Both tendencies, however, have not converged yet to combine the potential of both. In this paper, we argue for a solution consisting of a two-board design as an architecture for interconnected ML-enabled IoT nodes in a LoRa mesh network. A prototype of the architecture using the TTGO LoRa32 board as a network device and the Arduino Portenta H7 as an application device is implemented as a case study to show the feasibility. We analyze a federated learning protocol design to illustrate how distributed applications can interact within the proposed two-board node architecture. We position the architecture with regard to several performance aspects and observe that the design delivers a separation of concerns by one board hosting the ML-application and the other providing an advanced network service to the application."
  },
  {
    "date": "2026-1-27",
    "title": "A Set-Membership Filter for Group Target Tracking Using Bounded Bearing-Only Measurements",
    "authors": "Jingling Li, Xianbin Gao, Ping Wei, Huaguo Zhang, Lin Gao",
    "publish": "2025 17th International Conference on Signal Processing Systems (ICSPS)",
    "url": "https://doi.org/10.1109/icsps66615.2025.11347948",
    "source": "IEEE",
    "abstract": "In this paper, a set-membership based group target tracking algorithm is proposed for bearing-only measurement scenarios. In set-membership filtering, the initial state, process noise, and measurement noise are usually considered bounded (modeled as compact sets), which allows us to achieve target tracking by propagating the sets containing the target state. Simulation results show the effectiveness of the proposed method, even when the shape of the group target has a tendency to spread."
  },
  {
    "date": "2026-1-27",
    "title": "Event-Triggered Model-Free Adaptive Predictive Control for Networked Wind-Power Microgrids Subject to Aperiodic DoS Attacks",
    "authors": "Rui Hou, Li Jia, Xuhui Bu, Jianfang Li",
    "publish": "IEEE Transactions on Information Forensics and Security",
    "url": "https://doi.org/10.1109/tifs.2026.3657840",
    "source": "IEEE",
    "abstract": "Escalating cybersecurity risks in communication networks pose severe challenges to the stability and reliability of microgrid control systems. This paper investigates the load frequency control problem of nonlinear networked wind-power microgrids under denial-of-service (DoS) attacks and event-triggered communication. A data-driven prediction framework is first established to construct a control-oriented dynamic linearization data model for the underlying nonlinear system. Sub-sequently, a novel event-triggered model-free adaptive predictive control (ET-MFAPC) algorithm with time-varying parameters is proposed, which integrates multi-step adaptive prediction and receding-horizon optimization. The proposed algorithm features several key innovations: 1) An output-related auxiliary variable is designed to circumvent unavailable pseudo-partial derivatives (PPDs) and their sign constraints. 2) An adaptive predictive compensation module is developed to mitigate the impacts of DoS attacks by reconstructing hijacked data packets. 3) An attack-aware online optimization mechanism is formulated to adaptively tune controller gains for improved system performance. Furthermore, a comprehensive security analysis is conducted based on a model-independent data energy function, and explicit boundary conditions are derived for tolerable attack frequency and duration. Finally, the effectiveness and robustness of the proposed method are validated through simulation studies."
  },
  {
    "date": "2026-1-27",
    "title": "Networkless Collision Avoidance for Multiple Vehicles Using Joint Spatial–Temporal Chance-Constrained Optimization_supp1-3651393.mp4",
    "authors": "Dengyu Xiao",
    "publish": "N/A",
    "url": "https://doi.org/10.1109/tmech.2026.3651393/mm1",
    "source": "IEEE",
    "abstract": "Generating high-quality, collision-free trajectories in real time for multiagent systems is challenging due to uncertainties arising from robot localization, network disturbances, and sensor errors. Existing approaches typically address this problem either deterministically, relying on reliable and consistent communication networks, or through approximations that often lead to overly conservative trajectories. In this article, we propose a method for generating trajectories by accounting for collision probabilities involving uncertain neighboring agents and obstacles, which is designed for multiple ground vehicles operating in a communication-free environment with limited detection ranges and Gaussian noise. A receding horizon framework is developed and formulated as a joint spatial–temporal chance-constrained optimization problem using nonlinear model predictive control (JSTC-MPC). To ensure the reliability and computational efficiency of the trajectories, an analytical and tighter approximation of joint spatial–temporal collision probabilities is introduced, effectively handling constraints from neighboring vehicles and obstacles at different JSTC-MPC stages. Furthermore, we propose a real-time replanning strategy that leverages chance-constrained, time-aware Voronoi spaces to address safety concerns in the presence of infeasible solutions. The effectiveness of the proposed method is validated through simulations and real-world experiments."
  },
  {
    "date": "2026-1-27",
    "title": "Technology-Enhanced Dual-Task Testing for Alzheimer’s Disease and Related Dementias: A Review of Trends, Tools, and Emerging Directions",
    "authors": "Mahmoud Seifallahi, Sohini Lahiri, James E. Galvin, Behnaz Ghoraani",
    "publish": "IEEE Transactions on Neural Systems and Rehabilitation Engineering",
    "url": "https://doi.org/10.1109/tnsre.2026.3658013",
    "source": "IEEE",
    "abstract": "Alzheimer’s disease and related dementias (ADRD) are growing global health challenges, projected to affect over 82 million people by 2030. Early diagnosis is essential, offering the potential to extend life expectancy by over 50% and reduce healthcare costs by up to $150,000 per patient. Dual-task (DT) testing—evaluating motor performance under cognitive load—has emerged as a promising, non-invasive method for early ADRD detection. This review provides a comprehensive synthesis of DT-based ADRD assessments from January 2010 to October 2025, integrating insights from engineering and clinical neuroscience. We explore a broad range of DT paradigms (e.g., gait, balance, upperlimb function), sensing technologies (e.g., wearable sensors, electronic walkways, infrared/depth cameras, video, tablets, and brain imaging tools like fMRI and fNIRS), and analytic approaches, from traditional statistics to deep learning. Emerging tools, including eye-tracking and AI-based video pose estimation, are also discussed. We critically examine methodological trends, highlight key findings, and identify current limitations. Emphasizing the need for equitable, scalable, and clinically viable DT systems, this review highlights the role of modern sensor and AI technologies in enhancing early ADRD detection. It serves as a key resource for engineers, data scientists, and clinicians developing technology-driven tools for early detection and monitoring of neurodegenerative diseases."
  },
  {
    "date": "2026-1-27",
    "title": "A 0.018-mm\n                    <sup>2</sup>\n                    0.05-2 GHz Balun-LNA With Post-Linearization and Balanced Loads Achieving 33.5-dBm OIP3 and 3.7-dB NF",
    "authors": "Sinyoung Kim, Donggu Lee, Sukju Yun, Kuduck Kwon",
    "publish": "IEEE Transactions on Circuits and Systems II: Express Briefs",
    "url": "https://doi.org/10.1109/tcsii.2026.3658176",
    "source": "IEEE",
    "abstract": "In this article, a 0.05–2 GHz broadband balun-low-noise amplifier (LNA) achieving high linearity and balanced output loading using a post-linearization current-bleeding (CBLD) technique is presented. The proposed architecture is based on a conventional common-gate (CG) and common-source (CS) balun-LNA topology, in which the CBLD path simultaneously provides symmetric loads and performs post-distortion (PD) linearization without any auxiliary stage or additional current consumption. This dual-function implementation enables significant third-order linearity improvement over a wide frequency range while maintaining low noise and stable input matching. Fabricated in a 28-nm CMOS process, the proposed balun-LNA achieves a noise figure of 3.7–4.1 dB, a maximum voltage gain of 20 dB, and an input return loss (S₁₁) better than −10 dB across a 3-dB bandwidth of 2 GHz. The measured IIP3 ranges from 9.8 dBm to 13.5 dBm, corresponding to a peak OIP3 of 33.5 dBm. The LNA consumes 10.2 mA from a 1.2-V supply and occupies an active area of only 0.018 mm²."
  },
  {
    "date": "2026-1-27",
    "title": "E-mode P-GaN/AlGaN/GaN HEMT with Diode-Engineered Gate Configuration for Extended Gate Voltage Swing",
    "authors": "Jun-Hyeok Yim, Myeongsu Chae, Hyungtak Kim, Ho-Young Cha",
    "publish": "IEEE Electron Device Letters",
    "url": "https://doi.org/10.1109/led.2026.3657806",
    "source": "IEEE",
    "abstract": "A novel enhancement-mode (E-mode) p-GaN/AlGaN/GaN high-electron-mobility transistor (HEMT) featuring a diode-engineered gate configuration was developed to extend the gate voltage swing range. In the proposed design, a small diode is monolithically integrated in series to the p-GaN gate, introducing an additional forward voltage drop to the threshold voltage of the HEMT. This approach significantly increases both the threshold voltage and the maximum allowable gate voltage swing compared to conventional p-GaN gate HEMTs, which typically exhibit low threshold voltages and limited gate swing ranges. The device employs a standard heterostructure, and the compact size of the embedded diode ensures that the increase in chip area is negligible."
  },
  {
    "date": "2026-1-27",
    "title": "A Graph Neural Network-Based Method for Dynamic Path Scheduling in AGV Systems",
    "authors": "Hongchao Ma, Yurun Feng, Huichao Shi",
    "publish": "2025 9th International Symposium on Computer Science and Intelligent Control (ISCSIC)",
    "url": "https://doi.org/10.1109/iscsic67494.2025.11351936",
    "source": "IEEE",
    "abstract": "With the increasing application of Automated Guided Vehicles (AGVs) in intelligent manufacturing, an increasing number of smart workshops rely on AGV systems for material handling and distribution. However, traditional AGV scheduling methods, often based on fixed rules or heuristic algorithms, struggle to adapt effectively to real-world scenarios involving multiple tasks and dynamically complex environments. To address these challenges, this paper proposes an improved AGV material distribution algorithm based on Graph Neural Networks (GNN). The proposed approach models the workshop environment as a graph structure and utilizes Graph Convolutional Networks (GCNs) to deeply extract features from nodes and paths, enabling task node probability prediction and route smoothness scoring. Based on this, a multi-AGV collision-free path planning and conflict avoidance mechanism is designed, taking into account both static priorities and dynamic operational states. This allows for reasonable task sequencing and assignment, ensuring real-time path planning and efficient execution during multi-vehicle collaboration. Simulation experiments under various dynamic multi-task scenarios demonstrate that the proposed method outperforms traditional approaches in task completion efficiency, providing a practical and scalable solution for intelligent workshop scheduling."
  },
  {
    "date": "2026-1-27",
    "title": "An Immersive Virtual Reality Platform for First Aid and Emergency Training",
    "authors": "Marcello A. Carrozzino, Matteo Caponi, Simone Pisani, Bruno Papaleo, Alda Mazzei, Rudy Foddis, Massimo Bergamasco",
    "publish": "IEEE Computer Graphics and Applications",
    "url": "https://doi.org/10.1109/mcg.2025.3635750",
    "source": "IEEE",
    "abstract": "Virtual reality (VR) technologies have emerged as valuable tools for medical and emergency training, providing safe, immersive, and repeatable environments where complex procedures can be practiced effectively. This article presents an immersive VR system designed to train workplace first-aid responders, with a particular focus on cardiopulmonary resuscitation (CPR). The platform integrates a physical CPR manikin with virtual patient overlays through mixed-reality calibration, incorporates realistic emergency scenarios with environmental hazards, and enables synchronous multiuser interaction between trainees and instructors. To assess its potential, we provide a detailed description of the system's architecture and functionalities, introducing the results of an extensive user study employing validated questionnaires on usability, performance, and user experience. The proposed framework contributes to the advancement of VR-based medical education, highlighting its benefits, current limitations, and future research opportunities."
  },
  {
    "date": "2026-1-27",
    "title": "A Smart Clinical Application for Early Diagnosis of Progressive Diseases Using Machine Learning",
    "authors": "Rabab Hamed M. Aly, Asmaa M. Mohamed, Yasmin S. Mortada, Gehad T. Mohamed, Sara S.Abd Elfadil, Hoda M. Amin, Rasha Y. Youssef, Nagwa G. Goher",
    "publish": "2025 1st Future International Conference on Artificial Intelligence and Cybersecurity (FICAC)",
    "url": "https://doi.org/10.1109/ficac65757.2025.11341841",
    "source": "IEEE",
    "abstract": "The early diagnosis of progressive diseases such as liver disease, chronic kidney failure, colon cancer, and Wilson's disease is crucial for the reduction of the humanity rate and therapy management. In this paper, robust models based on a machine learning approach provide very high accuracy measures for kidney disease, liver disease, colon cancer, and Wilson's disease with machine learning techniques. Based on these results, we created a clinical assistant app with AI that significantly improves early detection with three key characteristics. The primary feature involves the real-time analysis of patient data, including symptoms, laboratory findings, and imaging, to accurately identify high-risk individuals for liver and kidney diseases with over 96% certainty. The second feature is monitoring disease progression markers, such as predicting kidney function decline with 96.33% accuracy using AdaBoost to allow for treatment before symptoms appear. Furthermore, the third feature is AI-driven decision support systems that speed up diagnosis, especially for tricky cases such as colon cancer and Wilson's disease. By integrating these models into clinical pipelines, the application fills crucial gaps in early detection, such as the asymptomatic progression of colon cancer or the genetic intricacies of Wilson's disease, enabling doctors to treat patients sooner, based on personal circumstances, and ultimately leading to improved patient survival rates while lowering healthcare costs."
  },
  {
    "date": "2026-1-27",
    "title": "Secrecy Performance Analysis of AmBC-assisted MEC System with Backscatter Device Selection",
    "authors": "Ahmed N. Elbattrawy, Mohamed G. Abd El Ghafour, Ahmed H. Abd El-Malek, Sherif I. Rabia, Waheed K. Zahra",
    "publish": "2025 IEEE Virtual Conference on Communications (VCC)",
    "url": "https://doi.org/10.1109/vcc67261.2025.11351255",
    "source": "IEEE",
    "abstract": "This work investigates the secrecy performance of an ambient backscatter communication (AmBC)-aided mobile edge computing network. A computationally-constrained user offloads its tasks to a computational access point in the presence of a passive eavesdropper. A selection scheme is proposed to select an AmBC user to offload its task, while inducing jamming signals on the eavesdropper. Closed-form expressions are derived for the system success probability (SSP) and the asymptotic SSP over Nakagami- m fading for the interference-limited regime. Numerical results investigate the impact of key parameters on the SSP and show that the proposed selection scheme achieves better performance than the Round-Robin and random selection schemes."
  },
  {
    "date": "2026-1-27",
    "title": "Enhancing Process Mining on Sparse Event Logs: A Simulation-Driven Academic Case Study",
    "authors": "Towfeeq Fairooz, Aleeha Iftikhar, Zeeshan Tariq, Sally McClean, Ian McChesney",
    "publish": "2025 12th International Conference on Information Technology (ICIT)",
    "url": "https://doi.org/10.1109/icit64950.2025.11049219",
    "source": "IEEE",
    "abstract": "Many business processes involve complex, partly automated workflows, with limited timestamp data in the process event log. Sparse event logs limit the opportunity for process analysis and optimization. This paper describes the use of Discrete Event Simulation (DES) to model such processes and to augment sparse event logs with richer, synthetic data, enabling the application of process mining techniques for process enhancement. The approach is illustrated by application to an administrative process in an academic institution, namely an assessment extension request process. The study combines data-driven and knowledge-based approaches to understanding and modeling the existing process. Preliminary data analysis is used to obtain high-level process insights. The paper shows how this lays the foundation for the use of domain knowledge to construct and verify a discrete event simulation model. By integrating process mining with simulation, research can provide actionable insights to improve the efficiency and effectiveness of the current assessment extension request process. Observations are made on how this approach can be applied to other business processes with sparse event logs."
  },
  {
    "date": "2026-1-27",
    "title": "Detecting GAN-Generated Fake Images Using Deep Learning and Feature Analysis",
    "authors": "Sudip Sao, Mohit Ranjan Panda, Tanmay Singh, Subham Singh, Sohalia Sana, Shrestha Saha",
    "publish": "2025 International Conference on Intelligent and Cloud Computing (ICoICC)",
    "url": "https://doi.org/10.1109/icoicc64033.2025.11052138",
    "source": "IEEE",
    "abstract": "The dissemination of extremely realistic deep-fake images created by Generative Adversarial Networks (GANs) is a serious threat to the integrity of digital information in a number of critical fields. The forged images, normally indistinguishable from real ones for the human eye, compromise security systems, media credibility, and the reliability of digital proof for forensics. To address the increasing demand for effective detection, this work presents a new approach that synergistically combines deep learning strategies with advanced feature analysis. The proposed approach is particularly designed for detecting the subtle artifacts and statistical anomalies inherent in the generation process of the GANs. The proposed approach is anticipated to obtain state of-the-art detection performance and improved generalizability across a large number of GAN architectures compared with the current detection strategies. The outcome of this work will be of great significance for the ongoing endeavors toward limiting the detrimental impact of fake images on security, media integrity, and the reliability of digital proof."
  },
  {
    "date": "2026-1-27",
    "title": "Sentiment Analysis of Hazardous Events and Disasters",
    "authors": "Pranav Daga, Siddhesh Dumre, Madhuri Rao, Kulamala Vinod Kumar, Sumegh Tharewal, Dhanajay Bhagat",
    "publish": "2025 International Conference on Intelligent and Cloud Computing (ICoICC)",
    "url": "https://doi.org/10.1109/icoicc64033.2025.11052003",
    "source": "IEEE",
    "abstract": "This research addresses the critical need to understand the emotional and psychological impact of hazardous events and disasters by applying sentiment analysis to social media and textual data, specifically focusing on Twitter. Traditional disaster assessment often lacks insight into public sentiment, a vital factor for effective response and recovery. This paper explores the application of natural language processing (NLP) techniques to analyze public discourse on Twitter before, during, and after major disasters. The primary objective is to develop a robust sentiment analysis framework capable of accurately assessing and interpreting public sentiment using advanced NLP methods tailored for the characteristics of Twitter. This includes addressing challenges such as the real-time analysis requirements of Twitter’s rapid, short-form posting style, the noisy and ambiguous nature of tweet data, and the need to capture evolving public reactions as events unfold. By identifying sentiment trends and patterns on Twitter, this research aims to provide timely and actionable insights for disaster management agencies, policymakers, and humanitarian organizations to enhance disaster preparedness, response strategies, and communication efforts. This approach seeks to leverage the immediate feedback provided by Twitter to complement traditional disaster assessment methods, incorporating the crucial dimension of public emotional well-being during crises. The work presented here provides and interesting rationale that combines public sentiment with machine learning techniques for effectively handling disaster response."
  },
  {
    "date": "2026-1-27",
    "title": "Securing Smart Supply Chains with Adaptive AI Agents: A Virtual Simulation Framework",
    "authors": "Haidar Jabbar, Samir Al-Janabi",
    "publish": "2025 12th International Conference on Information Technology (ICIT)",
    "url": "https://doi.org/10.1109/icit64950.2025.11049299",
    "source": "IEEE",
    "abstract": "The increasing complexity of modern supply chains necessitates advanced, adaptive cybersecurity solutions. This paper proposes a multi-layered defense framework leveraging Artificial Intelligence (AI) agents, combining Convolutional Neural Networks (CNNs) for sensory anomaly detection, Recurrent Neural Networks (RNNs) for network-level threat identification, and Reinforcement Learning (RL) for autonomous threat mitigation. A collaborative agent architecture is introduced to enhance detection accuracy, threat correlation, and adaptive response effectiveness across distributed supply chain systems. The framework is evaluated using a Python-based NS-3 simulation with synthetic traffic, achieving 94% detection accuracy while maintaining low false positive rates. While synthetic data validates the initial design, future work will extend evaluation to real-world cloud environments and address explainability challenges. This integrated approach offers a scalable and resilient model for securing smart supply chains against evolving cyber threats."
  },
  {
    "date": "2026-1-27",
    "title": "A Comprehensive Exploration of Machine Learning Models for Banknote Authentication",
    "authors": "Amiya Ranjan Panda, Janbhi Tripathy, Priti Mohan Pattanayak, Manoj Kumar Mishra, Mahendra Kumar Gourisaria, Junali Jasmine Jena",
    "publish": "2025 International Conference on Intelligent and Cloud Computing (ICoICC)",
    "url": "https://doi.org/10.1109/icoicc64033.2025.11052182",
    "source": "IEEE",
    "abstract": "Banknotes are legally issued instruments that represent monetary value and are sanctioned by governmental authorities. However, their high value and widespread use have made them a frequent target for counterfeiting. Due to the striking similarity between genuine and counterfeit notes, accurately distinguishing between the two poses a considerable challenge. This study aims to evaluate the performance of various machine learning models using the Banknote Authentication dataset, with the objective of identifying the most effective model for classifying banknotes as genuine or counterfeit. The models employed include Logistic Regression, Support Vector Machine, Random Forest, K-Nearest Neighbor, XGBoost Classifier, and Naive Bayes. Model robustness was validated using a Train-Test split methodology, with accuracy serving as the primary evaluation metric. Among the models tested, the XGBoost Classifier demonstrated the highest accuracy of 99.7273%, followed by K-Nearest Neighbor, Random Forest, Support Vector Machine, Logistic Regression, and Naive Bayes. The findings of this research provide valuable insights that may inform the development of more accurate and reliable predictive systems for banknote authentication."
  },
  {
    "date": "2026-1-27",
    "title": "SFI: A Practical and Efficient Backdoor Attack Framework against Split Learning",
    "authors": "Fangchao Yu, Bo Zeng, Kai Zhao, Zhi Pang, Lina Wang",
    "publish": "IEEE Transactions on Dependable and Secure Computing",
    "url": "https://doi.org/10.1109/tdsc.2026.3654766",
    "source": "IEEE",
    "abstract": "Split learning is a computing resource-friendly distributed learning framework that protects client training data by splitting the model between the client and server. Previous work has proved that split learning faces a severe risk of privacy leakage, as a malicious server can recover the client's private data by hijacking the training process. In this paper, we explore the vulnerability of split learning to server-side backdoor attacks, where our goal is to compromise the model's integrity. Since the server-side attacker cannot access the training data and client model in split learning, the traditional poisoning-based backdoor attack methods are no longer applicable. Therefore, constructing backdoor attacks in split learning poses significant challenges. Our strategy involves the attacker establishing a shadow model on the server side that can encode backdoor samples and guide the client model in learning from this model during the training process, thereby enabling the client to acquire the same capability. Based on these insights, we propose a backdoor attack framework named SFI. Our attack framework minimizes assumptions about the attacker's background knowledge and ensures that the attack remains imperceptible to the client. We implement SFI on various benchmark datasets, and extensive experimental results demonstrate its effectiveness and generality."
  },
  {
    "date": "2026-1-27",
    "title": "Medical Data Security in Blockchain: A telemedicine data sharing scheme based on custom OPE and 4D-YG hyperchaotic",
    "authors": "Zhenlong Man, Chang Gao, Ze Yu, Xiangfu Meng",
    "publish": "IEEE Transactions on Circuits and Systems for Video Technology",
    "url": "https://doi.org/10.1109/tcsvt.2026.3657760",
    "source": "IEEE",
    "abstract": "Aiming at the problems of sensitive data leakage and unauthorised direct access faced during the storage and transmission of shared medical data, this paper proposes a new medical data security sharing scheme based on blockchain. Firstly, to ensure the security and randomness of the keys in the scheme, a new 4D-YG hyperchaotic key generator is designed. Secondly, self-expanding fractal Sierpinski triangle permutating operation is performed on medical images to achieve image decentring effect. Utilize a custom Order-Preserving Encryption (OPE) algorithm to diffuse it, ensuring consistency in pixel order before and after encryption. Subsequently, mix-bit triple normalized diffusion is performed on the images that have completed preliminary diffusion to enhance the resistance of privacy data within the image to attacks. Finally, the decryption permission for encrypted shared medical data is restricted through smart contracts in the blockchain. While achieving secure transmission of medical data, it enables hospitals to perform medical image segmentation and organ recognition diagnostics on shared data in an encrypted state, which is more in line with practical needs. According to performance test data, the proposed encryption algorithm can effectively resist differential attacks and frequency attacks, and the Number of Pixels Change Rate (NPCR) test results can reach the ideal value of 99.6094%."
  },
  {
    "date": "2026-1-27",
    "title": "A Finite State Automaton for the Tsetlin Machine Using High-Capacity Resettable D Flip-Flop Cells",
    "authors": "Zeyu Han, Nobuyuki Yoshikawa, Yuki Yamanashi",
    "publish": "IEEE Transactions on Applied Superconductivity",
    "url": "https://doi.org/10.1109/tasc.2026.3657683",
    "source": "IEEE",
    "abstract": "Single Flux Quantum (SFQ) circuits provide ultrafast operation and low power consumption, making them attractive candidates for machine learning accelerators. The Tsetlin Machine (TM) is a low-complexity and highly interpretable architecture, organized as a voting system of propositional clauses. In the TM, an ensemble of finite-state automata (FSAs), called Tsetlin automata, independently decides whether to include or exclude specific literals. The chosen literals are assembled into propositional clauses that collectively form the voting system, while each FSA updates its state based on rewards or penalties determined by the prediction outcome. However, existing FSA designs for TM based on SFQ circuits still suffer from either a narrow margin or excessive circuit area. To achieve compact and stable state transitions using SFQ circuits, we designed High-Capacity Resettable D Flip-Flop (HC-RDFF) cells by cascading storage loops. The proposed FSA was implemented using two HC-RDFFs to store the include and exclude states, respectively. The FSA with 16 states requires only 395 Josephson junctions with a static power of approximately 128 μW, exhibiting a bias margin of −21% to +25% at low speed and a maximum operating frequency of 20 GHz in simulation. We fabricated the HC-RDFF and the FSA using a 10 kA/cm² Nb four-layer superconducting process and verified their correct operation through low-speed measurements. The number of FSA states can be increased simply by extending the cascaded storage loops in the HC-RDFFs. We expect the proposed FSA to be suitable for constructing stable TM systems based on SFQ circuits with reduced hardware costs."
  },
  {
    "date": "2026-1-27",
    "title": "Large-Scale Planar Array Near-Field Calibration Based on Plane Wave Spectrum Maclaurin Expansion",
    "authors": "Yuanhua Tang, Zhengpeng Wang, Wei Fan, Xiaoming Chen, Steven Gao",
    "publish": "IEEE Transactions on Antennas and Propagation",
    "url": "https://doi.org/10.1109/tap.2026.3655463",
    "source": "IEEE",
    "abstract": "This paper introduces a novel near-field calibration method for large-scale planar arrays. A novel signal model is developed by representing the plane wave spectrum (PWS) corresponding to the measured signals as a Maclaurin series expansion. By performing the Fourier transform of each polynomial term in this expansion, the measured signals can be expressed as a linear combination of the derivatives of the free-space scalar Green’s function. The initial excitations and Maclaurin coefficients are jointly estimated through iterative minimization of an evaluation function, which is defined by measuring the difference between the measured signals and the virtual signals computed using the proposed signal model. An alternating optimization strategy is employed to ensure fast and efficient convergence of the minimization process. A 6 × 9 planar array composed of rectangular open-ended open waveguides was calibrated at a measurement distance of 0.5 m using the proposed method, achieving a calibration error range of ±0.58 dB and ±4.9°. The calibration was conducted using probe measurements over approximately one-quarter of the AUT aperture, with a 3 × 3 uniformly spaced rectangular sampling grid within this scanning region. The obtained results validate the effectiveness of the proposed calibration method."
  },
  {
    "date": "2026-1-27",
    "title": "Effects of sequential dual-target TMS on the dynamic characteristics of brain networks as revealed by fNIRS",
    "authors": "Lingling Chen, Yanglong Wang, Congcong Huo, Guangjian Shao, Xingshuo Dong, DongSheng Xu, Zengyong Li",
    "publish": "IEEE Transactions on Neural Systems and Rehabilitation Engineering",
    "url": "https://doi.org/10.1109/tnsre.2026.3657761",
    "source": "IEEE",
    "abstract": "Transcranial magnetic stimulation (TMS) modulates cortical excitability to promote neuroplasticity, but single-target TMS has limited effects on multi-region synergy. Sequential dual-target TMS may enhance brain network reorganization through temporal stimulation, though its mechanisms remain unclear. This study investigates the immediate effects of single- and dual-target TMS on brain functional networks in stroke patients using functional near-infrared spectroscopy (fNIRS) and dynamic functional connectivity (dFNC) analysis. Fifteen subacute stroke patients and fifteen healthy controls underwent three interventions: single-target SMA-rTMS, single-target LDLPFC-rTMS, and sequential dual-target stimulation (Dual-rTMS). fNIRS data were analyzed via dFNC to identify connectivity states (weak, moderate, strong) and evaluate time fraction, state transitions, global efficiency, and total signal power. Results revealed three dFNC states: State 1 (weak connectivity, 44.24%), State 2 (moderate, 39.44%), and State 3 (strong, 16.32%). Single-target TMS (especially SMA-rTMS) increased time fraction in State 1, indicating low-connectivity induction, while Dual-rTMS further prolonged State 1 and reduced inefficient transitions (e.g., State 1→2: p < 0.005). Stroke patients showed impaired transitions from State 2→3 (p = 0.024) versus controls. Time fraction in State 3 correlated positively with motor function scores (FMA-LE: r = 0.52, p = 0.045; BBS: r = 0.52, p = 0.047), while State 1 correlated negatively (FMA-LE: r = -0.52, p = 0.045). Sequential dual-target TMS optimizes network dynamics by sustaining low-energy states and suppressing maladaptive transitions, outperforming single-target approaches. dFNC temporal patterns may serve as biomarkers for post-stroke motor function, supporting sequential dual-target TMS as a promising rehabilitation tool."
  },
  {
    "date": "2026-1-27",
    "title": "Treating the Filter Weights as Learnable Functions: An Efficient Nonlinear Filtering Framework and Its Adaptive Algorithms",
    "authors": "Mingjing Cui, Dongyuan Lin, Lei Li, Yunfei Zheng, Shiyuan Wang",
    "publish": "IEEE Transactions on Signal Processing",
    "url": "https://doi.org/10.1109/tsp.2026.3657751",
    "source": "IEEE",
    "abstract": "Adaptive filters, constrained by a linear filtering framework, often struggle with nonlinear modeling in complex processes. Kernel adaptive filters (KAFs) offer a promising solution by mapping input signals into diverse feature spaces. However, their computational efficiency and filtering accuracy may still not meet the demands of practical applications. To this end, based on Kolmogorov-Arnold (KA) representation theorem, this paper proposes a novel nonlinear filtering framework by treating filter weights as learnable functions. Specifically, the learnable functions are represented as a linear combination of multiple Gaussian basis functions with different centers. To determine the coefficients that define these learnable functions, the weight-learning-based least mean square (WL-LMS) and weight-learning-based recursive least squares (WL-RLS) algorithms are further proposed based on minimum mean square error (MMSE). In addition, to ensure convergence and assess the steady-state and transient performance of proposed algorithms, a thorough theoretical analysis of the convergence conditions and excess mean square error (EMSE) is provided. Finally, linear-in-parameters system identifications validate the correctness of theoretical analysis, while chaotic time-series prediction and nonlinear system identifications demonstrate the superiorities of the proposed WL-LMS and WL-RLS algorithms."
  },
  {
    "date": "2026-1-27",
    "title": "Human-Autonomous System Interaction Graphical Notation (HASIGN): How Do We Design for Human-Multi-AGV Interaction in Manufacturing Intralogistics?",
    "authors": "Rana El Khoury, Denis Zatyagov, Igor Rybalskii, Karl Kruusamäe, Jonas S.I. Rieder, Walter Quadrini, Thomas Trautner, Martijn Verbeij, Cecilia Colloseus, Doris Aschenbrenner",
    "publish": "ACM Transactions on Autonomous and Adaptive Systems",
    "url": "https://doi.org/10.1145/3786782",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-1-27",
    "title": "Evaluating the Performance of Three IHS-based Pansharpening Techniques",
    "authors": "Ouahab Adelwhab, Hautia Cherifa",
    "publish": "2025 12th International Conference on Information Technology (ICIT)",
    "url": "https://doi.org/10.1109/icit64950.2025.11049101",
    "source": "IEEE",
    "abstract": "Pansharpening, the process of fusing low-resolution multispectral (MS) images with high-resolution panchromatic (Pan) images, is crucial in enhancing the spatial and spectral quality of satellite imagery. This study evaluates three variations of the Intensity-Hue-Saturation (IHS) pansharpening technique: traditional IHS, Fast IHS with Spectral Adjustment (FIHS), and FIHS with Spectral Adjustment (FIHS-SA). Using satellite images from IKONOS, PLEIADES, QuickBird, and WorldView, we employ evaluation metrics including the Spatial Correlation Coefficient (SCC), Correlation Coefficient (CC), and Quality Noise Ratio (QNR) to assess the performance of each method. The results indicate that while traditional IHS provides acceptable spatial enhancement, it suffers from notable spectral distortions. In contrast, both FIHS and FIHS-SA demonstrate improved spectral fidelity, with FIHS-SA exhibiting superior performance across all tested images. This research underscores the significance of selecting appropriate pansharpening techniques to achieve optimal outcomes in various remote sensing applications, emphasizing the balance between spatial enhancement and spectral integrity."
  },
  {
    "date": "2026-1-27",
    "title": "Evaluating Administrative Accountability for Artificial Intelligence Application Errors in Jordan: Legal and Ethical Implications",
    "authors": "Mohmmad Husien Almajali, Ala’ A. Masarweh, Ihab Fahmi Rayyan",
    "publish": "2025 12th International Conference on Information Technology (ICIT)",
    "url": "https://doi.org/10.1109/icit64950.2025.11049218",
    "source": "IEEE",
    "abstract": "The world is progressively adopting Artificial Intelligence (AI) across all sectors to improve productivity, decision-making, and service provision. In Jordan, AI is being investigated in many fields, such as healthcare, education, financial services, and government activities. However, the tendency to rapidly embrace AI technologies presents unique challenges, one of the most serious being failures within the system and the legal accountability of individuals and organizations operationally responsible for the systems within which the mistakes are made. The article intends to identify legal responsibility in case a person or administrative organization is to be blamed for AI application inaccuracies in Jordan, focusing intensely on the social and legal consequences. The analysis emphasizes the country's existing legal documents, the ethical aspects of the application of AI technology, and the comprehensive plan for administrative responsibility. The analysis of the components makes it possible to understand better how Jordan can cope with the problems of AI governance and bear the consequences of malfunctioning AI systems and ethical misconduct at the hands of powerful AI."
  },
  {
    "date": "2026-1-27",
    "title": "A Portable Femtoampere-Sensitive Readout System for a High-Pressure Argon Ionization Chamber",
    "authors": "R. Bıyık, T. Yalçın, O. Alaçayır",
    "publish": "IEEE Transactions on Instrumentation and Measurement",
    "url": "https://doi.org/10.1109/tim.2026.3657559",
    "source": "IEEE",
    "abstract": "This paper presents the design, implementation, and validation of a portable femtoampere-sensitive electronic readout system for a high-pressure argon-filled ionization chamber (IC) radiation detector. The system integrates a custom-built ionization tube with a low-noise analog front-end, precision digital processing, and a power-efficient embedded platform. At its core is a transimpedance amplifier (TIA) based on an electrometergrade op-amp (ADA4530-1), enabling accurate conversion of ionization currents in the femtoampere range. A dual-path amplification architecture ensures dynamic range adaptability across low and high dose rate conditions. The digital subsystem— featuring a 16-bit Sigma-Delta ADC-equipped STM32 microcontroller—handles real-time digitization, temperature compensation, and self-adjustment offset via integrated DACs. The device was calibrated and tested at the Secondary Standard Dosimetry Laboratory (SSDL) of the Turkish Nuclear Energy Research Institute (TENMAK), covering a wide radiation range from 3 μSv/h to 60 mSv/h using multiple <sup xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">137</sup>Cs sources. The system demonstrated excellent linearity (R² > 0.998), with a minimum detectable dose rate of approximately 2 μSv/h, and maintained a total measurement error below 10%. These results affirm the device’s suitability for portable, high-precision radiation monitoring in field and safety applications. The novelty of this work lies in the integration of a high-pressure argon ionization chamber with a dual-path femtoampere readout front-end and a fully self-adjusting digital control unit, enabling portable, low-dose-rate detection below 3 μSv/h."
  },
  {
    "date": "2026-1-27",
    "title": "RDKD-SAR: An RT-DETR knowledge distillation framework for SAR object detection",
    "authors": "Jialei Ni, Yinghua Wang, Hongwei Liu",
    "publish": "2025 17th International Conference on Signal Processing Systems (ICSPS)",
    "url": "https://doi.org/10.1109/icsps66615.2025.11347811",
    "source": "IEEE",
    "abstract": "Transformer-based object detectors have demonstrated substantial potential across a wide range of computer vision tasks, including object detection in Synthetic Aperture Radar (SAR) images. However, these models are often plagued by high computational costs, rendering them impractical for realtime applications. To tackle this issue, knowledge distillation (KD) has been introduced to transfer knowledge from a large teacher model to a smaller student model. In this paper, we propose a novel knowledge distillation framework for RT-DETR, a state-of-the-art object detector, and also tailored for SAR images. Our method involves layer-by-layer distillation between RT-DETR networks of varying parameter sizes and introduces two aspects of improvements: Adaptive Queries Alignment and Teacher Scoring Mechanism. The former is used to guide distillation matching more quickly, while the latter improves distillation performance without introducing additional parameters. We evaluated our approach on the OGSOD-1.0 SAR dataset using RT-DETR with ResNet-18, ResNet-50, and ResNet-101 as the backbones. The corresponding parameter sizes are $20.1 \\mathrm{M}, 42.7 \\mathrm{M}$, and 76.8 M, respectively. The results show that after distilling RT-DETR with ResNet-101 to that with ResNet-18 as the backbone, the student model achieves 1.8 mAP improvement compared to the original student model, with only 26.1% of the teacher model’s parameters. This distillation method reduces computational costs and parameter sizes while enhancing detection performance."
  },
  {
    "date": "2026-1-27",
    "title": "Structurally Consistent Multi-Stage Learning for Abdominal and Cardiac Organ Segmentation",
    "authors": "Shanshan Li",
    "publish": "2025 17th International Conference on Signal Processing Systems (ICSPS)",
    "url": "https://doi.org/10.1109/icsps66615.2025.11347620",
    "source": "IEEE",
    "abstract": "Accurate segmentation in medical images remains a challenging task due to the intricate anatomical structures, ambiguous boundaries, and limited labeled data typically available in clinical scenarios. U-shaped encoder-decoder architectures, such as U-Net and its variants, have become the de facto standard in medical image segmentation owing to their ability to fuse multi-scale features through skip connections. However, conventional training strategies often rely solely on supervision at the final output layer, leaving rich intermediate representations underutilized and lacking explicit consistency constraints across different decoding stages. In this paper, we propose Structurally Consistent Multi-Stage Learning (SCMSL), a simple yet effective training framework designed to improve segmentation quality by enhancing supervision and structural coherence across multiple decoder stages. SCMSL incorporates two key components: (1) multi-stage supervision, which introduces segmentation losses at various decoder stages to guide hierarchical feature refinement throughout the network; and (2) a novel Gram Matrix Loss that measures the similarity between the structural representations of outputs from different stages. By capturing second-order feature correlations, this loss encourages the network to produce consistent and anatomically plausible predictions across scales. Our method is model-agnostic and introduces no additional inference-time complexity, making it easy to plug into existing segmentation architectures. We validate SCMSL on two widely used benchmarks-Synapse multi-organ CT dataset and ACDC cardiac MRI dataset. Experimental results show that SCMSL significantly improves segmentation accuracy and boundary smoothness over strong baselines, confirming the effectiveness and generalizability of our approach."
  },
  {
    "date": "2026-1-27",
    "title": "Traffic-Aware RAW Slot Allocation Scheme for Heterogeneous IoT Networks",
    "authors": "Mahesh Miriyala, V.P. Harigovindan",
    "publish": "2025 International Conference on Communication and Smart Devices (ICCoSD)",
    "url": "https://doi.org/10.1109/iccosd66074.2025.11348294",
    "source": "IEEE",
    "abstract": "IEEE 802.11ah is a promising technology that supports Internet of Things (IoT) applications by offering extended coverage, improved energy efficiency, and enhanced scalability. In this paper, we propose a novel Traffic-Aware Adaptive Restricted Access Window (TARA-RAW) slot allocation scheme tailored for IEEE 802.11ah networks. The proposed method employs fuzzy logic to intelligently classify devices into groups based on dynamic transmission parameters such as data volume, transmission frequency, and latency requirements. Each group is then allocated an adaptable number of RAW slots, which are dynamically adjusted according to real-time traffic patterns and network load. To validate the effectiveness of TARA, we develop both an analytical model and a simulation framework to evaluate key performance metrics including throughput and energy consumption. Results demonstrate that the TARA scheme outperforms traditional uniform grouping approaches, achieving higher throughput and lower energy expenditure, thereby making it highly suitable for large-scale and diverse IoT deployments."
  },
  {
    "date": "2026-1-27",
    "title": "A Scalable Multiple Extended Targets Tracking Based on the Non-Homogeneous Poisson Process and PHD Filter*",
    "authors": "Weilong Qiu, Yuansheng Li, Ling Cui, Yixing Du",
    "publish": "2025 17th International Conference on Signal Processing Systems (ICSPS)",
    "url": "https://doi.org/10.1109/icsps66615.2025.11348024",
    "source": "IEEE",
    "abstract": "This paper proposes a scalable Bayesian framework for tracking multiple extended targets based on a nonhomogeneous Poisson process (NHPP) and the Probability Hypothesis Density (PHD) filter. In the context of extended target tracking, the measurement-to-target association is unknown and evolves over time. To dynamically capture this evolution, an association-based NHPP (AbNHPP) Bayesian tracking framework integrating the target’s association variables and its Poisson measurement rate is derived. To more flexibly model the target’s Poisson measurement rate and ensure the closed-form solution for the PHD filter, this paper adopts the following models: the target’s measurement rate is modeled as a Generalized Inverse Gaussian (GIG) distribution, the target’s kinematic state is modeled as a Gaussian distribution, and the target’s extension is modeled as an inverse-Wishart (IW) distribution. Specifically, the GIG distribution for measurement rate of extended targets is modeled as Time Independent Poisson Rate (TIPR). Simulation results validate the superiority and scalability of the proposed algorithm."
  },
  {
    "date": "2026-1-27",
    "title": "U2Sign: Urdu-Driven Pakistani Sign Language Sequence Production",
    "authors": "Usman, Rohail Zulfiqar, Neelma Naz, Jameel Malik",
    "publish": "2025 27th International Multitopic Conference (INMIC)",
    "url": "https://doi.org/10.1109/inmic65900.2025.11348163",
    "source": "IEEE",
    "abstract": "Sign language production systems are inherently complex and require the integration of linguistic, visual, and computational components, which makes standardization and cross-method comparison challenging. This work presents U2Sign, an open source framework for the automatic production of Pakistani Sign Language (PSL) from inputs of the Urdu natural language, addressing the communication needs of the Pakistani speech-impaired community. The system processes both spoken and written Urdu through a pipeline that includes Automatic Speech Recognition (ASR), followed by Natural Language Processing (NLP) techniques such as normalization, lemmatization, part-of-speech tagging, and rule-based word reordering to generate a sequence of glosses. These glosses are mapped to a custom-built PSL lexi-con, and missing entries are handled through fallback strategies. The gloss-to-pose module utilizes skeletal pose sequences extracted from annotated videos using MediaPipe, with gloss-aligned pose frames stitched together using temporal smoothing to generate coherent PSL animations. The final output is rendered as video through a web-based interface built with React.js and Flask, which supports real-time interaction. U2Sign is reproducible, extensible, and culturally relevant and holds significant promise for applications in education, healthcare, and public accessibility within Pakistan."
  },
  {
    "date": "2026-1-27",
    "title": "DNSODN: A Detail-Enhanced and Normalized Distance-IoU Aware Network for Small Object Detection",
    "authors": "Kehong Li, Yifan Wang, Xuefeng Chen, Liang Feng",
    "publish": "2025 International Conference on Machine Intelligence and Nature-Inspired Computing (MIND)",
    "url": "https://doi.org/10.1109/mind67540.2025.11351675",
    "source": "IEEE",
    "abstract": "Small object detection remains a critical challenge in computer vision due to limited semantic information, indistinct visual features, and susceptibility to environmental interference, particularly in construction-site scenarios. Existing models often overlook shallow features and effective label assignment, limiting detection accuracy. To address these limitations, a framework named Detail-enhanced and NWD-IoU-driven Small Object Detection Network (DNSODN) is proposed. The framework integrates a Detail-enhanced Feature Pyramid Network (DEFPN), which refines shallow feature representation through attention-based enhancement, and a Normalized Weighted Distance Intersection over Union (NWD-IoU) metric, which supports robust and discriminative label assignment. Experiments on the SODA and SODA-D datasets indicate that DNSODN consistently improves detection performance across different object scales, highlighting its effectiveness in small object detection under challenging environments."
  },
  {
    "date": "2026-1-27",
    "title": "Adaptive Gamma Correction with Explicitly Nonlinear Balancing",
    "authors": "Fengzhen Gao, Zhicheng Lin, Xinchuan Qiu, Wenqi Deng, Bin Huang",
    "publish": "2025 17th International Conference on Signal Processing Systems (ICSPS)",
    "url": "https://doi.org/10.1109/icsps66615.2025.11347886",
    "source": "IEEE",
    "abstract": "This paper introduces an adaptive non-linear weighted Gamma correction method designed for explicit controllability and adjustable image enhancement according to quality demands. While existing non-learning approaches offer efficiency, they lack flexibility. Conversely, deep learning methods, despite their adaptivity, suffer from ambiguous control and high model complexity. To address these limitations, our proposed method combines global Gamma correction with the Cumulative Distribution Function (CDF) of the grayscale histogram, dynamically balancing global and local image information. The non-linear weighting scheme effectively enhances dark details while suppressing overexposure, mitigating common artifacts such as over-enhancement. Its explicit formulation facilitates integration into Image Signal Processor (ISP) systems and offers differentiability, enabling parameter optimization through various search strategies for diverse image processing tasks. Experimental results demonstrate the method’s capability for high-quality enhancement across a range of visual quality requirements."
  }
]