[
  {
    "date": "2026-2-27",
    "title": "Prediction of the Breast Cancer in Histopathology Images using JAYA-Optimized Deep Network",
    "authors": "K V L Bhavya, Figlu Mohanty, K Pranathi, Ch. Harika, Suvendu Rup",
    "publish": "2025 13th International Conference on Intelligent Systems and Embedded Design (ISED)",
    "url": "https://doi.org/10.1109/ised67359.2025.11404922",
    "source": "IEEE",
    "abstract": "Breast cancer is still a dominant cause of cancer death in the world, thus emphasizing the need for effective and reliable diagnostic tools. Histopathological image diagnosis of breast cancer is a critical diagnostic method; however, conventional manual diagnosis is usually followed by excessive time consumption and inherent subjectivity. This paper presents an automated classification system using deep learning methods for feature extraction and machine learning classifiers to enhance diagnostic accuracy. A modified Convolutional Neural Network (CNN) and VGG16 are utilized as feature extraction tools, while Random Forest (RF), k-Nearest Neighbors (KNN), and Extreme Gradient Boosting (XGB) are utilized as classification tools. Principal Component Analysis (PCA) is utilized for dimension reduction, while JAYA optimization is utilized to aid feature extraction and hyperparameter tuning. Empirical results on the BreaKHis dataset show that CNN-based models perform better than VGG16-based models, with the CNN+XGB configuration recording the best accuracy of 87.18% after JAYA optimization. These results underscore the importance of feature extraction methods, classification methods, and optimization methods in enhancing the classification of breast cancer. The current study presents an end-to-end framework to assist pathologists in the accurate and timely identification of cancer, eventually leading to better clinical outcomes."
  },
  {
    "date": "2026-2-27",
    "title": "Warm-stamping mechanical behavior and microstructural characterization of Al-Si metal sheets using water refrigerated tooling",
    "authors": "Estrada-Warn P, Garcia-Santibañez GJ, Jauregui-Pablos M, Vazquez-Gomez-Orduña S, Gonzalez-Ojeda R",
    "publish": "2026 IEEE/SICE International Symposium on System Integration (SII)",
    "url": "https://doi.org/10.1109/sii64115.2026.11404536",
    "source": "IEEE",
    "abstract": "The use of water refrigerated tooling in a laboratory scale was used to simulate conditions of warm (500°C) stamping of aluminum plates with 0.8 mm in thickness. The work presents load-displacement curves of room temperature and heat treated samples during stamping at 120 and 240 mm/min, effect of the treatment in the anisotropic characteristics of the rolled sheet plate and electron microscopy analysis along with element detection, as this alloy contains small amounts of silicon. The processes resembles a solution treatment and, thus, also an aging treatment at 120°C for 12 h was carried out in order to understand the application possibilities of the manufacturing process in the automotive or aero-space industry."
  },
  {
    "date": "2026-2-27",
    "title": "Fake News in the Digital Age: The Role of Social Media and its Consequences",
    "authors": "Divyshikha, Rajender Singh Thakur, Pushpendra Sachan, Priyanka Singh, Adarsh Kumar Singh, Jayant Rathee",
    "publish": "2025 IEEE DELCON - International Conference on Recent Smart Technologies in Engineering for Sustainable Development",
    "url": "https://doi.org/10.1109/delcon68055.2025.11400266",
    "source": "IEEE",
    "abstract": "In the current digitized world, digital media forms like blogs, online news media, social media, etc., have replaced conventional news transmission platforms like newspapers and magazines. This research aims to examine the format, structure, and themes of fake news on social media. This research paper employed a qualitative content analysis methodology. The study collected & analyzed data from fifty viral stories about fake news. The dataset only extends from January 2025 to June 2025. The goal of this study is to help individuals better understand fake news ecosystems by showing how stories are made and shared on social media. It also shows how important it is to teach people how to use technology responsibly, critically, and proactively in order to lessen the effects of fake information that is spreading in the public domain."
  },
  {
    "date": "2026-2-27",
    "title": "Depthwise Separable Convolution architectures for 3D Object Recognition *",
    "authors": "Lalitha Swamy Thayumanavar, Sukumar Nandi, Bunil Kumar Balabantaray",
    "publish": "2025 13th International Conference on Intelligent Systems and Embedded Design (ISED)",
    "url": "https://doi.org/10.1109/ised67359.2025.11405352",
    "source": "IEEE",
    "abstract": "Fast and efficient recognition of 3D objects remains vital in computer vision. View-based recognition has gained increasing attention because it mimics human perception by recognizing objects from multiple viewpoints. Convolutional neural network-based architectures have achieved remarkable success in this field; however, they often require extensive computational resources for training and inference, which poses a significant challenge. To develop lightweight architectures, replacing standard convolutions with depthwise separable and pointwise convolutions has been widely adopted in image processing and related domains. This work analyzes the performance of depthwise separable convolution-based architectures for object classification. The experiments were conducted using MobileNetV1 and Xception, two prominent depthwise separable convolution architectures. Their performance is compared with VGG19, a standard convolution-based architecture, on the benchmark datasets ModelNet10 and ModelNet40.The results demonstrate that depthwise separable convolution-based models outperform the VGG19 architecture on both datasets."
  },
  {
    "date": "2026-2-27",
    "title": "LightDiff-Shadow: A Lightweight Global Guided Diffusion Model for Real-Time Shadow Removal",
    "authors": "Stutee Mohanty, Rajiv Senapati",
    "publish": "2025 13th International Conference on Intelligent Systems and Embedded Design (ISED)",
    "url": "https://doi.org/10.1109/ised67359.2025.11405145",
    "source": "IEEE",
    "abstract": "Computer vision works to interpret the content of images and videos. Shadows often cause problems because they can obscure important details and confuse object recognition and understanding of a scene. Existing shadow removal methods are generally complex, require a lot of resources, and struggle to adapt easily to real-time use or smaller devices. This paper introduces LightDiff-Shadow, a simple diffusion model for removing shadows from images in real-time. The method uses a two-part design that combines local denoising with understanding the overall scene. It uses a Reweighted Cross Attention and a Global Guided Sampling strategy to be more efficient and accurate. The model is trained from scratch using three standard datasets ISTD, ISTD+, and SRD. Experimental results show that our method achieves better performance in both qualitative and quantitative metrics outperforming recent state-of-the-art models such as ShadowFormer, Diff-Shadow, and Mask-ShadowGAN. The approach keeps textures sharp, illumination consistent, and overall visual quality good while using much less computing power. The findings suggest that simple setups can remove shadows well on devices with limited resources. This improves the accuracy with which a system interprets scenes and observes outdoor areas. It is highly beneficial for devices that need to process information instantly. The model produces output that demonstrate good visual quality, shows no artificial shadows, and preserves detail clarity under natural lighting conditions. This shows that it works in the real world."
  },
  {
    "date": "2026-2-27",
    "title": "Application of ChatGPT in Today’s Medical System",
    "authors": "Madhu Lata Nirmal, Gaurav Kumar, Sambit Satpathy",
    "publish": "2025 13th International Conference on Intelligent Systems and Embedded Design (ISED)",
    "url": "https://doi.org/10.1109/ised67359.2025.11404901",
    "source": "IEEE",
    "abstract": "ChatGPT is an innovative language model offered by OpenAI, which transforms various spheres, and the healthcare area is among the ones that are impacted the most. Its application in medical systems is totally transforming everything by enhancing medical education and training, simplifying the process of diagnosis, accelerating the process of clinical documentation and increasing patient involvement. The model may prove useful to the patients and doctors since it can react in a manner similar to how people react. The ChatGPT helps to receive information much faster, accelerate the work process, and minimize the number of tasks that an administrator has to perform in clinical conditions. It provides medical professionals and students who learn via simulations, content development, and other one-onone tutoring. It also assists in making diagnostic decisions by examining large amounts of clinical data in providing insights and proposing potential diagnosis. Although it does not go without its advantages, the use of ChatGPT in the healthcare sector is concerning in terms of data security, misinformation, discrimination, and responsibility. Very important are to reduce such risks through ethical use and control. This paper examines six primary uses of ChatGPT within the context of healthcare, its advantages and disadvantages, and ethical considerations. The complete overview is provided with the purpose of promotion of correct usage of this AI tool and ensuring that it becomes an efficient and reliable tool of creation of modern healthcare systems."
  },
  {
    "date": "2026-2-27",
    "title": "Computer Technology-Driven Dynamic Parameters Identification for Symmetrical Dual-Branched 4PPa-2PaR Parallel Manipulator Using Genetic Algorithm and Log-Cholesky Parameterization",
    "authors": "Weilong Yang, Silu Chen, Chi Zhang, Guilin Yang",
    "publish": "2025 5th International Conference on Mechanical Automation and Electronic Information Engineering (MAEIE)",
    "url": "https://doi.org/10.1109/maeie68099.2025.11406003",
    "source": "IEEE",
    "abstract": "Accurate dynamic modeling is crucial for achieving high-performance control in parallel manipulator (PM). However, conventional identification methods often struggle to ensure physical consistency due to the intrinsic structural complexity of these mechanisms. In this paper, we propose a computer-aided identification framework that integrates advanced computational techniques to enhance the accuracy and reliability of dynamic parameter estimation. Specifically, excitation trajectories are optimized using a Genetic Algorithm, with explicit consideration of joint constraints to guarantee persistent excitation. To enforce physical consistency among the identified parameters, a log-Cholesky parameterization is employed, transforming the inertia matrix into an unconstrained optimization space. The entire identification pipeline, from trajectory generation to parameter regression, is algorithmically automated, ensuring both reproducibility and computational efficiency. Experimental validation on a 4PPa-2PaR PM confirms that the proposed approach can accurately estimate dynamic parameters while preserving their physical consistency."
  },
  {
    "date": "2026-2-27",
    "title": "Offloading Reservoir Computing-Based Hand-Waving Action Recognition to FPGAs for Service Robots",
    "authors": "Sojiro Shimada, Akinobu Mizutani, Kanta Yoshioka, Kosei Isomoto, Hakaru Tamukoh",
    "publish": "2026 IEEE/SICE International Symposium on System Integration (SII)",
    "url": "https://doi.org/10.1109/sii64115.2026.11404483",
    "source": "IEEE",
    "abstract": "We propose a system that offloads hand-waving action recognition processing in service robots to a field-programmable gate array (FPGA) accelerator. The accelerator implements a LUTNet-based reservoir computing (LUTNet-RC) model. Conventionally, such processing was performed by laptops connected to robots. Nevertheless, the proposed system offloads some of these task processing to an FPGA. This improves the overall efficiency of the robot and optimizes the use of computational resources. The experimental results show that in hand-waving action recognition, the LUTNet-RC on FPGA achieves higher accuracy and precision than the conventional echo state network (ESN) model, while significantly reducing the power consumption. In addition, the system can be expanded to large-scale networks, which are challenging to implement on laptops."
  },
  {
    "date": "2026-2-27",
    "title": "The Role of Real-World Data in Evaluating Causal Bayesian Networks: Data Collection Guidelines and Case Study",
    "authors": "Zhitao Liang, Maximilian Diehl, Nanami Hashimoto, Anne Koepken, Daniel Leidner, Karinne Ramirez-Amaro, Emmanuel Dean",
    "publish": "2026 IEEE/SICE International Symposium on System Integration (SII)",
    "url": "https://doi.org/10.1109/sii64115.2026.11404539",
    "source": "IEEE",
    "abstract": "Causal Bayesian Networks (CBNs) in robotics are often learned in simulation due to the considerable amount of data required for training. However, discrepancies between simulation and the physical world can cause the learned causal relations to fail in real-world scenarios. Thus, the sim-to-real evaluation is a critical step to deploy a simulation-learned CBN in the real-world. The main challenges in this process are the lack of real-robot evaluation datasets that capture the complexity, noise, and variability of physical environments, which are missing in simulation. In this paper, we propose a set of task-agnostic guidelines for real-robot data collection to evaluate Causal Bayesian Networks (CBNs). The guidelines are generalizable and can be applied to collect real-robot datasets across different robot tasks and platforms. To demonstrate this, we apply them to a robotic platform performing one concrete task, e.g., the robot TIAGo performing a two-cube stacking task, and we collect the real-robot dataset from 100 trials. As a case study, we demonstrate how the dataset can be used to evaluate a simulation-trained CBN on real-robot executions, reporting 10% accuracy drop from sim-to-real transfer. We present this as a first step towards standardized and quantifiable sim-to-real evaluation for CBNs."
  },
  {
    "date": "2026-2-27",
    "title": "GeetaVani: A Retrieval-Augmented LLM Framework for Contextual Dialogue from the Bhagavad Geeta",
    "authors": "Nutakki Namratha, Sai Sarat Spuran Naidu, Kshira Sagar Sahoo, Manthan Singla, Bhavana V S S S R Praneeth",
    "publish": "2025 13th International Conference on Intelligent Systems and Embedded Design (ISED)",
    "url": "https://doi.org/10.1109/ised67359.2025.11404995",
    "source": "IEEE",
    "abstract": "The Bhagavad Geeta, a sacred and treasured scripture in Hindu philosophy This work presents a novel Generative AI and LLM-based chatbot called GeetaVani, inspired by the teachings of the Bhagavad Geeta. It is designed to deliver contextually rich, spiritually grounded responses to user queries. By using Retrieval-Augmented Generation (RAG) framework, the system seamlessly provide precise and meaningful answers based on Geeta. The system employs Sentence-BERT to convert both Geeta verses and user queries into dense vector embeddings. These embeddings are indexed using FAISS. It enables fast and accurate retrieval of the most semantically relevant verses. The retrieved verses are then passed as contextual input to the Groq LLM API, which uses LLaMA 3 to yield response.Designed prompt ensures that the output remains faithful to the original teachings. The chatbot achieves 100% precision for the top$(k)$-6 results, with a Mean Average Precision of 0.89 and a gradual precision decline for broader queries beyond k is 6."
  },
  {
    "date": "2026-2-27",
    "title": "A Web-Based Multi-Robot Teleoperation Platform: Architecture, Implementation, and User Evaluation",
    "authors": "E. Rafael Hernandez-Rios, Christian Penaloza",
    "publish": "2026 IEEE/SICE International Symposium on System Integration (SII)",
    "url": "https://doi.org/10.1109/sii64115.2026.11404473",
    "source": "IEEE",
    "abstract": "This paper presents the design and evaluation of a web-based multi-robot teleoperation platform that enables remote access to heterogeneous robots for education and research. In contrast to most existing remote laboratories, which are limited to single-robot control or simulation environments, the proposed system integrates real-time video streaming, bidirectional control, and user management within a modular client–server web architecture.The platform was deployed with three distinct robotic systems—an industrial manipulator, a humanoid, and a quadruped—each hosted on independent servers with public IP access. A cross-border user study with Technological University Dublin was conducted, where participants performed guided teleoperation tasks and completed structured surveys. The results demonstrated high usability, low-latency performance, and positive educational impact across diverse robot morphologies.These findings suggest that the proposed platform provides a scalable and accessible solution for remote robotics education and international collaboration, bridging the gap between simulation-based training and real-world robot interaction."
  },
  {
    "date": "2026-2-27",
    "title": "Lightweight Mask-Aware User Authentication Framework Using MobileFaceNet for Medical IoT Network",
    "authors": "Praveen R, Balaji S",
    "publish": "2025 Fourth International Conference on Smart Technologies and Systems for Next Generation Computing (ICSTSN)",
    "url": "https://doi.org/10.1109/icstsn67075.2025.11397874",
    "source": "IEEE",
    "abstract": "The adoption of the Internet of Medical Things (IoMT) has transformed healthcare on continuous patient monitoring, remote diagnostics, and real-time medical analytics. The expanded seamless integration of medical devices has increased concerns with data privacy, user authentication, and computational limitations in resource-limited environments. The regular use of facial masks in medical environment affects the accuracy of traditional facial recognition systems due to partial facial occlusion. This paper propose a Lightweight Mask-Aware User Authentication Framework for IoMT edge medical devices to address the challenge. The proposed architecture enhances feature discrimination in face occluded situations while reducing computational expenses by integrating a Mask-Aware MobileFaceNet (MaskAwareMFN) model with Mask-Aware Feature Extraction (MAFE) and a Lightweight Attention Mechanism (LAM). The proposed model enhanced average accuracy from 95.1% to 98.0% and improved masked-face recognition accuracy from 93.0% to 96.1%, utilizing the Real-World Masked Face Dataset (RMFD). Performance evaluations of inference duration, model dimensions, and hardware utilization illustrate the proposed model's real-time capabilities and suitability for embedded medical devices. Consequently, the proposed framework provides a secure, efficient, and privacy-preserving user authentication solution for next-generation IoMT ecosystems."
  },
  {
    "date": "2026-2-27",
    "title": "Iterative development of a mechanical gripping system for civil counter-UAS applications",
    "authors": "Dmytro Zhukov",
    "publish": "2026 IEEE/SICE International Symposium on System Integration (SII)",
    "url": "https://doi.org/10.1109/sii64115.2026.11404460",
    "source": "IEEE",
    "abstract": "In recent years, drones have become widely used. Consequently, their potential to cause harm or damage to people, property, or infrastructure has also increased. As drones have become more prevalent, so has the need to counter them and prevent potential misuse. Unlike net or projectile-based systems, a gripper enables precise midair capture and secure handling of the intruder drone without causing uncontrolled descent or collateral damage. This paper presents our iterative development process for such a mechanical gripping system for use in civil counter-UAS applications. After a brief overview of existing gripping systems, we will describe the initial development steps and progress to increasingly complex design solutions. During the development process, three prototype designs were built and evaluated, one after another. Finally, we present our final design, which satisfies all requirements for integration into the UAS and can be used to catch the intruders in mid-flight."
  },
  {
    "date": "2026-2-27",
    "title": "Co-Optimization of Design and Manufacturing Parameters for Low-Cost Robotic Actuation",
    "authors": "Gregory M. Campbell, Yi Cao, Hannah Escritor, Zihao Zhou, Mark Yim",
    "publish": "2026 IEEE/SICE International Symposium on System Integration (SII)",
    "url": "https://doi.org/10.1109/sii64115.2026.11404555",
    "source": "IEEE",
    "abstract": "Additive and low-cost manufacturing techniques promise increased access to robotic actuation at the cost of mechanical precision. In this work, we employ principled Design of Experiments (DoE), including Taguchi orthogonal arrays, in parallel to sequential experimentation enabled by Bayesian Optimization (BO) for co-optimization of design and manufacturing parameters across two design case studies. We optimize for a combination of gear ratio and backdrivability in a 3D-printed compound Wolfrom bilateral gearbox. We also optimize for crack pressure and steady-state pressure differential of an injection-molded silicone check valve. Using BO, we find a 3D-printing compatible gear design with a gear ratio of 63.6 that backdrives without ever needing more than 0.35 Nm of input torque. This represents a 49% increase in ‘score’ over the Taguchi method. Similarly, we find a BO valve with lower combined crack and steady-state pressure errors than the Taguchi trials, decreasing cumulative error by 55%. Tracking model uncertainty throughout training, we conclude that further model training is necessary to reach optimal results in both cases. We further conclude that BO via the Ax platform is not yet as \"plug-and-play\" as Taguchi arrays."
  },
  {
    "date": "2026-2-27",
    "title": "Review on Low Noise Amplifier for High Frequency Applications",
    "authors": "Dheeraj Kalra, Manish Kumar",
    "publish": "2025 IEEE DELCON - International Conference on Recent Smart Technologies in Engineering for Sustainable Development",
    "url": "https://doi.org/10.1109/delcon68055.2025.11399980",
    "source": "IEEE",
    "abstract": "Low Noise Amplifiers (LNAs) has a crucial part in communication systems, significantly influencing the overall performance of wireless transceivers. This paper presents a comprehensive review of various LNA design techniques employed for high-frequency applications, highlighting advancements in circuit topologies, noise reduction strategies, and power efficiency optimizations. Several state-of-the-art LNA architectures have been analyzed, including transformer feedback, cascode, cascade, resistive shunt feedback, noise cancellation, current reuse, subthreshold, and variable gain techniques. The study further explores the impact of CMOS scaling on LNA performance, covering designs from 180 nm down to 40 nm CMOS technology. A comparative analysis of LNAs based on key performance parameters such as noise figure (NF), gain, power dissipation, bandwidth, and figure of merit (FoM) is provided. The review identifies critical design trade-offs in achieving low NF, high gain, and broad bandwidth while maintaining low power consumption. Key challenges in high-frequency LNA design are also discussed, including biasing complexity, NF optimization, and FoM enhancement. Based on the literature survey, existing gaps in high-frequency LNA designs are highlighted, emphasizing the need for improved biasing techniques, enhanced noise performance, and optimized FoM. This review serves as a valuable reference for researchers and engineers working on next-generation LNA architectures for high-speed wireless communication and millimeter-wave applications."
  },
  {
    "date": "2026-2-27",
    "title": "Unified Transmission-Distribution Coordination for Secure and Economical Frequency Support From Distributed Energy Resources",
    "authors": "Rushuai Han, Qinran Hu, Mengtong Chen, Yuanshi Zhang, Tao Qian, Zaijun Wu",
    "publish": "IEEE Transactions on Sustainable Energy",
    "url": "https://doi.org/10.1109/tste.2026.3668374",
    "source": "IEEE",
    "abstract": "Utilizing numerous distributed energy resources (DERs) for frequency regulation is a promising pathway to enhance the security and economy of future power systems. However, a fundamental challenge arises from the emergent collective behavior of these resources: their aggregated response, intended to support macro-level system frequency, can jeopardize micro-level local voltage security within distribution networks. To this end, this paper proposes a unified hierarchical framework based on the principle of synergistic co-design. The framework employs a stage-dependent architecture that systematically integrates distinct control strategies for different regulation stages. For security-critical response, it utilizes a novel stage-aware adaptive virtual synchronous generator (VSG) control method with stability formally proven by Lyapunov analysis, while for economic efficiency, it transitions to a distributed control method for cost-optimal restoration. The entire process is underpinned by a proactive voltage security management strategy that enforces micro-level safety. To enable efficient analysis of these complex dynamics, a dual time-scale information interaction mechanism is designed to accelerate the transmission-distribution (T&D) co-simulation process. Simulations on a hybrid transmission-distribution test system validate the framework's effectiveness, demonstrating that the proposed approach enables scalable, secure, and economical frequency support while effectively managing the emergent voltage challenges from collective DER control."
  },
  {
    "date": "2026-2-27",
    "title": "A Remaining Useful Life Prediction Method for Power Devices Based on Multi-Indicator Fusion and Particle Swarm Optimization",
    "authors": "Yalei Yuan, Fengjiao Dai, Hao Sun, Zhaoyang Wei",
    "publish": "2025 IEEE 3rd International Power Electronics and Application Symposium (PEAS)",
    "url": "https://doi.org/10.1109/peas66638.2025.11403566",
    "source": "IEEE",
    "abstract": "This paper proposes a hybrid life prediction framework (MI-BLSTM-PSO) for power devices to overcome the limitations of single-feature information, non-monotonic degradation modeling, and local optima in traditional methods. Multiple features highly correlated with aging are selected via Pearson correlation coefficient to construct a fused health indicator. A Bidirectional LSTM (BLSTM) captures complex temporal dependencies in degradation data. Crucially, a dynamic Particle Swarm Optimization (PSO) mechanism is triggered upon training stagnation to escape local minima. Experimental results on power cycling data show that our model significantly outperforms unidirectional LSTM and other benchmarks in prediction accuracy (RMSE%) and robustness, demonstrating its strong potential for predictive maintenance."
  },
  {
    "date": "2026-2-27",
    "title": "Road Extraction from Remote Sensing Images Using Efficient Channel Attention and Transformer",
    "authors": "Lele Hou, Yunhong Li, Weizhong Chen, Qianbo Yang",
    "publish": "2025 6th International Symposium on Computer Engineering and Intelligent Communications (ISCEIC)",
    "url": "https://doi.org/10.1109/isceic67854.2025.11405588",
    "source": "IEEE",
    "abstract": "A road extraction model named ETD-LinkNet is proposed to address issues in remote sensing images such as fragile road structures, complex background interference, and insufficient feature discriminability. Based on D-LinkNet, the model incorporates an Efficient Channel Attention (ECA) module in the encoder to enhance road feature representation through channel recalibration, effectively suppressing background noise. A multi-scale dilated convolution pyramid captures features of roads with different widths. Finally, a Transformer module is introduced after Dblock to model global dependencies, maintaining connectivity of slender roads and reducing fractures. Experiments on DeepGlobe and CHN6-CUG datasets demonstrate the model's effectiveness, achieving mIoU values of 83.70% and 80.54% respectively, significantly outperforming comparative models and validating its advantages in segmentation accuracy and generalization."
  },
  {
    "date": "2026-2-27",
    "title": "A Floating Level Converter With A Negative Voltage Tolerance Of -35V",
    "authors": "Tiancheng Lu, Xing Li",
    "publish": "2025 IEEE 3rd International Power Electronics and Application Symposium (PEAS)",
    "url": "https://doi.org/10.1109/peas66638.2025.11403383",
    "source": "IEEE",
    "abstract": "This brief introduces a novel level shifter for gate drive applications. This level shifter can extend the floating voltage domain to the negative voltage range without requiring coupling capacitors. With the development of AMOLED technology, the corresponding power supply circuits have also received extensive attention. For novel hybrid SIBO circuits, level shifters capable of operating in both positive and negative voltage ranges are required. Traditional active level shifters have limitations in negative voltage tolerance and fail to meet application requirements. To address this issue, this paper proposes a level shifter applicable to single-inductor bipolar output (SIBO) systems. This converter can be applied to a voltage range of ±37.5V, and its basic architecture can achieve a high common-mode transient immunity (CMTI) of 50V/ns with a delay of 1.18ns."
  },
  {
    "date": "2026-2-27",
    "title": "Estimating Wrist Joint Angle using Electromyography and Cepstral Coefficients",
    "authors": "Sougo Horimatsu, Kensuke Takenaka, Takayuki Mukaeda, Keisuke Shima",
    "publish": "2026 IEEE/SICE International Symposium on System Integration (SII)",
    "url": "https://doi.org/10.1109/sii64115.2026.11404648",
    "source": "IEEE",
    "abstract": "A method was developed for increasing the accuracy of the continuous wrist joint angle estimations for myoelectric prosthetic hands. The method considers cepstral coefficients, which efficiently represent the frequency spectrum characteristics of electromyography (EMG) signals as features. The root mean square myoelectric power (RMS) is conventionally used for myoelectric prosthetic control; however, the sensitivity of the RMS to angle changes is low, especially at the fine muscle contraction level. The proposed method incorporates low-order cepstral coefficients into the feature vector as well as the RMS myoelectric power. This approach increases the angle estimation accuracy through capturing the changes in the spectral shape related to the firing patterns of the motor units. The results of an angle estimation experiment involving wrist dorsiflexion and palmar flexion movements showed that adding a few cepstral coefficients substantially increased the estimation accuracy, particularly when estimating the small flexion angle range. The cepstral coefficient can be used to effectively estimate joint angles from EMG signals, contributing to the development of smoother and more intuitive myoelectric prosthetic control."
  },
  {
    "date": "2026-2-27",
    "title": "An Optimal Design Method for High-Frequency Transformers in High-Frequency Link AC-DC Matrix Converters",
    "authors": "Yang Mei, Xiang Liu, Ruijuan Jiang",
    "publish": "2025 IEEE 3rd International Power Electronics and Application Symposium (PEAS)",
    "url": "https://doi.org/10.1109/peas66638.2025.11403105",
    "source": "IEEE",
    "abstract": "To meet the requirements of high efficiency and high power density for high-frequency link AC-DC matrix converters, this paper proposes an optimized design method for high-frequency transformers in such converters. Based on the improved NSGA-Ⅱ algorithm, the method aims to reduce high-frequency transformers losses and minimize volume, comprehensively considering factors such as leakage inductance, temperature rise, magnetic flux density, and spatial constraints. The optimized transformer parameters are calculated, and the high-frequency transformers is designed accordingly. Simulation and experimental results show that the transformer designed by this method achieves an efficiency of over 98.6% under wide-range operation, with the maximum efficiency reaching 99.3% at rated power. The leakage inductance is 49.2 μH, and the volume is 220 cm<sup xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">3</sup>. These results validate the correctness and effectiveness of the proposed design method."
  },
  {
    "date": "2026-2-27",
    "title": "Automatic Diabetic Retinopathy Identification and Grading in Retinal Fundus Pictures",
    "authors": "R. Shamli, P. Vasuki",
    "publish": "2025 IEEE DELCON - International Conference on Recent Smart Technologies in Engineering for Sustainable Development",
    "url": "https://doi.org/10.1109/delcon68055.2025.11400298",
    "source": "IEEE",
    "abstract": "Given that diabetic retinopathy (DR) remains a primary cause of vision impairment worldwide, there is a pressing need for automated and precise diagnostic systems. To automatically detect and grade DR, this study presents MWRes-Ensemble (Mobile WideRes Forward Harmonic Ensemble), a novel deep learning framework. The suggested hybrid architecture outperforms previous single-CNN techniques in lesion detection by combining the EfficientNet, ResNet, and DenseNet models, particularly in low-quality retinal images. During preprocessing, extensive data augmentation techniques and Contrast Limited Adaptive Histogram Equalization (CLAHE) were used to reduce class imbalance. The robustness of the proposed approach is demonstrated by experimental evaluation using the Kaggle DR and EyePACS datasets, which yielded an accuracy of 92.50%, a sensitivity of 90.80%, a specificity of 94.20%, and an AUC of 0.96. The severe DR cases showed an F1 score of 0.89, indicating significant progress in identifying moderate and severe DR stages. According to the results, the MWRes-Ensemble model may be a dependable automated tool for effective and timely DR screening in clinical settings."
  },
  {
    "date": "2026-2-27",
    "title": "EcoGrow: IoT-Based Smart Plant Monitoring System",
    "authors": "Bhavvya Mehta, Cheshta Khurana, Vasudev Grover, Khushboo Verma",
    "publish": "2025 IEEE DELCON - International Conference on Recent Smart Technologies in Engineering for Sustainable Development",
    "url": "https://doi.org/10.1109/delcon68055.2025.11399858",
    "source": "IEEE",
    "abstract": "Traditional plant monitoring systems are time-consuming and error-prone, causing wastage of resources and loss of plant health. EcoGrow is a smart Internet of Things plant monitoring system that solves the problem using a series of sensors, actuators, microcontrollers. It constantly monitors environment parameters like soil moisture, temperature, light intensity. As a result of low moisture, the system automatically changes to drip irrigation. A plastic sheet is rolled over the plant under direct sunlight to shade the plant. A PIR (Passive Infrared) motion sensor is also incorporated to detect the intrusion of pests or intrusions. Whenever it detects motion, an audible warning is produced to alert in time in order to save the plant. This system not only maximizes the use of resources and minimizes labor but also provides early detection of plant disease and pest infestation. With upcoming technologies like Artificial Intelligence (AI), Machine Learning (ML), the Internet of Things (IoT) as its power, EcoGrow maximizes predictive analysis, reduces wastage, facilitates energy-efficient, sustainable agriculture for home gardens and commercial agriculture."
  },
  {
    "date": "2026-2-27",
    "title": "Robotic System Architecture Design for Manipulation of 3D Deformable Objects",
    "authors": "Félix Nadon, Angel J. Valencia, Pierre Payeur",
    "publish": "2026 IEEE/SICE International Symposium on System Integration (SII)",
    "url": "https://doi.org/10.1109/sii64115.2026.11404564",
    "source": "IEEE",
    "abstract": "This paper presents a system architecture for the robotic manipulation and reshaping of 3D deformable objects. The inherent complexity of manipulating objects with evolving shapes requires the construction and efficient integration of components that are reusable and remain functional under operational scenarios that involve high variability. Such original components are developed and integrated in this paper, notably including a mapping subsystem to aggregate and analyse sensor data for extracting general manipulation and sensing heuristics, as well as a deformation modelling component to predict the effect of candidate robot actions on the shape of an object of interest. A simulation interface is further implemented on top of robotic simulators, allowing a modular creation of environments to evaluate the performance of the aforementioned components and to generate synthetic datasets of 3D deformable object manipulation tasks. These general-use components are integrated with application-specific task and motion planning components in real and simulated environments."
  },
  {
    "date": "2026-2-27",
    "title": "AIREC-Basic: Consistent Demonstration Data Collection for Imitation Learning with Redundant Robot Arms",
    "authors": "Hiroshi Ito, Yoshiki Kanai, Akira Kanazawa, Hideyuki Ichiwara, Takahiro Yoshida, Naoaki Noguchi, Tetsuya Ogata",
    "publish": "2026 IEEE/SICE International Symposium on System Integration (SII)",
    "url": "https://doi.org/10.1109/sii64115.2026.11404500",
    "source": "IEEE",
    "abstract": "The performance of robotic imitation learning (IL) largely depends on the quality of human demonstrations. To address this challenge, we present AIREC-Basic, a leader–follower teleoperation system equipped with a dual-arm mobile manipulator that enables efficient data collection. The system employs 8-DoF redundant arms to realize diverse task postures, but such redundancy can reduce the consistency of demonstrations. To overcome this issue, we propose a novel control strategy, Soft Homing Control (SHC), which mitigates redundancy while preserving intuitive operator control, thereby improving dataset consistency. We validate our approach on three household tasks using state-of-the-art IL algorithms (ACT, Diffusion Policy, and HSARNN). Experimental results show that SHC significantly reduces joint trajectory variance and improves task success rates, particularly in scenarios with strong trajectory constraints and frequent contacts."
  },
  {
    "date": "2026-2-27",
    "title": "A self-supervised learning-based 3D model completion method for automatic reconstruction systems",
    "authors": "Jing Li, Yanshen Wang, Meng Du, Yanzi Kong",
    "publish": "2025 2nd International Conference on Advanced Control Systems and Automation Technology (ACSAT)",
    "url": "https://doi.org/10.1109/acsat68407.2025.11407337",
    "source": "IEEE",
    "abstract": "Practical limitations, such as constrained sensor trajectories and inevitable occlusions, often lead to incomplete and partial observations, resulting in deficient 3D models. This situation is particularly prominent when dealing with multi-scale complex objects. To address the problem of completing the full shape of an object based on its incomplete model, we proposed a novel self-supervised learning method. We employed three pseudo-label generation strategies to randomly produce training labels. A weighted function is utilized as the loss criterion. We conducted experiments on multi-scale objects. The results demonstrate that our approach significantly outperforms traditional completion methods, effectively generates complete 3D models under severe occlusion."
  },
  {
    "date": "2026-2-27",
    "title": "Virtual Domain-Guided Cross-Modal Distillation With Multiview Correlation Awareness for Domain-Specific Multimodal Neural Machine Translation_supp1-3656559.pdf",
    "authors": "Junjun Guo",
    "publish": "N/A",
    "url": "https://doi.org/10.1109/tnnls.2026.3656559/mm1",
    "source": "IEEE",
    "abstract": "Domain-specific multimodal neural machine translation (DMNMT) aims to translate source language domain sentences into target language by incorporating images as additional contextual information. However, domain-specific multimodal scenarios frequently suffer from visual imbalance issues, such as one sentence corresponding to multiple images or even no images at all. Effectively integrating visual information into text to enhance domain sentence translation performance under visual imbalance issues is one of the critical challenges for DMNMT, especially for domain-related terms. To tackle these domain-specific visual imbalance problems, this article introduces a virtual domain distillation-enhanced multimodal fusion with the awareness of multiview correlations to enhance the robustness and performance of domain machine translation across various multimodal domain scenarios. We first adopt a multiview correlation-aware cross-modal distillation strategy to generate virtual domain visual scenes by extracting visual correlations among all images through multikernel representations. Subsequently, we integrate pseudo-domain visual scenes into text to improve the performance of domain-specific machine translation. Our proposed approach has the ability to capture domain visual representations across different scenarios, and contributing to more effective domain-specific translation. We conduct expensive experiments on three domain-specific and general-domain benchmark datasets. Experimental results demonstrate that our proposed approach achieves state-of-the-art (SOTA) machine translation scores on most test sets. The in-depth analysis demonstrates the effectiveness and robustness of our proposed approach for domain machine translation."
  },
  {
    "date": "2026-2-27",
    "title": "Next Generation of Brain-Computer Interfaces: A Proposal for Spikes Detection Based on CDMA and Power Domain Nonorthogonal Multiple Access Techniques",
    "authors": "Jesus Minguillon, Miguel Angel Lopez-Gordo, Pablo Martinez-Cañada",
    "publish": "IEEE Transactions on Human-Machine Systems",
    "url": "https://doi.org/10.1109/thms.2026.3663792",
    "source": "IEEE",
    "abstract": "The first generation of invasive brain-computer interfaces was conceived as a centralized and monolithic technology composed of an array of microelectrodes implanted on the brain surface and wired to an external unit for telemetry and power supply. Although this technology exceeded the expectations and possibilities of the noninvasive one, risks associated with implantation of wired devices and procedures appeared. Advances in electronics miniaturization and wireless power transfer methods, among others, have favored the proposal of wireless submillimeter implantable devices with stimulation and telemetry capabilities. This constitutes the foundation stone of a next generation of submilliliter implanted neurosensors (NG-SINs) based on massive distributed networks of untethered neuroimplants deployed on the brain. This particular ecosystem, because of the inherent severe restrictions in size, power consumption, electromagnetic safety, and computational capacity, presents significant challenges in the field of communications and internetworking, such as media access control, addressing, data error rate, and others. In this study, we propose a combination of orthogonal multiple access (OMA) and nonorthogonal media access (NOMA) as the base for the telemetry of the NG-SINs, with a focus on the detection of neural spikes in real time. Specifically, we propose the use of asynchronous code division multiple access (aCDMA) and power domain non orthogonal media access (PD-NOMA) with successive interference cancelation (SIC) over backscattered communications. While aCDMA mimics the spontaneous nature of brain activity, and provides addressing and grant-free random-access mechanism, its inherent near-far issue can be conveniently used to improve the performance by means of PD-NOMA and SIC. Based on our simulations, we conclude that this combination of NOMA and OMA techniques is a viable and promising approach for the NG-SINs applied to neural spikes detection that enables scalability with improved performance."
  },
  {
    "date": "2026-2-27",
    "title": "PropMambaSR: Lightweight Image Super-Resolution with Propagation State Space Model",
    "authors": "Wushuai Jin, Jie Li, Xinbo Gao",
    "publish": "IEEE Transactions on Multimedia",
    "url": "https://doi.org/10.1109/tmm.2026.3668650",
    "source": "IEEE",
    "abstract": "State Space Models (SSMs), particularly Mamba, have emerged as promising alternatives to Transformers for lightweight Single Image Super-Resolution (SISR) due to their linear complexity in modeling long-range dependencies. Advanced Mamba-based Super-Resolution models, such as MambaIR and VMambaIR, have demonstrated compelling performance by integrating bidirectional and multi-directional scanning mechanisms. However, these methods are still constrained by several critical challenges that limit their ultimate reconstruction capabilities. Firstly, the inherent requirement for 2D-to-1D serialization disrupts local spatial coherence, which is vital for preserving fine-grained texture details during reconstruction. Second, stacking multiple SSM blocks in deep networks leads to progressive decay of fine-grained information, as hidden states are typically confined within individual layers without cross-layer propagation. To address these challenges, we propose PropMambaSR, a novel hybrid architecture that synergistically combines global context modeling with local feature extraction. Our core contribution is the Propagation State Space Model (PropSSM), which establishes explicit cross-layer hidden state routing to enable direct propagation of fine-grained information from shallow to deep layers, effectively mitigating information decay while preserving reconstruction details. Additionally, we introduce an Enhanced Spatial Feature Block (ESFB) that employs multi-scale residual distillation to explicitly capture local texture information compromised by the serialization process. Finally, a dynamic Fusion Model (FM) adaptively integrates global contextual features from PropSSM with local spatial features from ESFB through learnable gating mechanisms. Extensive experiments demonstrate that PropMambaSR achieves state-of-the-art performance across multiple benchmarks while maintaining computational efficiency. Notably, on the Urban100 dataset for <inline-formula xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\"><tex-math notation=\"LaTeX\">$\\times 2$</tex-math></inline-formula> SR, our model surpasses the next-best method by 0.33 dB in PSNR, demonstrating superior capability in reconstructing high-frequency textures and regular structural patterns."
  },
  {
    "date": "2026-2-27",
    "title": "PO-GUISE+: Pose and Object Guided Transformer Token Selection for Efficient Driver Action Recognition",
    "authors": "Ricardo Pizarro, Roberto Valle, Rafael Barea, José M. Buenaposada, Luis Baumela, Luis M. Bergasa",
    "publish": "IEEE Transactions on Intelligent Transportation Systems",
    "url": "https://doi.org/10.1109/tits.2026.3665254",
    "source": "IEEE",
    "abstract": "We address the task of identifying distracted driving by analyzing in-car videos using efficient transformers. Although transformer models have achieved outstanding performance in human action recognition tasks, their high computational costs limit their application onboard a vehicle. We introduce PO-GUISE+, a multi-task video transformer that, given an input clip, predicts the distracted driving action, the driver’s pose, and the interacting object. Our enhanced features for token selection are specifically adapted to driver actions by leveraging information about object interaction and the driver’s pose. With PO-GUISE+, we significantly reduce the model’s computational demands while maintaining or improving baseline accuracy across various computational budgets. Additionally, to evaluate our model’s performance in real-world scenarios, we have developed benchmarks on a Jetson computing platform, demonstrating its effectiveness across different configurations and computational budgets. Our model outperforms current state-of-the-art results on the Drive&Act, 100-Driver, and 3MDAD datasets, while having superior efficiency compared to existing video transformer-based methods."
  },
  {
    "date": "2026-2-27",
    "title": "Learning Optimal Robust Control for Nonlinear Mixed Traffic Under External Disturbance",
    "authors": "Jie Li, Jiawei Wang, Yangang Ren, Yujie Yang, Shen Li, Guofa Li, Shengbo Eben Li",
    "publish": "IEEE Transactions on Intelligent Transportation Systems",
    "url": "https://doi.org/10.1109/tits.2026.3666279",
    "source": "IEEE",
    "abstract": "The integration of connected and automated vehicles (CAVs) into traffic systems holds potential to mitigate undesired disturbances. Nevertheless, coexisting human-driven vehicles (HDVs) introduce complex behavioral disturbances, which has imposed critical challenges for control robustness. This study develops a computational framework based on policy iteration to derive robust control policies with optimized attenuation performance for nonlinear mixed traffic flow. Specifically, robust <inline-formula xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\"> <tex-math notation=\"LaTeX\">$H_{\\infty }$</tex-math> </inline-formula> control problem is solved by applying the framework of zero-sum game, whose solution at the Nash equilibrium is transformed into a Hamilton–Jacobi (HJ) inequality with a Hamiltonian constraint. For achieving desired attenuation performance, the value function is updated by gradient descent based on counterexamples violating Hamiltonian and monotonicity constraints, where the positive definiteness of the value function is ensured by convex neural networks, facilitating the analysis of control stability via Lyapunov methods. By utilizing constraint gaps, the attenuation level is optimized through the analytical formulae derived from the HJ inequality. The stability and algorithm convergence are proved. Experimental results demonstrate the capability of the learned controller to effectively attenuate disturbance propagation and stabilize mixed traffic flow."
  },
  {
    "date": "2026-2-27",
    "title": "Modularity Maximization and Community Detection in Complex Networks Through Recursive and Hierarchical Annealing in the DWAVE Advantage Quantum Processing Units",
    "authors": "Joan Falcó-Roget, Kacper Jurek, Barbara Wojtarowicz, Karol Capała, Katarzyna Rycerz",
    "publish": "IEEE Transactions on Network Science and Engineering",
    "url": "https://doi.org/10.1109/tnse.2026.3668505",
    "source": "IEEE",
    "abstract": "Quantum adiabatic optimization has long been expected to outperform classical methods in solving NP -type problems. While this has been proven in certain experiments, its main applications still reside in academic problems where the size of the system to be solved would not represent an obstacle to any modern desktop computer. Here, we develop a systematic procedure to find the global optima of the modularity function to discover community structure in complex networks solely relying on pure annealers rather than hybrid solutions. We bypass the one-hot encoding constraints by hierarchically and recursively encoding binary instances of the problem that can be solved without the need to guess the exact penalties for the Lagrange multipliers. We study the variability and robustness of the annealing process as a function of network size, directness of connections, topology, and the resolution of the communities. We show how our approach produces meaningful and at least equally optimal solutions to state-of-the-art community detection algorithms while maintaining tractable and potentially scalable computing times. Lastly, due to its recursive nature, the annealing process returns intermediate subdivisions, thus offering interpretable rather than black-box solutions. These <italic xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">dendrograms</i> can be used to unveil normal and pathological hidden hierarchies in brain networks, hence opening the door to clinical workflows. Overall, this represents a first step towards an applicable practice-oriented usage of pure quantum annealing, potentially bridging two segregated communities in modern science and engineering: that of network science and quantum computing."
  },
  {
    "date": "2026-2-27",
    "title": "DWSF-Net: A Dynamic Wavelet-based Spatial-frequency Fusion Network for Multispectral Object Detection",
    "authors": "Fan Yang, Wei Li, Lei Li, Min Yang, Jianwei Zhang",
    "publish": "IEEE Transactions on Multimedia",
    "url": "https://doi.org/10.1109/tmm.2026.3668686",
    "source": "IEEE",
    "abstract": "Multispectral object detection aims to identify tar gets under diverse illumination conditions by leveraging complementary information from multiple spectral modalities. A major challenge in this field lies in effectively fusing multispectral features while accounting for both spatial and frequency domain characteristics. Existing methods primarily focus on spatial fusion, often neglecting critical frequency domain cues and treating all spectral channels equally, despite their distinct properties. In particular, RGB images capture high-frequency texture and color, whereas infrared (IR) images focus on low frequency thermal signatures—rendering conventional spatial only fusion suboptimal. To address these challenges, we propose a novel Dynamic Wavelet-based Spatial-Frequency Fusion Net work (DWSF-Net) that integrates both spatial and frequency information for enhanced multispectral representation. DWSF Net introduces a learnable wavelet encoder to adaptively extract frequency-aware features, a wavelet modulation fusion module to selectively combine informative sub-bands across spectra, and a frequency-domain sub-band fusion scheme with adaptive weight learning to refine cross-spectral integration. Finally, modulated spatial features and adaptively fused frequency components are aggregated to form the final representation. Extensive experiments conducted on three public datasets demonstrate that the proposed DWSF-Net achieves state-of-the-art performance, highlighting its effectiveness and potential for improving the accuracy of multispectral object detection."
  },
  {
    "date": "2026-2-27",
    "title": "3D-SceneQ: Empowering 3D LLM with Query-Guided Adaptive Pruning and Multi-modal Feature Enhancement",
    "authors": "Yongqi Shan, Lu Zhang, Jiazuo Yu, Yunzhi Zhuge, Huchuan Lu",
    "publish": "IEEE Transactions on Multimedia",
    "url": "https://doi.org/10.1109/tmm.2026.3668502",
    "source": "IEEE",
    "abstract": "Current 3D scene understanding pipelines typically concatenate vast numbers of 3D object tokens with text tokens and feed the resulting sequence to a Large Language Model (LLM). However, existing 3D-LLMs for scene understanding encounter two major limitations: (i) excessive inclusion of task-irrelevant object data, introducing noise that reduces reasoning accuracy and increases hallucinations; and (ii) reliance solely on point cloud data, which inherently lacks the rich semantic information available in complementary 2D modalities, such as color, material properties, texture, and high-level contextual relationships. To address these challenges, we introduce 3D-SceneQ, a 3D LLM that unifies adaptive token pruning with multimodal semantic enrichment, markedly advancing scene understanding, reasoning, and grounding. Specifically, we propose a Query-Guided Adaptive Pruning (QGAP) module that adaptively selects task-relevant objects based on the intended meaning of user instructions, leveraging a learnable latent query to retain critical information while effectively suppressing irrelevant noise. In addition, we introduce a Multi-modal Object-level Feature Enhancement (MOFE) module, which integrates 2D feature embeddings from pre-trained models into 3D representation to enrich object-level semantic information. Evaluations show that 3D-SceneQ outperforms current state-of-the-art methods across multiple benchmarks (e.g., +5.7 CIDEr on Scan2Cap and +17.0 EM@1 on SQA3D), demonstrating its remarkable capabilities in various 3D language reasoning tasks."
  },
  {
    "date": "2026-2-27",
    "title": "Dual-Layer Bumpless Transfer Control for Markovian Jump Systems and Its Applications: A Weighted Coefficient Mechanism_supp1-3666949.pdf",
    "authors": "Qingchuan Feng",
    "publish": "N/A",
    "url": "https://doi.org/10.1109/tase.2026.3666949/mm1",
    "source": "IEEE",
    "abstract": "This paper addresses a dual-layer bumpless transfer control (DLBTC) problem for Markovian jump systems (MJSs), aiming to achieve smooth transitions during stochastic mode switchings. First, the design of a multi-controller structure necessitates a system mode-dependent Markov chain, which enriches system dynamics and enhances robustness. However, it design inevitably increases stochastic mode switchings and aggravates bump phenomena. Second, to suppress these bumps, a dual-layer bumpless transfer control strategy is developed that constrains both input smoothness and rate continuity. Meanwhile, the traditional reference matrix mechanism is replaced by a weighted coefficient mechanism to improve adaptability across operating scenarios. Then, sufficient conditions on stochastic stabilization and DLBTC performance of MJSs are established via linear matrix inequalities. Finally, the impact of multi-controller structure and the proposed DLBTC on stochastic stabilization and transient behavior is demonstrated through an RLC circuit and a 40K engine control system as case studies."
  },
  {
    "date": "2026-2-27",
    "title": "A Dual-Lunate-Ring Bulk RE-Ba-Cu-O Undulator",
    "authors": "Yimin Tong, Haolin Lu, Dabin Wei, Zhuangwei Chen, Chan Liu, Marco Calvi, Kai Zhang, Haixiao Deng",
    "publish": "IEEE Transactions on Applied Superconductivity",
    "url": "https://doi.org/10.1109/tasc.2026.3666467",
    "source": "IEEE",
    "abstract": "RE-Ba-Cu-O (REBCO) bulk high temperature superconducting undulators have been experimentally demonstrated to generate undulator fields exceeding 2 T at a 10 mm period, outperforming alternative undulator technologies for short-period applications. This study aims to further enhance undulator performance by reducing the period length through optimization of staggered-array, half-moon-shaped REBCO bulks. We propose a novel dual-lunate-ring-based REBCO undulator geometry that enables control of magnetization currents within individual lunate rings. The coexistence of magnetization currents on both the upper and lower sides of the undulator axis contributes to a significant enhancement of the on-axis magnetic field. To evaluate the performance of this design, the undulator period and gap were fixed at 7 mm and 3.3 mm, respectively, while the dimensions of the bulk rings were optimized numerically using the H-formulation. When the background solenoidal field changes from 10T to zero (ΔBs = 10 T), the undulator is expected to achieve a field strength B0 of 1.65T with a 7 mm period, corresponding to a deflection parameter of K = 1.1."
  },
  {
    "date": "2026-2-27",
    "title": "Dynamics of the Electric-Driven Gas Compressor Station Under Electric and Gas Network Disturbances",
    "authors": "Amin Salehi, Mahdi Pourakbari-Kasmaei",
    "publish": "IEEE Transactions on Industrial Informatics",
    "url": "https://doi.org/10.1109/tii.2025.3643185",
    "source": "IEEE",
    "abstract": "This article focuses on the interaction between the electricity and hydrogen networks. Increasing the share of hydrogen production in demand-supply can impact the dynamics of equipment involved in the hydrogen grid, which may affect the security and stability of both power and hydrogen networks. One of these components is the electric-driven compressor station (EDCS). This article, for the first time, evaluates the effects of potential disturbances from gas grid sides on the dynamics of the EDCS. Then, it further investigates the impacts of joint electric and gas network disturbances on the dynamics of EDCS. Two approaches, namely analytical and MATLAB Simulink, are developed to model the dynamics of the EDCS under various disturbances. This gives a better flexibility for researchers and different stakeholders to utilize the model in their software. The proposed framework is further developed for parallel configuration of the EDCSs, with the possibility of extending to unlimited parallel EDCSs setup. Test results indicate that the electricity and gas grid disturbances affect the EDCS’s electric and gas state variables. The electric state variable is the rotational speed of the EDCS, while the gas state variables include compressor flow, suction pressure, and discharge pressure. Outcomes demonstrate that the gas state variables significantly change whether the compressor faces the electric or gas network disturbances. On the other hand, the electric state variable dramatically changes only when the compressor faces the power network disturbances."
  },
  {
    "date": "2026-2-27",
    "title": "UniOrch: A Unified Mixed Framework for High-Efficiency LLM Training on Heterogeneous AI Chips",
    "authors": "Jingyi Wang, Jia Wang, Jun Gao, Yan Cao, Yang Zhai, Haojie Wang, Wanxin Song, Dezhi Kong, Liu Liu, Wei Li, Zhaofeng He",
    "publish": "IEEE Transactions on Parallel and Distributed Systems",
    "url": "https://doi.org/10.1109/tpds.2026.3668647",
    "source": "IEEE",
    "abstract": "Efficient coordination of heterogeneous AI chips (GPU/NPU/DCU) in data centers is crucial for Large Language Model (LLM) training, but this process is hindered by architectural mismatches, protocol fragmentation, and network partitioning. Existing solutions fail to achieve unified resource management across different chips, resulting in severe resource fragmentation and reduced allreduce efficiency. To overcome these limitations, this paper proposes the unified coordination framework UniOrch, which not only integrates three core functionalities, including hardware abstraction, software standardization, and communication coordination, but also enables the training and inference of large models across heterogeneous AI chips. UniOrch's hardware-agnostic bare-metal cloud eliminates virtualization overhead through Border Gateway Protocol Ethernet Virtual Private Network (BGP EVPN) overlay networks and gateway-based chip integration; its PyTorch-based adaptation layer masks hardware differences and reduces migration costs; the Transformer Collective Communication Library (TCCL) unifies NCCL, HCCL, and OpenMPIprotocols to support seamless hybrid parallel training. Furthermore, the framework ' score scheduling mechanism is the Heterogeneous Hybrid Estimation Model (HHEM), which employs a two stage cost model combining static analysis with dynamic runtime feedback to dynamically allocate computing power based on Transformer task loads, ensuring cross-chip task synchronization, resource pooling, and dynamic allocation. Deployment verification in real-world production environments (e.g., China Construction Bank) shows that UniOrch achieves significant improvements: resource utilization of heterogeneous AI infrastructure is increased by 35%, cross-chip latency is reduced by 42%, accuracy loss in heterogeneous environments is <0.8%."
  },
  {
    "date": "2026-2-27",
    "title": "Zero-Pose-Prior NeRF: Recursive Radiance Field Reconstruction from Unposed and Unordered Images",
    "authors": "Xinxin Liu, Qi Zhang, Xue Wang, Guoqing Zhou, Qing Wang",
    "publish": "IEEE Transactions on Image Processing",
    "url": "https://doi.org/10.1109/tip.2026.3666734",
    "source": "IEEE",
    "abstract": "The dependence of neural radiance fields (NeRF) on accurate camera poses has emerged as a critical obstacle to their widespread real-world applications. While recent advances have demonstrated the potential for simultaneously addressing camera registration and scene reconstruction, these methods inherently rely on reasonable initialization derived from pose or scene priors and struggle with complex scenes involving large camera motions, particularly in unordered 360-degree scenes. In this work, we propose Zero-Pose-Prior NeRF to recover radiance fields from unposed and unordered image collections without any prior knowledge. Our key insight is to decompose this complex problem into smaller sub-problems, wherein the sub-problems’ camera poses are initially estimated to provide self-bootstrapping priors for the global pose estimation, followed by a recursive registration and reconstruction. To achieve this, we first perform scene partitioning to establish a hierarchical structure that describes registration order from local to global. Thereafter, we devise a conditionally-decoupled positional encoding for NeRFs, which serves as the basic model for camera pose estimation and scene representation. Following this, we develop a recursive registration to recursively estimate the poses of local scenes and register them into a unified global pose space, ultimately enabling the reconstruction of the entire scene. Experiments on real-world scenes show that our approach outperforms the state-of-theart pose-free methods in terms of accurate camera poses and robust radiance field reconstruction, resulting in high-fidelity view synthesis."
  },
  {
    "date": "2026-2-27",
    "title": "IEEE Control Systems Society Information",
    "authors": "N/A",
    "publish": "IEEE Transactions on Automatic Control",
    "url": "https://doi.org/10.1109/tac.2026.3658164",
    "source": "IEEE",
    "abstract": null
  },
  {
    "date": "2026-2-27",
    "title": "Winfree-Model-Type Synchronization Control for Swimming Modular Robot through Physical Interaction",
    "authors": "Kohei Nishikawa, Hayato Dan, Daisuke Kurabayashi",
    "publish": "IEEE Robotics and Automation Letters",
    "url": "https://doi.org/10.1109/lra.2026.3668705",
    "source": "IEEE",
    "abstract": "This paper proposes a Winfree-model-type synchronization control method for a swimming modular robot. In addition to reconfigurability, fault tolerance, robustness, and adaptability are crucial characteristics for modular robots. Self-organization phenomena arising from physical interactions play an important role in achieving these capabilities. Building on the Winfree synchronization model, we develop a Winfree-model-type synchronization control approach and apply it to a swimming modular robot inspired by Volvocine algae. We experimentally verify that this method enables self-organized synchronization through physical interactions and contributes to stabilizing the posture of the robot colony. Furthermore, we demonstrate the fault tolerance of the system through experiments in which one module in the colony ceases operation. Extending the interaction-based philosophy demonstrated by TEGOTAE controllers to swimming modular robots, our proposed Winfree-type scheme functions independently of specific structural assumptions."
  },
  {
    "date": "2026-2-27",
    "title": "ISED 2025 Content Announcement Page",
    "authors": "N/A",
    "publish": "2025 13th International Conference on Intelligent Systems and Embedded Design (ISED)",
    "url": "https://doi.org/10.1109/ised67359.2025.11404981",
    "source": "IEEE",
    "abstract": null
  },
  {
    "date": "2026-2-27",
    "title": "Anticipating Human Behavior for Safe Navigation and Efficient Collaborative Manipulation with Mobile Service Robots",
    "authors": "Simon Bultmann, Raphael Memmesheimer, Jan Nogga, Julian Hau, Sven Behnke",
    "publish": "2026 IEEE/SICE International Symposium on System Integration (SII)",
    "url": "https://doi.org/10.1109/sii64115.2026.11404618",
    "source": "IEEE",
    "abstract": "The anticipation of human behavior is a crucial capability for robots to interact with humans safely and efficiently. We employ a smart edge sensor network to provide global observations, future predictions, and goal information to integrate anticipatory behavior for the control of a mobile manipulation robot. We present approaches to anticipate human behavior in the context of safe navigation and collaborative mobile manipulation. First, we anticipate human motion by employing projections of predicted human trajectories from smart edge sensor observations into the planning map of a mobile robot. Second, we anticipate human intentions in a collaborative furniture-carrying task to achieve a given room layout. Our experiments indicate that anticipating human behavior allows for safer navigation and more efficient collaboration. Finally, we showcase an integrated robotic system that anticipates human behavior while collaborating with an operator to achieve a target room layout, including the placement of tables and chairs."
  },
  {
    "date": "2026-2-27",
    "title": "Improved Predator-based Point Cloud Registration Method for Inner Liners in Utility Tunnel",
    "authors": "Huijuan Zhang, Wangjiang Xie, Biying Dong, Zhechen Yang, Jie Zhou",
    "publish": "2025 5th International Conference on Mechanical Automation and Electronic Information Engineering (MAEIE)",
    "url": "https://doi.org/10.1109/maeie68099.2025.11406002",
    "source": "IEEE",
    "abstract": "Prefabricated concrete inner liners are important components in the construction of utility tunnels by prefabricated assembly method. To solve the problem of pose estimation in the automatic installation of prefabricated concrete inner liners, an improved Predator-based point cloud registration method for large inner liners in utility tunnel is proposed in this paper. Firstly, the structured light camera is used to obtain the point cloud image of the inner liners, and the edge of the point cloud is extracted based on the edge index gradient feature to obtain the edge outline. Secondly, convolutional block attention module (CBAM) is introduced to make the features focus more on important local structures and points that may be located in overlapping areas. Thirdly, registration based on maximal clique (MAC) is used to improve the accuracy and efficiency of registration. Then, the loss function is improved to enhance the accuracy of point pair matching. Finally, the experiments are carried out on the public dataset 3DMatch/3DLoMatch and the real environment of the inner liners. The experimental results show that on the 3DMatch/3DLoMatch dataset, the registration recall rate of the proposed method is improved by 2.5%/11.7%, and the average time of single registration calculation efficiency is reduced by 77.6%. Compared with Predictor, the registration recall rate of the proposed method is increased by 3.23%, the relative rotation error is reduced by 0.268°, and the relative displacement error is reduced by 0.011m in the real environment. Code and models are available at: https://www.researchgate.net/publication/397898948_ImprovedPredator"
  },
  {
    "date": "2026-2-27",
    "title": "Responsible AI Monetization: Ethical and Economic Implications of Algorithmic Business Models",
    "authors": "Durga Krishnamoorthy, Raghu Para",
    "publish": "2025 International Conference on Responsible, Generative and Explainable AI (ResGenXAI)",
    "url": "https://doi.org/10.1109/resgenxai64788.2025.11410559",
    "source": "IEEE",
    "abstract": "As businesses push to monetize from AI, from powering social media feeds to driving financial decision tools, they're unlocking major economic opportunities but also surfacing complex ethical dilemmas. This paper explores how organizations can balance profit with principles of fairness, transparency, and accountability. It highlights real-world cases where AI-driven monetization has led to bias, misinformation, and loss of trust, underscoring the risks of a short-term, revenue-first approach. To address this, we introduce the Responsible AI Monetization (RAIM) framework, a practical guide designed to help businesses innovate while avoiding ethical pitfalls. The findings suggest that embedding ethics into AI strategy not only safeguards against regulatory and reputational risks but also builds consumer confidence and supports sustainable growth. Through case studies and actionable guidance, the paper outlines how enterprises can create profitable AI solutions while ensuring that long-term value and responsibility remain at the core."
  },
  {
    "date": "2026-2-27",
    "title": "Theme: Smart Technologies and Systems",
    "authors": "N/A",
    "publish": "2025 Fourth International Conference on Smart Technologies and Systems for Next Generation Computing (ICSTSN)",
    "url": "https://doi.org/10.1109/icstsn67075.2025.11397956",
    "source": "IEEE",
    "abstract": null
  },
  {
    "date": "2026-2-27",
    "title": "A Common Source Impedance Compensation Method to Achieve Balanced Dynamic Current Sharing of Paralleled SiC MOSFETs",
    "authors": "Yan Wang, Laili Wang, Ting Hou, C.C. Chan, K.T. Chau, Wei Liu",
    "publish": "2025 IEEE 3rd International Power Electronics and Application Symposium (PEAS)",
    "url": "https://doi.org/10.1109/peas66638.2025.11403830",
    "source": "IEEE",
    "abstract": "Parallel connection of SiC MOSFETs is widely employed to increase current handling capability in high-power equipment. However, in multichip parallel configurations, establishing symmetrical layouts poses significant challenges. These asymmetries can induce current imbalance that ultimately lead to device derating. This paper proposes a quantitative model based on common-source impedance compensation to suppress current imbalance in asymmetrically arranged multi-chip paralleling configurations. The effectiveness of the proposed methodology has been experimentally validated through 500V/319A double-pulse tests, which demonstrate the capability to achieve complete current sharing of this method."
  },
  {
    "date": "2026-2-27",
    "title": "Optimizing Stacking Ensemble Learning to Enhance Meta-Model Performance in Forest Fire Risk Level Detection",
    "authors": "Yuda Irawan, Sarjon Defit, Rini Sovia",
    "publish": "2025 1st International Conference on Emerging Trends in Information Systems and Informatics (ICETISI)",
    "url": "https://doi.org/10.1109/icetisi67983.2025.11406049",
    "source": "IEEE",
    "abstract": "Indonesia is one of the countries most vulnerable to forest and land fires, especially in the Riau region, which is declared an emergency alert almost every year. These impacts damage the ecosystem, while endangering public health and disrupting economic stability. Therefore, an accurate and reliable fire risk detection system based on meteorological data is needed. This study proposes a detection model with a stacking approach that integrates six algorithms as a base model, namely C4.5, LightGBM, HistGradientBoosting, MLP, Logistic Regression, and Random Forest. The prediction results of the base model are used to form a new training set which is then processed by the Random Forest meta model, which is further boosted using XGBoost and hyperparameter optimization with Optuna. The preprocessing workflow improves data quality by applying StandardScaler for normalization, LASSO for feature selection, and SMOTE-ENN for class balancing. Model evaluation uses 10-Fold Cross Validation, classification reports, confusion matrices, and ROC curves. The experimental results show an average accuracy of 93.66%; Precision, recall, and F1 score each reached 94%. The best AUC was 0.979, outperforming the baseline stacking. Experimental evidence suggests that integrating stacking with XGBoost and Optuna hyperparameter tuning results in more accurate detection of forest fire risk levels."
  },
  {
    "date": "2026-2-27",
    "title": "Dialogue Generation for Robot Family Using ROS and Generative AI: Initial Implementation of Centralized and Distributed Systems",
    "authors": "Taichi Hirano, Fumihide Tanaka",
    "publish": "2026 IEEE/SICE International Symposium on System Integration (SII)",
    "url": "https://doi.org/10.1109/sii64115.2026.11404450",
    "source": "IEEE",
    "abstract": "The problem of human isolation and loneliness is growing worldwide. Although there are ways to provide human support, there are sustainability issues, so support using conversational physical partners, such as robots, is attracting attention as an alternative solution. Most previous attempts have been based on a single robot, and there are few attempts that use multiple robots, especially those that form a family and try to save the user from isolation and loneliness. This study aims to develop a basic infrastructure system to realize such a family consisting of multiple robots and a single human. More specifically, in this paper we report on the implementation and preliminary verification of two types of dialogue generation for robots using ROS (Robot Operating System) and GPT-4o-mini: one is a centralized system (in which the command center generates conversation scenarios for each robot in batches) and the other is a distributed system (in which each robot generates conversations individually)."
  },
  {
    "date": "2026-2-27",
    "title": "ICETISI 2025 List Reviewer Page",
    "authors": "N/A",
    "publish": "2025 1st International Conference on Emerging Trends in Information Systems and Informatics (ICETISI)",
    "url": "https://doi.org/10.1109/icetisi67983.2025.11405961",
    "source": "IEEE",
    "abstract": null
  },
  {
    "date": "2026-2-27",
    "title": "Natural Language-Driven Automation for Network Device Management with Large Language Models",
    "authors": "Hasbian Alif, Yulius Denny Prabowo, Viga Laksa Hardjanto",
    "publish": "2025 1st International Conference on Emerging Trends in Information Systems and Informatics (ICETISI)",
    "url": "https://doi.org/10.1109/icetisi67983.2025.11405956",
    "source": "IEEE",
    "abstract": "An optimized network infrastructure is essential for ensuring the reliability, security, and growth of IT-based businesses. However, operating network devices often requires advanced technical knowledge, which can become a significant barrier for non-technical users, particularly in large-scale networks. This study presents the development of a web-based network automation application utilizing Natural Language Processing (NLP) to minimize dependency on deep technical expertise in network operations. Using Python, Netmiko, and the OpenAI API, the system translates natural language commands into executable network actions. Experimental evaluation consisting of 30 test cases shows that the system successfully executed the intended function calls in 27 cases (90% success rate). User interface latency was recorded between 2 and 10 seconds, while device connection times ranged from 3 to 5 seconds. All reported values are based on direct measurement during controlled functional testing. These results demonstrate that NLP-based automation can effectively simplify network operations, improve accessibility, and enhance efficiency in managing network infrastructure."
  },
  {
    "date": "2026-2-27",
    "title": "Evaluating the Out-of-Distribution Generalization of Robot Diffusion Policies under the DINOv2 Visual Encoder",
    "authors": "Ángel Montejo, Iñigo Iturrate",
    "publish": "2026 IEEE/SICE International Symposium on System Integration (SII)",
    "url": "https://doi.org/10.1109/sii64115.2026.11404616",
    "source": "IEEE",
    "abstract": "The generalizability of visuomotor policy models is crucial for their real-world usefulness in settings such as industrial environments. This is heavily impacted by the choice of visual encoder. In this paper, we integrate the DINOv2 foundation visual encoder with Diffusion Policy by designing a spatially-aware projection head, that allows the policy to shape its visual representation while benefiting from DINOv2’s robust embeddings. We evaluate this in drastic out-of-distribution conditions. As success rate can be uninformative in these conditions, where failure rates are high, we present three evaluation criteria for goal-driven policies that remain informative despite task failure. Our result shows that our approach outperforms the baseline under color alterations and camera displacements. We observe promising emergent task-relevant feature tracking using the DINOv2 visual encoder for policy learning."
  },
  {
    "date": "2026-2-27",
    "title": "Single-Machine Equivalent Modelling of Wind Farms Based on Data-Driven Multiplier Parameter Correction",
    "authors": "Weihan Hao, Jinchuan Guo, Cheng Su, Jianwu Wang, Yiping Lu, Zehaon Wang",
    "publish": "2025 IEEE 3rd International Power Electronics and Application Symposium (PEAS)",
    "url": "https://doi.org/10.1109/peas66638.2025.11403166",
    "source": "IEEE",
    "abstract": "The rapid development of new energy power systems has raised higher demands for the accuracy and efficiency of wind farm equivalent modeling. To address the insufficient impedance parameter adaptation capability of the traditional single-machine multiplication model, this paper proposes a single-machine equivalent modeling method for wind farms based on data-driven multiplier parameter correction. By constructing a Backpropagation Neural Network (BP), a nonlinear mapping relationship is established between the number of units, operating conditions, and impedance parameters, enabling adaptive parameter adjustment. Additionally, a multi-machine equivalent model is built by clustering based on output distribution characteristics. Simulation results demonstrate that, compared to traditional methods, the proposed approach significantly reduces active and reactive power errors under various operating conditions, effectively improves dynamic response accuracy while maintaining modeling efficiency, and provides a novel solution for efficient modeling of new energy power stations."
  },
  {
    "date": "2026-2-27",
    "title": "Integrating Automatic Force Assistance Configuration with Mixed Reality for Active Exoskeletons",
    "authors": "Olmo A. Moreno Franco, Gabriele Giurin, Yonas T. Tefera, Christian Di Natali, Luigi Monica, Darwin G. Caldwell, Jesus Ortiz",
    "publish": "2026 IEEE/SICE International Symposium on System Integration (SII)",
    "url": "https://doi.org/10.1109/sii64115.2026.11404649",
    "source": "IEEE",
    "abstract": "Work-related musculoskeletal disorders are highly prevalent in physically demanding industries due to manual material handling tasks such as lifting, hauling, and carrying heavy loads. Occupational exoskeleton technology has emerged to help mitigate these injuries. Exoskeletons are wearable devices that replicate the structure of the human body to enable mechanical interaction between the user and the system. Active exoskeletons use powered actuators and sensors to provide versatile and adaptive assistance for demanding tasks. However, a gap remains in user interaction and intuitive control for these systems. Human-computer interaction technologies, including mixed, virtual and augmented reality, offer novel solutions to enhance user interaction and enable intuitive, customisable control strategies for active exoskeletons. This study integrates mixed-reality technologies with the XoTrunk active occupational exoskeleton to enable parameter tuning and system calibration through immersive interfaces. Two alternative mixed-reality interfaces were developed for this purpose: one that relies on manual user input and the other that incorporates computer vision for automatic adjustment. Experiments involving 15 participants were conducted to evaluate interfaces by performing setup and operational activities while wearing the XoTrunk exoskeleton. The results showed that the automatic interface achieved a higher System Usability Scale score (84.83/100) compared to the manual interface (78.5/100), indicating improved user acceptance and intuitiveness."
  },
  {
    "date": "2026-2-27",
    "title": "Accurate PQ-ωV Admittance Model for Parallel VSC Systems",
    "authors": "Ziwen Zhao, Ronghui An, Zhiheng Huang, Boyang Shen, Hongwei Zhou, Jinjun Liu",
    "publish": "2025 IEEE 3rd International Power Electronics and Application Symposium (PEAS)",
    "url": "https://doi.org/10.1109/peas66638.2025.11403347",
    "source": "IEEE",
    "abstract": "This paper proposes an accurate PQ-ωV admittance model for parallel voltage-source converters with grid connection, comprehensively covering the dynamics of the power control, voltage-current dual-loop control, and all circuit components. Based on a unified synchronous reference frame of the system, the proposed model provides a tool to precisely depict the system stability and the oscillation characteristics of active/reactive power, frequency and voltage amplitude. Experimental results demonstrate the effectiveness of the proposed modeling approach."
  },
  {
    "date": "2026-2-27",
    "title": "VAE-Based Synthetic EMG Generation with Mix-Consistency Loss for Recognizing Unseen Motion Combinations",
    "authors": "Itsuki Yazawa, Akira Furui",
    "publish": "2026 IEEE/SICE International Symposium on System Integration (SII)",
    "url": "https://doi.org/10.1109/sii64115.2026.11404666",
    "source": "IEEE",
    "abstract": "Electromyogram (EMG)-based motion classification using machine learning has been widely employed in applications such as prosthesis control. While previous studies have explored generating synthetic patterns of combined motions to reduce training data requirements, these methods assume that combined motions can be represented as linear combinations of basic motions. However, this assumption often fails due to complex neuromuscular phenomena such as muscle co-contraction, resulting in low-fidelity synthetic signals and degraded classification performance. To address this limitation, we propose a novel method that learns to synthesize combined motion patterns in a structured latent space. Specifically, we employ a variational autoencoder (VAE) to encode EMG signals into a low-dimensional representation and introduce a mix-consistency loss that structures the latent space such that combined motions are embedded between their constituent basic motions. Synthetic patterns are then generated within this structured latent space and used to train classifiers for recognizing unseen combined motions. We validated our approach through upper-limb motion classification experiments with eight healthy participants. The results demonstrate that our method outperforms input-space synthesis approaches, achieving approximately 30% improvement in accuracy."
  },
  {
    "date": "2026-2-27",
    "title": "Analysis and Design of a Novel 13.56 MHz Push-Pull Class E Inverter",
    "authors": "Jingbo Cui, Yueshi Guan, Yi Cheng, Yijie Wang, Dianguo Xu",
    "publish": "2025 IEEE 3rd International Power Electronics and Application Symposium (PEAS)",
    "url": "https://doi.org/10.1109/peas66638.2025.11403666",
    "source": "IEEE",
    "abstract": "The radio frequency (RF) power amplifier constitutes an indispensable component in numerous academic, medical, and industrial applications. For these applications, the required power level in certain scenarios is sufficiently high that a single power amplification circuit cannot deliver adequate power. To address this issue, power combining networks are typically employed to synthesize the output power from multiple channels in various configurations, thereby mitigating impedance mismatches among power amplifiers. However, any power combining network inevitably introduces additional losses and increases the overall system volume. To facilitate more efficient power scaling, this study proposes a push-pull Class E topology from a structural perspective. Considering the power limitations of a single channel and the need for experimental adjustability, a matching network is incorporated for performance enhancement. Finally, a 13.56 MHz 500W prototype was constructed for experimental validation, achieving a peak efficiency of 87%."
  },
  {
    "date": "2026-2-27",
    "title": "Title Page",
    "authors": "N/A",
    "publish": "2025 IEEE DELCON - International Conference on Recent Smart Technologies in Engineering for Sustainable Development",
    "url": "https://doi.org/10.1109/delcon68055.2025.11400286",
    "source": "IEEE",
    "abstract": null
  },
  {
    "date": "2026-2-27",
    "title": "HEART: Hybrid Energy-Aware Resilient Trust Evaluation Model for Healthcare-IoT",
    "authors": "Pramit Kumar Samant, Vinay Pathak, Waqar Ahmad",
    "publish": "2025 13th International Conference on Intelligent Systems and Embedded Design (ISED)",
    "url": "https://doi.org/10.1109/ised67359.2025.11404928",
    "source": "IEEE",
    "abstract": "In energy-constrained Healthcare IoT (HIoT) environments, maintaining the trustworthiness of sensor devices is vital for patient safety and system reliability. This paper introduces HEART, a Hybrid Energy-Aware Resilient Trust Evaluation model that consolidates four complementary trust dimensions—behavioural, energy, contextual, and historical—into a unified trust score. Unlike traditional centralized or static models, HEART employs dynamic weighting of trust components in response to real-time clinical and network contexts and executes trust computations in a fully distributed manner, thereby eliminating single points of failure and reducing latency. We conducted extensive MATLAB simulations on a 500-device HIoT network subjected to realistic Sybil, collusion, energy-drain, and false-data-injection attacks. Our results demonstrate an overall detection accuracy of 98.6% when only 10% of devices are malicious, gracefully degrading to 92.4% even at 50% malicious density. Attack-specific detection rates remain high at 98.1% for Sybil attacks, 95.2% for collusion, 97.4% for false data injection, and 96.8% for energy-drain attacks. False negative rates are impressively low, at 1.4% under light attack conditions and below 7.6% at maximum adversarial density. In terms of energy efficiency, HEART reduces per-device energy consumption by approximately 26%, requiring only 1.18 J per evaluation compared to 1.60 J for static model and 1.82 J for blockchain-based approach. Moreover, trust convergence time is accelerated by over 40%, stabilizing in just 83 s under low attack scenarios versus 140 s and 120 s for the static [12] and blockchain [19] baselines respectively. Trust convergence time increased marginally from 83 s to 118 s, indicating linear scalability."
  },
  {
    "date": "2026-2-27",
    "title": "Universal DC-DC Topology Deduction Mechanism Based on Graph-Theoretic Weighting and Four-Dimensional Electrical Characteristics",
    "authors": "Xinyue Chen, Liping Mo, Weijing Yang, Guipeng Chen, Xinlin Qing",
    "publish": "2025 IEEE 3rd International Power Electronics and Application Symposium (PEAS)",
    "url": "https://doi.org/10.1109/peas66638.2025.11403194",
    "source": "IEEE",
    "abstract": "Conventional topology deduction for non-resonant DC-DC converters faces dual challenges: low efficiency in manual derivation and non-systematic electrical conditions in computer-aided approaches. To further enhance the universality of electrical conditions, this paper establishes systematic component-to-electrical mapping via a four-dimensional electrical attribute framework (average/instantaneous voltage/current), deri ving universal loop/cut-set constraints (USP/ISP). Concurrently, this paper employs graph theory modeling to transform electrical conditions into graph constraints and adopts a Minimum-Unknown-Constraint-First Incremental Weighted Topology Deduction Algorithm based on dynamic programming for topology verification. These electrical conditions are applicable to DC-DC converters with numerous components. Using the S1-D3-L1 -C2 type DC-DC converter as an example, 18 topologies were deduced through algorithm execution, verifying the practicality and accuracy of the proposed electrical conditions."
  },
  {
    "date": "2026-2-27",
    "title": "Urban Sound Classification: A Lightweight CNN Approach Based on Mel-Spectrograms",
    "authors": "Pengshun Che, Jiaan Liu, Jiacheng Lu",
    "publish": "2025 6th International Symposium on Computer Engineering and Intelligent Communications (ISCEIC)",
    "url": "https://doi.org/10.1109/isceic67854.2025.11405525",
    "source": "IEEE",
    "abstract": "Urban sound classification plays a crucial role in smart city applications, enabling noise monitoring, emergency detection, and environmental analysis. This paper proposes a lightweight Convolutional Neural Network (CNN) model tailored for classifying urban sounds using Mel-spectrograms derived from a subset of the UrbanSound8K dataset. The model emphasizes efficient signal preprocessing via Short-Time Fourier Transform (STFT) and Mel-scale filtering to capture salient frequency-time features, achieving a test accuracy of 86.53% on a 1000-sample subset while utilizing only 181k parameters. Inspired by self-supervised multisensory features from ICCV 2019, our approach integrates data augmentation and shallow convolutional layers to balance performance and computational efficiency. Extensive experiments demonstrate superior results over baselines like ResNet-18 and MFCC+SVM, with ablation studies validating the contributions of preprocessing and augmentation. The lightweight design ensures rapid training (12.13 minutes) and inference (0.237 seconds), making it suitable for edge devices. This work advances accessible urban acoustics analysis, paving the way for real-time deployments in resource-constrained environments."
  },
  {
    "date": "2026-2-27",
    "title": "The Impact of Temperature Sensors in IoT on Fermentation in Eco-Enzymes",
    "authors": "Princen Putra Kurniawan, Jason Yoswara, Mochammad Haldi Widianto",
    "publish": "2025 1st International Conference on Emerging Trends in Information Systems and Informatics (ICETISI)",
    "url": "https://doi.org/10.1109/icetisi67983.2025.11406016",
    "source": "IEEE",
    "abstract": "The Internet of Things (IoT) has presented significant opportunities in recent years. Many fermentation processes have been monitored and controlled with IoT to improve them, for example, eco-enzyme production. Fermenting organic waste with eco-enzymes with consistent results has been proven to provide significant benefits to the economy and the environment. Temperature is a key parameter in fermentation. Uncontrolled temperature can cause unwanted microbial activity and even death, ultimately reducing the quality of eco-enzymes. This study examine how IoT-based monitoring can help us control the temperature during the eco-enzyme fermentation process. By using temperature and humidity sensors connected to an Arduino microcontroller and the Blynk platform, it helps enable real-time monitoring and helps maintain stable conditions throughout fermentation. The results show that this approach of implementing IoT into the eco-enzyme not only help improve efficiency and consistency of eco-enzyme production but also demonstrates the potential IoT solutions for small-scale or household applications in sustainable organic waste management. In short the data collected shows that with the Eco-Enzyme Tracker it helps monitor the fermentation process."
  },
  {
    "date": "2026-2-27",
    "title": "Hardware-Decoupled High-Frequency Triple Active Bridge (TAB) Converter",
    "authors": "Bin Zhang, Lining Zhao, Shihao Zhang, Wei Zheng, Yanjun Tian",
    "publish": "2025 IEEE 3rd International Power Electronics and Application Symposium (PEAS)",
    "url": "https://doi.org/10.1109/peas66638.2025.11403131",
    "source": "IEEE",
    "abstract": "To address the complexity of conventional high-frequency triple active bridge (TAB) converter control schemes, this paper proposes a hardware-decoupled high-frequency TAB architecture. The power transfer characteristics under hardware decoupling are thoroughly analyzed, based on which the TAB converter is equivalently transformed into a cascaded configuration of two dual active bridge (DAB) converters. Six distinct operating modes of the TAB converter are identified and classified. For the DAB converter, an extended phase shift (EPS) control strategy optimized for current stress is developed for both forward and reverse power flow, where the intra-bridge phase shift angle is allocated on the full-bridge side connected to the inductor. The resulting EPS strategy is adapted to the hardware-decoupled high-frequency TAB converter. Experimental results at a switching frequency of 100 kHz under varying power levels verify the feasibility of the proposed hardware-decoupled TAB converter across all six operating modes."
  },
  {
    "date": "2026-2-27",
    "title": "Development and Testing of Avalanche Transistors and Sub-nanosecond Pulses",
    "authors": "Kaijun Wen, Lin Liang, Tianyi Wang, Jiayi Song",
    "publish": "2025 IEEE 3rd International Power Electronics and Application Symposium (PEAS)",
    "url": "https://doi.org/10.1109/peas66638.2025.11403549",
    "source": "IEEE",
    "abstract": "In response to the growing application of ultra-wideband (UWB) technology in external environment positioning and guidance, this work investigates the fundamental technology of the avalanche bipolar junction transistor (ABJT), a key component of UWB pulse systems. An ABJT device model is established, and its static and dynamic characteristics are systematically simulated. On the fabrication side, ABJT device samples with a breakdown voltage of 300 V are successfully developed. In application testing, a Marx circuit designed using ABJTs generates sub-nanosecond pulses with a 200 ps rising edge and a peak amplitude of 1200 V. The results provide both an experimental foundation and enabling technologies for the design, fabrication, and application of ABJT devices."
  },
  {
    "date": "2026-2-27",
    "title": "An Optimized Switch Fault Diagnosis Strategy for Cascaded H-Bridge Based STATCOM",
    "authors": "Hai Huang, Liu Yang, Yincong Chen, Haoran Lu, Hanyu Wang",
    "publish": "2025 IEEE 3rd International Power Electronics and Application Symposium (PEAS)",
    "url": "https://doi.org/10.1109/peas66638.2025.11403557",
    "source": "IEEE",
    "abstract": "The cascaded H-bridge (CHB) converter is widely used in the static synchronous compensators (STACOM) due to its high modularity, strong fault tolerance, and other advantages. However, the CHB contains a large number of power switches, which significantly increases the probability of faults. Therefore, a simple and efficient fault diagnosis (FD) strategy is essential. In this paper, an optimized FD strategy considering the impact of voltage balancing control is proposed. Additionally, system redundancy is utilized for fault tolerant (FT) strategy, and this is combined with the location of the faulty switch. Finally, the feasibility and effectiveness of the proposed method is verified by Matlab/Simulink simulation. The time interval from the occurrence of a fault to the restoration of system health is less than two fundamental cycles."
  },
  {
    "date": "2026-2-27",
    "title": "Supporting QoS Guarantee in Heterogeneous Object Storage System: A Spatio-Temporal Graph Data Processing Method",
    "authors": "Wang Zhang, Ziyi Liao, Zhan Shi, Yuyang Zhu, Yutong Wu, Yiqun Gu, Fang Wang, Dan Feng",
    "publish": "ACM Transactions on Architecture and Code Optimization",
    "url": "https://doi.org/10.1145/3799701",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-27",
    "title": "Diffusion-based Multi-agent with Reinforcement Learning for Multimodal-based Recommendation",
    "authors": "Yijun Hu, Rui Tang, Hao Liu, Xian Mo",
    "publish": "IEEE Transactions on Big Data",
    "url": "https://doi.org/10.1109/tbdata.2026.3668564",
    "source": "IEEE",
    "abstract": "Multimodal-based recommendation integrates visual, textual, and acoustic modalities of items to comprehensively capture user preferences, thereby playing a crucial role in modern multimedia online platforms. In this paper, we propose a <underline xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">D</u>iffusion-based Multi-agent with <underline xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">R</u>einforcement Learning for <underline xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">M</u>ultimodal-based <underline xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">Rec</u>ommendation (DRMRec). Specifically, our DRMRec first leverages a hierarchical <underline xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">D</u>iffusion-based <underline xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">M</u>ulti-<underline xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">A</u>gent (DMA) to reconstruct the user-item interaction graph. Subsequently, these reconstructed graphs are fused with multimodal information to form contrastive views. During the reconstruction, each agent is injected with multimodal information through a <underline xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">C</u>ross-<underline xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">M</u>odal <underline xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">A</u>ligner (CMA), thereby bringing cross-modal information closer to interaction embeddings and facilitating alignment across modalities. Then, we introduce a <underline xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">M</u>etric-<underline xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">A</u>ware <underline xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">D</u>iffusion <underline xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">R</u>einforcer (MADR), a reinforcement learning framework that leverages validation-set recommendation metrics as reward signals to enable dynamic and individual fine-tuning of each agent, thereby actively aligning model optimization with recommendation tasks. Next, we apply cross-modal graph contrastive learning to contrastive views, alleviating data sparsity while further enhancing cross-modal alignment. Extensive experiments on three real-world multimedia platform datasets demonstrate that DRMRec consistently outperforms state-of-the-art approaches in multimodal-based recommendation. It is noteworthy that the performance improvements across all three metrics on both the TikTok and Sports datasets exceed 10%."
  },
  {
    "date": "2026-2-27",
    "title": "Anchor-guided Discrete Multi-view Clustering",
    "authors": "Ran Jing, Quanxue Gao, Yu Duan, Cheng Deng, Ming Yang",
    "publish": "IEEE Transactions on Multimedia",
    "url": "https://doi.org/10.1109/tmm.2026.3668570",
    "source": "IEEE",
    "abstract": "Multi-view clustering based on anchor graphs has attracted significant attention due to its ability to substantially reduce computational complexity, enabling the efficient processing of large-scale multimedia data. However, most existing anchor graph-based clustering methods fail to fully exploit the intrinsic properties of anchor graphs when applying regression techniques. Moreover, some approaches focus solely on sample labels while overlooking the crucial role of anchor labels in clustering. To address these limitations, we leverage the probabilistic information of the anchor graph by employing probabilistic projection to map the anchor graph into the label space, thereby obtaining anchor labels. By clustering both anchors and samples simultaneously, the anchor graph serves as a guide to induce anchor labels, which are then used to generate sample labels, facilitating anchor-guided sample clustering. Furthermore, we propose a novel regularization paradigm based on the matrix nuclear norm, ensuring that the obtained results remain discrete and that the sample distribution across clusters is balanced. Additionally, we introduce a new matrix nuclear norm optimization method based on the first-order Taylor expansion. Extensive experiments on real-world datasets demonstrate the effectiveness and robustness of our proposed method, achieving superior performance compared to state-of-the-art approaches. Our code is available at: <uri xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">https://github.com/harunakai/ADMC</uri>"
  },
  {
    "date": "2026-2-27",
    "title": "Sounding Depressed? Personalized Deep Learning Model for Depression Detection from Speech and Text",
    "authors": "Haibo Zhang, Zhenyu Liu, Jiaqian Yuan, Gang Li, Zhijie Ding, Bin Hu",
    "publish": "IEEE Transactions on Multimedia",
    "url": "https://doi.org/10.1109/tmm.2026.3668527",
    "source": "IEEE",
    "abstract": "Automatic depression detection technology based on speech and text data is one of the current research hotspots. However, numerous current models may inadequately incorporate the individual characteristics important for improving detection precision. This leads to misjudgment when the model deals with a depressed patient whose behavior significantly differs from the majority of patients. Thus, the goal of this research is to extract individual characteristics from speech and text data among individuals and develop an efficient and stable personalized model for depression detection. We propose a personalized multimodal depression detection model (PMDDM). The proposed model generates personalized embeddings for each individual by utilizing both speech and text features, while learning depressive representations and integrating them with personalized embeddings for joint representations. Lastly, the model receives the joint representations to predict the individual's depression status. We evaluated the proposed model using two datasets related to depression detection, MODMA and MIDD. Compared to the best baseline methods, our method improved the recognition accuracy by 5.88% and 3.84% on the MODMA and MIDD datasets, respectively. The F1 scores increased by 4.55% and 3.45%, respectively. In the cross-dataset generalizability experiments, our method still outperformed the best baseline methods in F1 score and accuracy. Results suggest that the effective integration of personalized information can significantly improve the accuracy and generalizability of depression detection models. Our research provides novel insights into personalized depression detection."
  },
  {
    "date": "2026-2-27",
    "title": "Decouple, Reorganize, and Fuse: A Multimodal Framework for Cancer Survival Prediction",
    "authors": "Huayi Wang, Haochao Ying, Yuyang Xu, Qibo Qiu, Cheng Zhang, Danny Z. Chen, Ying Sun, Jian Wu",
    "publish": "IEEE Transactions on Medical Imaging",
    "url": "https://doi.org/10.1109/tmi.2026.3668773",
    "source": "IEEE",
    "abstract": "Cancer survival analysis commonly integrates information across diverse medical modalities to make survival-time predictions. Existing methods primarily focus on extracting different decoupled features of modalities and performing fusion operations such as concatenation, attention, and Mixture-of-Experts (MoE)-based fusion. However, these methods still face two key challenges: i) fixed fusion schemes (concatenation and attention) can lead to model over-reliance on predefined feature combinations, limiting the dynamic fusion of decoupled features; ii) in MoE-based fusion methods, each expert network handles separate decoupled features, which limits information interaction among the decoupled features. To address these challenges, we propose a novel Decoupling-Reorganization-Fusion framework (DeReF), which devises a random feature reorganization strategy between modalities decoupling and dynamic MoE fusion modules. Its advantages are: i) it increases the diversity of feature combinations and granularity, enhancing the generalization ability of the subsequent expert networks; ii) it overcomes the problem of information closure and helps expert networks better capture information among decoupled features. Additionally, we incorporate a regional cross-attention network within the modality decoupling module to improve the representation quality of decoupled features. Extensive experimental results on our in-house Liver Cancer (LC) and three widely used public datasets from The Cancer Genome Atlas (TCGA) confirm the effectiveness of our proposed method. Codes are available at https://github.com/ZJUMAI/DeReF."
  },
  {
    "date": "2026-2-27",
    "title": "SegTrans: Transferable Adversarial Examples for Segmentation Models",
    "authors": "Yufei Song, Ziqi Zhou, Qi Lu, Hangtao Zhang, Yifan Hu, Lulu Xue, Shengshan Hu, Minghui Li, Leo Yu Zhang",
    "publish": "IEEE Transactions on Multimedia",
    "url": "https://doi.org/10.1109/tmm.2026.3668652",
    "source": "IEEE",
    "abstract": "Segmentation models exhibit significant vulnerability to adversarial examples in white-box settings, but existing adversarial attack methods often show poor transferability across different segmentation models. While some researchers have explored transfer-based adversarial attack (i.e., transfer attack) methods for segmentation models, the complex contextual dependencies within these models and the feature distribution gaps between surrogate and target models result in unsatisfactory transfer success rates. To address these issues, we propose SegTrans, a novel transfer attack framework that divides the input sample into multiple local regions and remaps their se mantic information to generate diverse enhanced samples. These enhanced samples replace the original ones for perturbation optimization, thereby improving the transferability of adversarial examples across different segmentation models. Unlike existing methods, SegTrans only retains local semantic information from the original input, rather than using global semantic information to optimize perturbations. Extensive experiments on two bench mark datasets, PASCAL VOC and Cityscapes, four different segmentation models, and three backbone networks show that SegTrans significantly improves adversarial transfer success rates without introducing additional computational overhead. Compared to the current state-of-the-art methods, SegTrans achieves an average increase of 8.55% in transfer attack success rate and improves computational efficiency by more than 100%. The code is available at https://github.com/Yufei-17/SegTrans."
  },
  {
    "date": "2026-2-27",
    "title": "Compositional Text-to-Image Synthesis with Training-Free Layout-Guided Diffusion",
    "authors": "Xiaoling Gu, Lingwei Luo, Shengqi Wu, Zizhao Wu, Zhenzhong Kuang, Zhou Yu",
    "publish": "IEEE Transactions on Multimedia",
    "url": "https://doi.org/10.1109/tmm.2026.3668676",
    "source": "IEEE",
    "abstract": "Recent text-to-image (T2I) diffusion models have made significant strides in generating high-quality images from diverse textual prompts. Despite this progress, these models often face challenges in accurately understanding and synthesizing complex prompts, primarily due to their limited compositional capabilities. In this study, we propose a novel approach for compositional T2I synthesis using layout-guided diffusion models, which do not require additional training. Specifically, we leverage the chain-of-code prompting technique of large language models to interpret textual prompts and generate object layouts with spatial coherence. To enhance the alignment between generated images and textual descriptions, we introduce two innovative layoutguided loss functions: Patch-oriented Cross-Attention (PCA) loss and Region-oriented Cross-Attention (RCA) loss. The PCA loss emphasizes high activation values for image patches that attend to all tokens in the prompt across the layout. The RCA loss enhances the average attention within the layout, thereby increasing the accuracy of generating objects and their associated attributes within specified regions. These proposed loss functions reassign cross-attention in diffusion models during the denoising process. Our comprehensive experiments consistently demonstrate the effectiveness of our approach in improving semantic alignment between generated images and a diverse range of textual prompts, while ensuring high usability as a ready-to-use plugin. Our code is available at <uri xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">https://github.com/gxl-groups/Compositional-T2I</uri>."
  },
  {
    "date": "2026-2-27",
    "title": "Reasoning Techniques Meet GraphRAG: Advancing LLM for Wireless Network Cyber Defense",
    "authors": "Shuang Tian, Tao Zhang, Ruichen Zhang, Xiangyun Tang, Zhi Liu, Jiawen Kang, Jiqiang Liu, Dusit Niyato, Dong In Kim",
    "publish": "IEEE Wireless Communications",
    "url": "https://doi.org/10.1109/mwc.2026.3659831",
    "source": "IEEE",
    "abstract": "Recently, cyberattacks have quickly evolved and transformed from isolated incidents into multiple layers, multi-stage attack chains, posing unprecedented challenges to cybersecurity defenses. Large Language Models (LLMs), with their powerful comprehension and generation capabilities, are emerging as a crucial technological foundation for next-generation intelligent defense systems. However, when confronting complex cyber threats, the LLMs relying solely on understanding and generation remain inadequate. Enhancing their reasoning and decision-making capabilities has thus become a key direction in current cybersecurity research. Focusing on this direction, this paper first outlines evolving demands of cybersecurity and comprehensively reviews existing reasoning techniques. We then integrate GraphRAG into reasoning techniques, proposing an LLM reasoning framework tailored for cybersecurity scenarios. The framework provides models with accurate context and guides their decisions through reasoning techniques. This enhances their reasoning capabilities when confronting complex cybersecurity problems. This enables them to identify threats, reconstruct attack chains, and generate defense strategies, particularly against multi-layered, multi-stage attacks. Subsequently, we validate the effectiveness of our proposed framework through a case study focused on Low Altitude Economy Networks (LAENets) communication. Finally, we summarize potential future research directions in this field."
  },
  {
    "date": "2026-2-27",
    "title": "A Wearable Hand Tremor-Suppressing Glove Using PVC Gel-Based Actuators and Force Sensors",
    "authors": "Chen Liu, Yan Wang, Ketao Zhang",
    "publish": "IEEE/ASME Transactions on Mechatronics",
    "url": "https://doi.org/10.1109/tmech.2026.3663307",
    "source": "IEEE",
    "abstract": "Hand tremor significantly impairs daily activities, affecting the quality of life for millions worldwide. Compared to traditional invasive treatments, noninvasive wearable devices offer a promising, more convenient, and safer alternative but often struggle to balance tremor suppression efficacy, wearability, and comfort. This study presents a novel wearable hand tremor-suppressing orthosis glove integrating semi-active and active control schemes using flexible polyvinyl chloride gel-based actuators and sensors. The glove integrates first, self-sensing semi-active absorbers to detect and suppress wrist and finger tremors, second, active fingertip tremor absorbers to counteract fingertip tremor forces, and third, two types of flexible sensors (resistive strain sensors and capacitive force sensors) to ensure accurate detection whether the hand is trembling in the air or in contact with a surface. Simulations and experiments validate the glove’s ability to suppress tremors across a wide frequency range (3–12 Hz), achieving a suppression ratio of up to 81.7% at the fingertips. Compared to state-of-the-art solutions, the glove achieves a superior suppression-per-power metric of 163.4%/W, while maintaining low weight (155 g) and flexibility, enhancing comfort and adaptability. This work advances wearable tremor suppression by integrating semi-active and active schemes, offering a noninvasive and effective solution for hand tremors."
  },
  {
    "date": "2026-2-27",
    "title": "Hybrid Discretized Luenberger Observer for Sensorless IPMSM Drives Under Low Sampling-to-Fundamental Frequency Ratio",
    "authors": "Boyu Zhang, Zheng Wang, Minrui Gu, Yinzhen Shen",
    "publish": "2025 IEEE 3rd International Power Electronics and Application Symposium (PEAS)",
    "url": "https://doi.org/10.1109/peas66638.2025.11403158",
    "source": "IEEE",
    "abstract": "In this article, a Luenberger observer discretized by a hybrid method for interior permanent magnet synchronous machine (IPMSM) sensorless drives is proposed. It owns high discretization accuracy and is easy to implement in digital control systems, enabling it to be applied to low sampling-to-fundamental frequency ratio (SFR) high speed motor drives. First, the conventional discretization methods are investigated. Then, the hybrid method combining forward Euler (FE) method and fourth-order Runge-Kutta (RK-4) method is presented. All the methods are evaluated from two aspects: discretization error and computational cost. After that, the design of the proposed Luenberger observer is introduced. Finally, simulation results are given to validate the proposed scheme."
  },
  {
    "date": "2026-2-27",
    "title": "Accurate Time-Domain Model for Flying Capacitor Based Three-Level LLC Resonant Converters",
    "authors": "Shuo Zhang, Ziang Li, Qi Zhang, Junhong Yu, Jinjun Liu, Yuqi Wei",
    "publish": "2025 IEEE 3rd International Power Electronics and Application Symposium (PEAS)",
    "url": "https://doi.org/10.1109/peas66638.2025.11403283",
    "source": "IEEE",
    "abstract": "X7R-type ceramic capacitors are widely used as flying capacitors in three-level LLC resonant converters (FC- TL LLC) due to their high permittivity and compact size. However, critical effects including the flying capacitance derating under DC bias condition, voltage fluctuations, and resonant frequency deviation are often ignored. This paper proposes an accurate time-domain model for FC-TL LLC based on fundamental operational stages iteration, which incorporates these often-neglected effects along with common parasitic components. Analytical expressions are available to enable fast and precise performance evaluation. Simulation results validate the model’s accuracy and improved voltage gain prediction over the conventional methods."
  },
  {
    "date": "2026-2-27",
    "title": "Wide Range Series Resonant Converter with Double-Mode Operation Control Strategy",
    "authors": "Pengyu Jia, Yimei Xing, Mingwang Yang, Mei Liang",
    "publish": "2025 IEEE 3rd International Power Electronics and Application Symposium (PEAS)",
    "url": "https://doi.org/10.1109/peas66638.2025.11403753",
    "source": "IEEE",
    "abstract": "The dual active bridge series resonant converter (DAB-SRC) often requires extremely high switching frequency to maintain soft switching under conditions of voltage gain deviation from unit gain and light load, which limits its application in a wide voltage range. To address this issue, this paper proposes a topology optimization method with an additional inductor. By controlling the phase relationship (in-phase/anti-phase) of the driving pulses, it achieves the switching between full-bridge and half-bridge modes, changing the characteristic impedance and resonant frequency of the converter, effectively reducing the switching frequency under light load and widening the voltage range. This paper firstly establishes time-domain analytical models for both full-bridge and half-bridge operating modes using a single half-bridge as the basic circuit unit, solves the converter model with switching frequency and single phase-shift as control variables, and plots the soft switching region boundaries considering the influence of deadtime. On this basis, a hybrid control strategy is proposed —the full-bridge mode employs constant -frequency phase-shift control based on the linear relationship between frequency and gain, while the half-bridge mode adopts variable-frequency phase-shift control based on the linear relationship between frequency and load, so as to achieve soft switching over the entire voltage range. Finally, validation is carried out using a 1.2 kW experimental prototype."
  },
  {
    "date": "2026-2-27",
    "title": "Estimation of Flux Saturation Model for SynRMs Using Physics-Informed Neural Networks at Standstill",
    "authors": "Cheng Ye, Yankai Jia, Yusheng Song, Changxing Guo, Chuanwen Shen",
    "publish": "2025 IEEE 3rd International Power Electronics and Application Symposium (PEAS)",
    "url": "https://doi.org/10.1109/peas66638.2025.11403601",
    "source": "IEEE",
    "abstract": "This paper presents a high-precision flux linkage identification method for synchronous reluctance motors (SynRMs) using physics-informed neural networks (PINNs). Traditional approaches like polynomial fitting or finite element analysis (FEA) often face limitations in either accuracy or computational efficiency. The proposed PINN framework integrates physical knowledge, including partial differential equations, initial conditions, and reciprocity constraints, directly into the neural network training process. This combination of data-driven learning with physics-based constraints improves modeling accuracy and robustness. Additionally, a novel data acquisition method based on voltage injection experiments which does not require rotor locking or position sensors is developed to facilitate practical and comprehensive data collection. Extensive simulations conducted on a Siemens 0.55 kW industrial SynRM verify that the PINN method substantially outperforms conventional artificial neural networks (ANNs) in terms of modeling accuracy, physical consistency, robustness to data quality and quantity variations, and generalization capability. The results demonstrate that the PINN framework not only enhances the fidelity and reliability of flux linkage identification but also simplifies experimental procedures, thereby offering a promising and scalable solution for intelligent modeling and control of SynRMs and similar nonlinear electromagnetic systems."
  },
  {
    "date": "2026-2-27",
    "title": "Energy Management Optimization for Photovoltaic Hydrogen Production System",
    "authors": "Lei Guo, Boyang Zhao, Meijian Wang, Yuan Gao, Ning Wang",
    "publish": "2025 IEEE 3rd International Power Electronics and Application Symposium (PEAS)",
    "url": "https://doi.org/10.1109/peas66638.2025.11403739",
    "source": "IEEE",
    "abstract": "This paper investigates the energy optimization control of photovoltaic (PV) hydrogen production systems. First, a multi-time-scale dynamic model is constructed, covering the internal characteristics of the electrolyzer, and systematically reveals the influence mechanisms of factors such as fluctuations in PV power output on electrolysis efficiency and system stability. Second, an energy management strategy based on deep reinforcement learning is proposed. In terms of energy dispatch strategy, a multi-objective optimization model is developed, targeting hydrogen production efficiency and reliability, to achieve intelligent optimization of multi-source dynamic dispatch. Finally, test results validate the effectiveness of the proposed solution."
  },
  {
    "date": "2026-2-27",
    "title": "GS-MATSC: Group Symmetric Multi-Agent Traffic Signal Control with Attention and Mirror Loss",
    "authors": "Dawei Shi, Haoqi Xu, Yulu Li, Yitong Bai",
    "publish": "2025 6th International Symposium on Computer Engineering and Intelligent Communications (ISCEIC)",
    "url": "https://doi.org/10.1109/isceic67854.2025.11405706",
    "source": "IEEE",
    "abstract": "This paper introduces GS-MATSC, a novel Multi- Agent Reinforcement Learning (MARL) framework designed to address the curse of dimensionality in large-scale traffic signal control. Built upon Multi-Agent PPO (MAPPO), the model incorporates group symmetry principles to enhance generalization and training efficiency. Specifically, a multi-head attention-based policy network ensures permutation equivariance among agents, while a mirror auxiliary loss enforces rotational symmetry in road network structures. Experiments conducted in SUMO simulations with 12 and 18 traffic light agents demonstrate that GS-MATSC significantly improves sample efficiency, policy stability, and traffic metrics—such as reducing delay time and queue length—compared to baseline methods. The framework offers a scalable and robust solution for coordinated traffic signal control in complex urban networks."
  },
  {
    "date": "2026-2-27",
    "title": "A Multi-Layered Security Framework for NIfTI Images Using CNN Feature Extraction, Arnold Scrambling and DWT Watermarking",
    "authors": "Aradhana Soni, Amit Kumar Dewangan, Ankit Kumar",
    "publish": "2025 13th International Conference on Intelligent Systems and Embedded Design (ISED)",
    "url": "https://doi.org/10.1109/ised67359.2025.11404760",
    "source": "IEEE",
    "abstract": "The wide accumulation of digitized medical images, especially in 3D formats such as NIfTI, has become a significant threat to data integrity, privacy and secure sharing. This paper proposes a new multi-layer security scheme for NIfTI medical images that integrates Convolutional Neural Networks (CNN), ARNOLD transformation to spatially scramble an image, and discrete wavelet transformation (DWT) for watermark embedding. Watermarks are placed in nondiagnostic areas only to ensure diagnostic quality studies. Experiments on Brats and ADNI demonstrate the impressive performance: PSNR $(40.87 \\mathrm{~dB})$, SSIM (0.956), NC (0.97), BER (0.018) and ROI Preservation Score (0.98). The developed framework exhibits high robustness, real-time efficiency and adaptivity for secure reversible protection of the volumetric medical data and outperforms the current approaches in fidelity and resilience as well."
  },
  {
    "date": "2026-2-27",
    "title": "Research on Construction and Dynamic Evolution of Knowledge Graph for University History Archive Resources Based on Multimodal Data",
    "authors": "Yougan Luo",
    "publish": "2025 5th International Conference on Mechanical Automation and Electronic Information Engineering (MAEIE)",
    "url": "https://doi.org/10.1109/maeie68099.2025.11405965",
    "source": "IEEE",
    "abstract": "Addressing the issues of weak semantic associations in multimodal data (text, images), the difficulty in capturing the evolutionary context of long-span historical events, and the uneven quality of old archives in current university history archive management, this paper proposes a Multimodal Knowledge Graph with Dynamic Evolution (MMKG-DE) model based on visual semantic enhancement and time-sensitivity perception. At the methodological level, distinct from standard fusion methods that rely on simple zero-filling, the model designs a Visual Hallucination Completion Mechanism to reconstruct the semantic manifold of incomplete data rather than introducing feature distortion. Secondly, to overcome the catastrophic forgetting in snapshot-based RNN models caused by sparse intervals, a Time-Sensitivity Aware Translation function is constructed to precisely model non-stationary evolutionary laws. Comparative experiments on a self-constructed university history dataset (SH-Data) and public benchmark datasets (WN9-IMG, FB15K-237-IMG) demonstrate that MMKG-DE significantly outperforms existing advanced models such as RE-NET and MKG-GNN in core metrics like entity alignment (MRR=0.658) and dynamic link prediction (Hits@10=0.745), confirming the robustness and effectiveness of this method in complex archival scenarios."
  },
  {
    "date": "2026-2-27",
    "title": "Applying Vision-Language Models for Intelligent Multimodal Surveillance and Crime Detection",
    "authors": "Nishchay Gupta, Kunal, Madhav Sachar, Rupali Pandey, Vishal Sharma",
    "publish": "2025 IEEE DELCON - International Conference on Recent Smart Technologies in Engineering for Sustainable Development",
    "url": "https://doi.org/10.1109/delcon68055.2025.11400401",
    "source": "IEEE",
    "abstract": "With growing security concerns in the modern world, a requirement of a modern surveillance solution is generated. The current state of technology offers solutions in the form of custom built, fine-tuned neural networks to automate the process of detecting abnormal behaviour. These systems often rely on pretrained neural networks like ResNet, YOLOv5, etc. The research paper aims to explore new technology in the domain of smart surveillance to further the cause of a secure future for humanity as a whole. The proposed paper proposes the utilisation of pretrained Multi-Modal Models which can take Audio and Visual cues to identify Abnormal behaviour and further increase the pinpoint accuracy of the model. Other than the obvious advantage, these models like Gemini Vision offer Multimodal analysis of the input data therefore helping to further pinpoint the occurrence of abnormal behaviour in the input footage. The implemented system achieved an overall accuracy of 75%, with a precision of 93.3%, recall of 66.7%, and F1-score of 77.8% for crime detection, indicating strong performance in identifying actual criminal activities. By utilising the recent advancements in the field of deep learning the smart surveillance system offers an opportunity for the nation to develop into a more secure, peaceful state."
  },
  {
    "date": "2026-2-27",
    "title": "A Localization Strategy for Low-cost UAVs Sewers Inspection",
    "authors": "Paolo Maisto, Vincenzo Scognamiglio, Mario Selvaggio, Vincenzo Lippiello",
    "publish": "2026 IEEE/SICE International Symposium on System Integration (SII)",
    "url": "https://doi.org/10.1109/sii64115.2026.11404663",
    "source": "IEEE",
    "abstract": "Inspecting sewers represents a significant challenge as these environments pose considerable safety risks to human operators. In this view, drones capable of autonomous flight can be used to perform inspection tasks reducing human exposure. However, sewer environments are typically confined, featureless, and poorly lit, hence, standard algorithms for the localization in GNSS-denied environments, such as Visual-Inertial Odometry (VIO), often fail. In addition, drone localization is further complicated by rotor-induced turbulence, and vibrations, that affect sensor measurements. This paper presents a low-cost multisensor-based method for robust pose reconstruction of Unmanned Aerial Vehicles (UAVs) to enable reliable navigation in visually degraded, GPS-denied environments. The proposed framework leverages environmental geometry, specifically obstacle and wall distances, to estimate relative motion and correct drift via a speed control strategy that maximizes the distance from any obstacle. The approach is validated through both simulation and real-world experiments, demonstrating its effectiveness in representative scenarios."
  },
  {
    "date": "2026-2-27",
    "title": "An Overall Loss Modeling Considering Current Ripple for Hybrid 3L-ANPC Converters",
    "authors": "Xiaoxuan Yao, Chenglong Dong, Yonghao Li, Xin Xiang, Wuhua Li",
    "publish": "2025 IEEE 3rd International Power Electronics and Application Symposium (PEAS)",
    "url": "https://doi.org/10.1109/peas66638.2025.11403091",
    "source": "IEEE",
    "abstract": "Accurate system-level loss prediction is essential for designing efficient power electronic converters. This work develops an overall loss model for a hybrid three-level active neutral-point-clamped (3L-ANPC) converter that explicitly incorporates the converter-side inductor current ripple. First, an analytical expression is derived for the peak-to-peak ripple as a function of switching frequency and modulation, while capturing the inductance nonlinearity of the LCL filter (mainly converter-side inductor). The resulting ripple is then embedded in semiconductor loss calculations—covering both conduction loss and the distinct turn-on/turn-off switching energies—and in the inductor core loss via Steinmetz-type formulations that map ripple current to flux-density swing. By sweeping switching frequency, the model captures the trade-off between device switching loss and magnetic core loss and identifies the frequency that maximizes efficiency. Experimental results on a 215kW, 1330Vdc, 690Vac prototype validate the analysis. The proposed framework therefore provides a practical basis for selecting switching frequency in hybrid 3L-ANPC systems with LCL filters."
  },
  {
    "date": "2026-2-27",
    "title": "A Disturbance-Triggered Dual-Agent Reinforcement Learning Frequency Compensation Strategy with Lyapunov-Guided Stability for LLC Resonant Converters",
    "authors": "Xiaokun Bao, Xueqi Liu, Xin Zhang, Zhengfang Zhang, Yelai Zheng",
    "publish": "2025 IEEE 3rd International Power Electronics and Application Symposium (PEAS)",
    "url": "https://doi.org/10.1109/peas66638.2025.11403752",
    "source": "IEEE",
    "abstract": "This paper presents a hybrid control strategy for LLC resonant converters that enhances transient performance while preserving the simplicity of conventional PI regulation. A reinforcement learning-based frequency compensator is introduced, which is selectively triggered during input voltage disturbances. Instead of replacing the base controller, the proposed method injects a one-time frequency correction to quickly suppress voltage deviations. A dual-agent architecture is adopted to handle rising and falling disturbances independently, and a Lyapunov-guided reward function is used to ensure stable convergence during compensation. Experimental results from step-up and step-down tests verify that the proposed method significantly improves voltage recovery speed and reduces overshoot, making it a lightweight yet effective solution for dynamic stabilization in LLC converters."
  },
  {
    "date": "2026-2-27",
    "title": "An Improved Passivity-Based Control Method for Three-Phase ANPC Inverters under Weak Grid",
    "authors": "Chenglong Dong, Xiaoxuan Yao, Yuxuan Lin, Ke Cheng, Xin Xiang, Wuhua Li",
    "publish": "2025 IEEE 3rd International Power Electronics and Application Symposium (PEAS)",
    "url": "https://doi.org/10.1109/peas66638.2025.11403180",
    "source": "IEEE",
    "abstract": "Passivity-based control (PBC) methods have been extensively studied and widely applied to grid-connected inverters to achieve improved control performance. This paper focuses on a three-phase active neutral point clamped (ANPC) inverter. First, the Euler-Lagrange model of the inverter is established, and the passivity of the system is verified. Based on damping injection, the passivity-based controller is designed. The control mechanism and steady-state error characteristics are analyzed in detail, and an automatic parameter tuning method is proposed. An impedance model of the passive controller is further developed to analyze system stability under weak grid conditions. Compared to conventional PI control, the passive controller exhibits superior robustness. Finally, to enhance the controller’s robustness against grid impedance variations, an impedance reshaping method based on inverter-side current feedback is introduced. Simulation results validate the effectiveness of the proposed control strategy in steady-state error suppression and robustness to grid impedance variations."
  },
  {
    "date": "2026-2-27",
    "title": "Adaptive Communication Protocols for Manager-Worker Small LLM Multi-Agent Systems in Resource-Constrained Environments",
    "authors": "Kumar Yashu, Vyshali J Gogi, Azarudheen S",
    "publish": "2025 IEEE DELCON - International Conference on Recent Smart Technologies in Engineering for Sustainable Development",
    "url": "https://doi.org/10.1109/delcon68055.2025.11400330",
    "source": "IEEE",
    "abstract": "The proliferation of Internet of Things (IoT) and edge computing paradigms has necessitated the deployment of intelligent multi-agent systems in resource-constrained environments, where traditional communication protocols fail to optimize bandwidth utilization and energy consumption. This paper presents a novel adaptive communication framework specifically designed for manager-worker small Large Language Models (LLMs) multi-agent systems operating under stringent computational, memory, and energy constraints. Our approach integrates three synergistic innovations: (1) a lightweight semantic filtering module employing knowledge-distilled small LLMs (DistilBERT 66M parameters, TinyBERT 4.4M parameters) for real-time extraction of task-relevant information with minimal computational overhead, (2) a dynamic hierarchical coordination scheme enabling runtime role reassignment based on evolving task complexity and resource availability, and (3) an adaptive topology control mechanism leveraging algebraic connectivity measures to optimize network robustness while minimizing communication overhead. Comprehensive simulation-based evaluation across five distinct IoT deployment scenarios demonstrates substantial improvements in communication efficiency, achieving an average token reduction of <tex xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">$\\mathbf{5 7. 4 \\%}$</tex> (range: <tex xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">$\\mathbf{5 4. 1 - 5 9. 4 \\%}$</tex>) while maintaining task completion rates within 8.3 percentage points of baseline performance. The framework exhibits superior coordination quality improvements of 6.0 %, coupled with significant resource optimization including <tex xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">$\\mathbf{5 1. 2 \\%}$</tex> CPU usage reduction and 50.4 % energy savings, validating its practical suitability for edge computing deployments in resource-critical applications."
  },
  {
    "date": "2026-2-27",
    "title": "Improving Robotic Imitation Learning with Predicted Facial Motion Using Transformers",
    "authors": "Yitong Li, Fumio Kanehiro",
    "publish": "2026 IEEE/SICE International Symposium on System Integration (SII)",
    "url": "https://doi.org/10.1109/sii64115.2026.11404449",
    "source": "IEEE",
    "abstract": "This study proposes a Transformer-based approach with cross attention for predicting human facial movements in face-related robotic control tasks and integrating these predictions into an imitation learning framework. A dataset of human facial videos was constructed, and landmarks were extracted using the MediaPipe framework. Three prediction methods were compared, and the cross-attention model achieved the best performance in both landmark localization accuracy and image quality. In imitation learning experiments, facial motion trajectories sampled from real human data trajectories were used, and the success rate increased from 42% to 60% and ultimately to 74% when predicted landmarks were incorporated. Additionally, varying the prediction horizon affected task completion time, with the 2-frame horizon achieving the fastest completion. These results demonstrate that incorporating predicted facial motion can significantly enhance robotic control performance in dynamic human-robot interaction scenarios."
  },
  {
    "date": "2026-2-27",
    "title": "Research on Transformer with Variable Magnetizing Inductance Applied to Dual Mode LLC-DAB Converter",
    "authors": "Zheng Lu, Zinan Lou, Peinan Rao, Shuai Zhou, Yan Zhang, Jinjun Liu",
    "publish": "2025 IEEE 3rd International Power Electronics and Application Symposium (PEAS)",
    "url": "https://doi.org/10.1109/peas66638.2025.11403747",
    "source": "IEEE",
    "abstract": "Bidirectional isolated DC-DC topologies, particularly LLC and DAB converters, have found widespread applications in DC microgrids, energy storage systems, and electric vehicles. Numerous studies have investigated improved topologies to combine their respective advantages. This paper presents an improved dual-transformer structure for a dual-mode LLC-DAB converter, achieving mode-dependent magnetizing inductance characteristics: low equivalent inductance in LLC mode for enhanced voltage regulation, and high equivalent inductance in DAB mode for reduced circulating current. This adaptive design meets varying excitation current requirements across operational scenarios, thereby improving system efficiency. Theoretical analysis and simulation results validate the proposed structure's operating principles."
  },
  {
    "date": "2026-2-27",
    "title": "An ISO/IEC 25010-Based Evaluation Methodology for Designing Digital Mock-Up Toward Nuclear Decommissioning",
    "authors": "Fumiaki Abe, Kuniaki Kawabata, Wataru Sato, Tomoki Sakaue",
    "publish": "2026 IEEE/SICE International Symposium on System Integration (SII)",
    "url": "https://doi.org/10.1109/sii64115.2026.11404493",
    "source": "IEEE",
    "abstract": "This paper describes an ISO/IEC 25010-based evaluation methodology for designing Digital Mock-Up (DMU) toward nuclear decommissioning. Tokyo Electric Power Company Holdings, Inc. (TEPCO) is planning to develop a DMU to facilitate safe and reliable decommissioning operations using remote-control robots since the conditions inside the reactor buildings remain many unknown unknowns. To effectively implement the DMU, it is essential to carefully select available software technologies, install them, and adopt a software system integration framework to organize the DMU. Therefore, appropriate evaluations must be conducted. In this paper, we proposed a quantitative method for evaluating the functionality and systemization of the DMU based on a software quality requirements and evaluation model ISO/IEC 25010. Also, we reported a case study in which the proposed evaluation methodology was applied to a fundamental DMU developed based on a typical use case."
  },
  {
    "date": "2026-2-27",
    "title": "Research on Control and Modulation Strategy for Reusing Module Soft Open Point Topology",
    "authors": "Runyan Sha, Wu Chen, Haixi Zhao, Yutong Chen",
    "publish": "2025 IEEE 3rd International Power Electronics and Application Symposium (PEAS)",
    "url": "https://doi.org/10.1109/peas66638.2025.11403389",
    "source": "IEEE",
    "abstract": "Flexible Multi-State Switch (Soft Open Point, SOP), leveraging power electronic devices, enables continuous power flow regulation and rapid operational state transitions under conditions of high-penetration distributed energy resources and diverse load types. This capability addresses limitations inherent in traditional mechanical switches. However, constrained by the voltage withstand capability and loss characteristics of power electronic devices, medium-voltage SOP implementations necessitate cascading multiple modules to match the required voltage level. This cascading approach results in issues such as a high redundant module configuration rate and suboptimal operating efficiency.The reusing module soft open point (RM-SOP) topology mitigates these drawbacks by reducing the number of cascaded modules through a module reuse strategy. Introducing a novel hybrid modulation strategy for the shared modules, combining square-wave modulation and sinusoidal pulse-width modulation (PWM). This proposed strategy aims to reduce switching losses during modulation and enhance overall system efficiency. Finally, simulation studies are presented to validate the feasibility and correctness of both the proposed control scheme and the modulation strategy."
  },
  {
    "date": "2026-2-27",
    "title": "Spam Email Classification using Bag-of-Words Features and Multilayer Perceptron Neural Networks",
    "authors": "Yessi Jusman, Rifki Asidqiyah, Maryza Intan Rahmawati",
    "publish": "2025 1st International Conference on Emerging Trends in Information Systems and Informatics (ICETISI)",
    "url": "https://doi.org/10.1109/icetisi67983.2025.11405863",
    "source": "IEEE",
    "abstract": "Email has become one of the most widely adopted tools for both personal and professional communication, but its growing reliance has been accompanied by the prevalence of unsolicited messages, commonly referred to as spam. Spam clutters inboxes, reduces productivity, and poses security risks, making effective detection methods increasingly crucial. This study evaluated the performance of multi-layer perceptron (MLP) models trained with two optimization algorithms: One-Step Secant (OSS) and Scaled Conjugate Gradient (SCG). A bag-of-words dataset was utilized, and representative statistical features were analyzed to characterize distinctions between spam and non-spam categories. The MLP was trained using two hidden neuron configurations (5 and 10) to examine the influence of network complexity on performance. Experimental results revealed that SCG consistently outperformed OSS, achieving average accuracies of 92.9% (training), 91.3% (validation), and 92.6% (testing) with 10 hidden neurons. Receiver operating characteristic (ROC) analysis further confirmed the robustness of SCG, demonstrating better tradeoffs between true positive and false positive rates. These findings highlight SCG as a more reliable optimization approach for spam classification."
  },
  {
    "date": "2026-2-27",
    "title": "Capacitor Voltage Reconfiguration and Control Methods of Variable-Level ANPC Inverters",
    "authors": "Jupeng Pang, Chao Wang, Mingzhe Wu, Kui Wang, Zedong Zheng, Yongdong Li",
    "publish": "2025 IEEE 3rd International Power Electronics and Application Symposium (PEAS)",
    "url": "https://doi.org/10.1109/peas66638.2025.11403188",
    "source": "IEEE",
    "abstract": "The growing demand for carbon neutrality has accelerated the deployment of photovoltaic (PV) systems, with centralized architectures becoming the preferred choice for megawatt-scale applications due to their simplicity, efficiency, and cost advantages. As the industry transitions from 1500-V to 2-kV dc systems, conventional inverter topologies encounter critical limitations: high-voltage devices suffers from significant switching losses at low operating voltages, while higher-level topologies increase device count, conduction loss, and system cost. To overcome these challenges, a variable-level (VL) active neutral-point clamped (ANPC) inverter is proposed, enabling efficiency optimization under variable dc-link voltages. This paper focuses on commutation behaviors analyzing and capacitor voltage control for the VL ANPC topology. A dedicated control strategy is developed to balance the side capacitor voltages and stabilize the central capacitor voltage under reconfigured dc-link capacitor voltages. Experimental and simulation results verify the proposed method, demonstrating enhanced efficiency and reliable capacitor voltage regulation for 2-kV PV inverter applications."
  },
  {
    "date": "2026-2-27",
    "title": "Deep Neural Network Watermarking to Detect Backdoor Attacks in Datasets Using Wet Paper Coding",
    "authors": "Annisa Putri, Gelar Budiman, Inung Wijayanto",
    "publish": "2025 1st International Conference on Emerging Trends in Information Systems and Informatics (ICETISI)",
    "url": "https://doi.org/10.1109/icetisi67983.2025.11405914",
    "source": "IEEE",
    "abstract": "Deep Neural Networks (DNNs) in machine learning are vulnerable to backdoor attacks, where attackers insert unauthorized watermarks into the model to conceal specific patterns that can be exploited to manipulate predictions. These attacks can reduce model accuracy and cause misclassification when triggered by specially crafted inputs containing backdoors. To address this issue, this research proposes a watermarking method based on Wet Paper Coding (WPC), embedding watermarks directly into DNN model parameters, and using a Siamese Neural Network (SNN) for verification and backdoor attack detection. The watermark used is an email identifier, ensuring dataset integrity and ownership verification. The embedding process utilizes the Optimized Probabilistic Selection Strategy (OPSS) to select model parameters that have minimal impact on accuracy. WPC embeds the watermark by modifying \"dry blocks\" while preserving \"wet blocks\" to maintain model stability. After embedding, the watermark is extracted and verified using SNN, which compares it against registered email identifiers. If the extracted watermark does not match the authorized list, the model is flagged as potentially compromised by a backdoor attack."
  },
  {
    "date": "2026-2-27",
    "title": "Development of a Gel Urethra Model Simulator Using Agarose-PEG and Performance Evaluation of a Soft Growing Actuator for Urinary Catheter Insertion Assistance",
    "authors": "K. Kishino, R. Sasaki, F. Ito, H. Yamanaka, M. Komeya, T. Nakamura",
    "publish": "2026 IEEE/SICE International Symposium on System Integration (SII)",
    "url": "https://doi.org/10.1109/sii64115.2026.11404606",
    "source": "IEEE",
    "abstract": "This paper proposes a urinary catheter insertion assistance mechanism aimed at reducing pain and the risk of injury during insertion, as well as an agarose–PEG gel urethra model simulator for its performance evaluation. Conventional urinary catheterization has the drawback that friction against the urethral wall and impingement at curved sections can cause severe pain and tissue damage to patients. To address this, we focused on a soft growing actuator that can advance through a lumen without sliding its outer surface, and we developed a urinary catheter insertion assistance mechanism utilizing this actuator. In addition, we newly developed a gel-based urethra model simulator, made of agarose and PEG, capable of reproducing urethral length, diameter, curvature geometry, and Young’s modulus, and used it for performance evaluation of the proposed mechanism. Fundamental property tests confirmed that gel containing 2% agarose and 20% PEG achieved a Young’s modulus (~125 kPa) equivalent to that of the urethra and exhibited high toughness. In insertion experiments using the urethra model simulator, the proposed mechanism demonstrated stable extension and catheter traction even in models with curvature or straight-section stenosis. These results indicate that a urinary catheter insertion assistance mechanism employing a soft growing actuator has the potential to effectively reduce friction and alleviate pain inside the urethra."
  },
  {
    "date": "2026-2-27",
    "title": "Sonar Target Localization and Trajectory Based on Neural Network",
    "authors": "Runze Zhang, Mengyue Sun, Ziteng Huang",
    "publish": "2025 6th International Symposium on Computer Engineering and Intelligent Communications (ISCEIC)",
    "url": "https://doi.org/10.1109/isceic67854.2025.11405532",
    "source": "IEEE",
    "abstract": "Underwater target localization and trajectory tracking are crucial for national defense, particularly for detecting enemy submarines and supporting antisubmarine missions. Traditional sonar systems using beamforming and tracking methods often suffer from limited accuracy and poor performance in complex underwater settings. This paper introduces an adaptive beamforming algorithm based on Radial Basis Function (RBF) neural networks, improving target bearing estimation with an accuracy of 88.89%. By further integrating the CenterNet detection algorithm with the OC-SORT tracking method, target motion estimation is enhanced, achieving an 89.3% detection rate. The proposed approaches were validated through Qiandao Lake trials, yielding high-resolution bearing images and reducing trajectory errors."
  },
  {
    "date": "2026-2-27",
    "title": "Benefits of Automatic Temperature Controller on Human Body and Maintaining Room Temperature",
    "authors": "Micko Stefanus, Nugraha Byru Sapphire, Vincentius Aaron, Mochammad Haldi Widianto",
    "publish": "2025 1st International Conference on Emerging Trends in Information Systems and Informatics (ICETISI)",
    "url": "https://doi.org/10.1109/icetisi67983.2025.11406034",
    "source": "IEEE",
    "abstract": "In this modern era, the rise of earth’s temperature has played a great impact on human body temperature. High temperatures also increase humidity which leads to mold growth and other infrastructure damage. The authors have created a solution for this problem, an IoT-based device to control room temperature automatically in real-time. The device is able to turn the fan on and off the based on the set room temperature. This research result shows how room temperature can be maintained automatically using IoT device. Test concluded by the authors shows that the DHT22 sensor is able to detect surrounding temperature accurately. Allowing the relay to turn the fan on and off automatically when the room temperature is below or above 27 degrees Celsius to regulate the room temperature. Online form was also distributed to gather data from various people to determine the impact of room temperature on the human body which were not included in similar research. Based on the response collected, IoT based automation for controlling room temperature is a viable solution to maintain ideal room temperature. This IoT device efficiency can be increased further by switching the fan to a more advanced cooling device."
  },
  {
    "date": "2026-2-27",
    "title": "Disturbance Suppression Strategy of Intermediate DC-Bus Voltage for Two-stage Grid-connected Inverter",
    "authors": "Biying Ren, Xiangdong Sun, Jie Ma, Xinyu Zhang, Yanping Xu",
    "publish": "2025 IEEE 3rd International Power Electronics and Application Symposium (PEAS)",
    "url": "https://doi.org/10.1109/peas66638.2025.11403731",
    "source": "IEEE",
    "abstract": "The intermediate DC-bus voltage in a two-stage grid-connected inverter is easily affected by disturbances caused by grid-side power fluctuations and switching between grid-connected and off-grid modes. Significant disturbances in the intermediate DC-bus voltage may degrade grid-connected power quality and adversely affect system stability. Therefore, effectively suppressing intermediate DC-bus voltage disturbances has become a critical research topic for two-stage grid-connected inverters. A two-stage grid-connected inverter composed of a dual-active-bridge (DAB) converter cascaded with a three-phase four-leg T-type three-level inverter is taken as the research object, a power feedforward control strategy based on closed-loop voltage control of the DAB converter is proposed to suppress the voltage disturbances on the intermediate DC bus. A mathematical model of the DAB converter under single-phase-shifting control is established, and the relationship between the intermediate DC-bus voltage and the instantaneous grid-connected power on the inverter side is analyzed. By introducing a power feedforward term to compensate for power deficits, the proposed strategy effectively mitigates intermediate DC-bus voltage disturbances and enhances the stability of the cascaded system. Simulation results validate the feasibility and correctness of the control strategy, demonstrating superior disturbance rejection performance compared to the system without power feedforward control."
  },
  {
    "date": "2026-2-27",
    "title": "A Novel High Efficiency Step-up DC auto-Transformer for DC Grid",
    "authors": "Shuxin Luo, Xuantong Zhou, Feng Li, Yanfeng Wang, Hao Yu, Renxin Yang, Jianqiao Zhou, Gang Shi, Jianwen Zhang",
    "publish": "2025 IEEE 3rd International Power Electronics and Application Symposium (PEAS)",
    "url": "https://doi.org/10.1109/peas66638.2025.11403751",
    "source": "IEEE",
    "abstract": "This work presents a novel step-up auto-transformer architecture for direct current networks, engineered for high-efficiency, high-power interconnection of disparate DC grids. The topology integrates an energy transfer arm comprising a full-bridge submodule string, utilizing series-connectable thyristors as switching elements. To maximize the energy storage arm's dynamic controllability, a dedicated control methodology enables trapezoidal current profiling while guaranteeing thyristor commutation security. Comprehensive Matlab/Simulink simulations validate the proposed configuration's operational efficacy and control performance."
  }
]