[
  {
    "date": "2026-02-17",
    "title": "A Content-Based Framework for Cybersecurity Refusal Decisions in Large Language Models",
    "authors": "Meirav Segal, Noa Linder, Omer Antverg, Gil Gekker, Tomer Fichman, Omri Bodenheimer, Edan Maor, Omer Nevo",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.15689v1",
    "source": "arXiv",
    "abstract": "Large language models and LLM-based agents are increasingly used for cybersecurity tasks that are inherently dual-use. Existing approaches to refusal, spanning academic policy frameworks and commercially deployed systems, often rely on broad topic-based bans or offensive-focused taxonomies. As a result, they can yield inconsistent decisions, over-restrict legitimate defenders, and behave brittlely under obfuscation or request segmentation. We argue that effective refusal requires explicitly modeling the trade-off between offensive risk and defensive benefit, rather than relying solely on intent or offensive classification. In this paper, we introduce a content-based framework for designing and auditing cyber refusal policies that makes offense-defense tradeoffs explicit. The framework characterizes requests along five dimensions: Offensive Action Contribution, Offensive Risk, Technical Complexity, Defensive Benefit, and Expected Frequency for Legitimate Users, grounded in the technical substance of the request rather than stated intent. We demonstrate that this content-grounded approach resolves inconsistencies in current frontier model behavior and allows organizations to construct tunable, risk-aware refusal policies."
  },
  {
    "date": "2026-02-17",
    "title": "Distinguishing Schwinger effect from Hawking radiation in Reissner-Nordstr{ö}m black holes via entanglement",
    "authors": "Ruo-Han Wang, Jia-Rui Sun",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.15305v1",
    "source": "arXiv",
    "abstract": "A charged black hole can emit charged particles via two independent mechanisms: the Hawking radiation and the Schwinger effect, which are intertwined in the radiation spectrum. In this paper, we will show that the two effects can be distinguished by analyzing the entanglement entropy carried by the produced particle pairs. Explicitly, we apply the island formula to the near extremal Reissner-Nordstr{ö}m (RN) black hole to calculate the total entanglement entropy of the radiation. Meanwhile we use the heat kernel method to calculate the entanglement entropy of charged particle pairs produced solely from the Schwinger effect. By comparing with the total entanglement entropy, we obtain the entanglement entropy produced purely from the Hawking radiation. Consequently, the two effects are distinguishable in near extremal RN black holes after the Page time. Furthermore, we also employ the brick wall model and the Pauli-Villars regularization to derive the entanglement entropy from the Schwinger effect, which gives a slightly different result with that obtained from the heat kernel method."
  },
  {
    "date": "2026-02-17",
    "title": "Robot-Assisted Social Dining as a White Glove Service",
    "authors": "Atharva S Kashyap, Ugne Aleksandra Morkute, Patricia Alves-Oliveira",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.15767v1",
    "source": "arXiv",
    "abstract": "Robot-assisted feeding enables people with disabilities who require assistance eating to enjoy a meal independently and with dignity. However, existing systems have only been tested in-lab or in-home, leaving in-the-wild social dining contexts (e.g., restaurants) largely unexplored. Designing a robot for such contexts presents unique challenges, such as dynamic and unsupervised dining environments that a robot needs to account for and respond to. Through speculative participatory design with people with disabilities, supported by semi-structured interviews and a custom AI-based visual storyboarding tool, we uncovered ideal scenarios for in-the-wild social dining. Our key insight suggests that such systems should: embody the principles of a white glove service where the robot (1) supports multimodal inputs and unobtrusive outputs; (2) has contextually sensitive social behavior and prioritizes the user; (3) has expanded roles beyond feeding; (4) adapts to other relationships at the dining table. Our work has implications for in-the-wild and group contexts of robot-assisted feeding."
  },
  {
    "date": "2026-02-17",
    "title": "Unforgeable Watermarks for Language Models via Robust Signatures",
    "authors": "Huijia Lin, Kameron Shahabi, Min Jae Song",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.15323v1",
    "source": "arXiv",
    "abstract": "Language models now routinely produce text that is difficult to distinguish from human writing, raising the need for robust tools to verify content provenance. Watermarking has emerged as a promising countermeasure, with existing work largely focused on model quality preservation and robust detection. However, current schemes provide limited protection against false attribution. We strengthen the notion of soundness by introducing two novel guarantees: unforgeability and recoverability. Unforgeability prevents adversaries from crafting false positives, texts that are far from any output from the watermarked model but are nonetheless flagged as watermarked. Recoverability provides an additional layer of protection: whenever a watermark is detected, the detector identifies the source text from which the flagged content was derived. Together, these properties strengthen content ownership by linking content exclusively to its generating model, enabling secure attribution and fine-grained traceability. We construct the first undetectable watermarking scheme that is robust, unforgeable, and recoverable with respect to substitutions (i.e., perturbations in Hamming metric). The key technical ingredient is a new cryptographic primitive called robust (or recoverable) digital signatures, which allow verification of messages that are close to signed ones, while preventing forgery of messages that are far from all previously signed messages. We show that any standard digital signature scheme can be boosted to a robust one using property-preserving hash functions (Boyle, LaVigne, and Vaikuntanathan, ITCS 2019)."
  },
  {
    "date": "2026-02-17",
    "title": "Local Node Differential Privacy",
    "authors": "Sofya Raskhodnikova, Adam Smith, Connor Wagaman, Anatoly Zavyalov",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.15802v1",
    "source": "arXiv",
    "abstract": "We initiate an investigation of node differential privacy for graphs in the local model of private data analysis. In our model, dubbed LNDP, each node sees its own edge list and releases the output of a local randomizer on this input. These outputs are aggregated by an untrusted server to obtain a final output. We develop a novel algorithmic framework for this setting that allows us to accurately answer arbitrary linear queries on a blurry approximation of the input graph's degree distribution. For some natural problems, the resulting algorithms match the accuracy achievable with node privacy in the central model, where data are held and processed by a trusted server. We also prove lower bounds on the error required by LNDP that imply the optimality of our algorithms for several fundamental graph statistics. We then lift these lower bounds to the interactive LNDP setting, demonstrating the optimality of our algorithms even when constantly many rounds of interaction are permitted. Obtaining our lower bounds requires new approaches, since those developed for the usual local model do not apply to the inherently overlapping inputs that arise from graphs. Finally, we prove structural results that reveal qualitative differences between local node privacy and the standard local model for tabular data."
  },
  {
    "date": "2026-02-17",
    "title": "Multi-Objective Coverage via Constraint Active Search",
    "authors": "Zakaria Shams Siam, Xuefeng Liu, Chong Liu",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.15595v1",
    "source": "arXiv",
    "abstract": "In this paper, we formulate the new multi-objective coverage (MOC) problem where our goal is to identify a small set of representative samples whose predicted outcomes broadly cover the feasible multi-objective space. This problem is of great importance in many critical real-world applications, e.g., drug discovery and materials design, as this representative set can be evaluated much faster than the whole feasible set, thus significantly accelerating the scientific discovery process. Existing works cannot be directly applied as they either focus on sample space coverage or multi-objective optimization that targets the Pareto front. However, chemically diverse samples often yield identical objective profiles, and safety constraints are usually defined on the objectives. To solve this MOC problem, we propose a novel search algorithm, MOC-CAS, which employs an upper confidence bound-based acquisition function to select optimistic samples guided by Gaussian process posterior predictions. For enabling efficient optimization, we develop a smoothed relaxation of the hard feasibility test and derive an approximate optimizer. Compared to the competitive baselines, we show that our MOC-CAS empirically achieves superior performances across large-scale protein-target datasets for SARS-CoV-2 and cancer, each assessed on five objectives derived from SMILES-based features."
  },
  {
    "date": "2026-02-17",
    "title": "Optimal detection of planted stars via a random energy model",
    "authors": "Ijay Narang, Will Perkins, Timothy L. H. Wee",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.15585v1",
    "source": "arXiv",
    "abstract": "We study the problem of detecting a planted star in the Erd{ő}s--R{é}nyi random graph $G(n,m)$, formulated as a hypothesis test. We determine the scaling window for critical detection in $m$ in terms of the star size, and characterize the asymptotic total variation distance between the null and alternative hypotheses in this window. In the course of the proofs we show a condensation phase transition in the likelihood ratio that closely resembles that of the random energy model from spin glass theory."
  },
  {
    "date": "2026-02-17",
    "title": "Dust measurements with the Mars Dust Counter on board Nozomi (PLANET-B)",
    "authors": "Harald Krüger, Masanori Kobayashi, Hiroshi Kimura, Tomoko Arai, Hakan Svedhem, Sho Sasaki",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.15576v1",
    "source": "arXiv",
    "abstract": "Nozomi was Japan's first space mission to Mars, launched on 3 July 1998 UT. It was equipped with the Mars Dust Counter (MDC) which was an impact ionisation dust detector. MDC detected 96 dust particle impacts when the spacecraft was in Earth orbit and later in interplanetary space, before its operation ended in April 2002 due to a technical failure on board. We compare the Nozomi dust measurements with the dust measurements obtained with the dust detector on board the Ulysses spacecraft. Impact speeds and masses of dust particles measured by Nozomi MDC are overall consistent with the measurements obtained by Ulysses in the same region of interplanetary space. Based on the impact speeds measured while Nozomi was in Earth orbit, MDC detected neither dust particles of natural origin that were bound to the Earth nor space debris. The dust impact rate measured in interplanetary space varied by approximately a factor of 2, consistent with theoretical predictions by the Interplanetary Meteoroid Engineering Model. The particle impact direction was concentrated towards the ecliptic plane, in agreement with an interplanetary origin of the majority of the measured dust particles. No impacts of cometary trail particles could positively be identified during known cometary trail crossings of Nozomi. The Nozomi dust data may become a valuable reference for the dust measurements to be obtained in the same region of interplanetary space with future space missions like, for example, MMX and DESTINY$^+$."
  },
  {
    "date": "2026-02-17",
    "title": "Urysohn Width and Surgeries",
    "authors": "Aleksandr Berdnikov, Brendan Isley",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.15565v1",
    "source": "arXiv",
    "abstract": "We analyze the behavior of Urysohn width of manifolds under a connected sum operation, specifically, bounding widths of summands in terms of widths of the sum and vice versa. Our methods also apply to the universal covers of these spaces, and to more general type of surgeries. Lastly, we provide examples that show the optimality of constants in our estimates."
  },
  {
    "date": "2026-02-17",
    "title": "Revealing and Enhancing Core Visual Regions: Harnessing Internal Attention Dynamics for Hallucination Mitigation in LVLMs",
    "authors": "Guangtao Lyu, Qi Liu, Chenghao Xu, Jiexi Yan, Muli Yang, Xueting Li, Fen Fang, Cheng Deng",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.15556v1",
    "source": "arXiv",
    "abstract": "LVLMs have achieved strong multimodal reasoning capabilities but remain prone to hallucinations, producing outputs inconsistent with visual inputs or user instructions. Existing training-free methods, including contrastive decoding and auxiliary expert models, which incur several times more computational overhead and may introduce potential interference, as well as static internal signal enhancement, are often vulnerable to the attention sink phenomenon. We find that internal Positive Attention Dynamics (PAD) in LVLMs naturally reveal semantically core visual regions under the distortions of attention sinks. Based on this, we propose Positive Attention Dynamics Enhancement (PADE), a training-free attention intervention that constructs a PAD map to identify semantically core visual regions, applies per-head Median Absolute Deviation Scaling to adaptively control the intervention strength, and leverages System-Token Compensation to maintain attention to complex user instructions and support long-term output consistency. Experiments on multiple LVLMs and benchmarks show that PADE improves visual grounding and reduces hallucinations, validating the effectiveness of leveraging internal attention dynamics for reliable multimodal reasoning."
  },
  {
    "date": "2026-02-17",
    "title": "Tracking Time-Varying Multipath Channels forActive Sonar Applications",
    "authors": "Ashwani Koul, Gustaf Hendeby, Isaac Skog",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.15555v1",
    "source": "arXiv",
    "abstract": "Reliable detection and tracking in active sonar require accurate and efficient learning of the acoustic multipath background environment. Conventionally, background learning is performed after transforming measurements into the range-Doppler domain, a step that is computationally expensive and can obscure phase-coherent structure useful for monitoring and tracking. This paper proposes a framework for learning and tracking the multipath background directly in the raw measurement domain. Starting from a wideband Doppler linearization of the impulse response of a time-varying multipath channel, a state-space model with a heteroscedastic measurement equation is derived. This model enables channel tracking using an extended Kalman filter (EKF), and unknown model parameters are learned from the marginalized likelihood. The statistical adequacy of the proposed models is assessed via a p-value significance test. Finally, this paper integrates the learned channel model into a sequential likelihood-ratio test for target detection. BELLHOP-based simulations show that the proposed model better captures channel dynamics induced by sea-surface fluctuations and transmitter and receiver drift, yielding more reliable detection in time-varying shallow-water environments"
  },
  {
    "date": "2026-02-17",
    "title": "RUVA: Personalized Transparent On-Device Graph Reasoning",
    "authors": "Gabriele Conte, Alessio Mattiace, Gianni Carmosino, Potito Aghilar, Giovanni Servedio, Francesco Musicco, Vito Walter Anelli, Tommaso Di Noia, Francesco Maria Donini",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.15553v1",
    "source": "arXiv",
    "abstract": "The Personal AI landscape is currently dominated by \"Black Box\" Retrieval-Augmented Generation. While standard vector databases offer statistical matching, they suffer from a fundamental lack of accountability: when an AI hallucinates or retrieves sensitive data, the user cannot inspect the cause nor correct the error. Worse, \"deleting\" a concept from a vector space is mathematically imprecise, leaving behind probabilistic \"ghosts\" that violate true privacy. We propose Ruva, the first \"Glass Box\" architecture designed for Human-in-the-Loop Memory Curation. Ruva grounds Personal AI in a Personal Knowledge Graph, enabling users to inspect what the AI knows and to perform precise redaction of specific facts. By shifting the paradigm from Vector Matching to Graph Reasoning, Ruva ensures the \"Right to be Forgotten.\" Users are the editors of their own lives; Ruva hands them the pen. The project and the demo video are available at http://sisinf00.poliba.it/ruva/."
  },
  {
    "date": "2026-02-17",
    "title": "A homogeneous view of asymptotic giant branch carbon stars as seen by Gaia",
    "authors": "Alessio Liberatori, Despina Hatzidimitriou, Konstantinos Antoniadis, Giada Pastorelli, Michele Trabucchi, M. A. T. Groenewegen, Diego Bossini, Leo Girardi, Paola Marigo, Alessandro Bressan, Ioannis N. Kallimanis, Guglielmo Costa, Vasileios Katsis, Georgios Vasilopoulos, Stamatis Chatzipetros",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.15550v1",
    "source": "arXiv",
    "abstract": "Carbon stars on the asymptotic giant branch are major contributors to galactic dust enrichment, with gas mass-loss rates up to 1e-4 Msun/yr. We present a homogeneous spectral energy distribution analysis of the Gaia DR3 Golden Sample of carbon stars in the Milky Way and Magellanic Clouds. Our dataset includes 14,747 sources with multi-band photometry from Gaia, 2MASS, and WISE, combined with recent distance and extinction estimates. For a subsample of 2,494 Mira variables, we model multi-band light curves to derive accurate mean magnitudes. Stellar and circumstellar parameters are obtained by fitting observations with a large grid of synthetic spectra computed with the DUSTY radiative transfer code using COMARCS atmospheres. We derive effective temperature, optical depth, and gas mass-loss rate for each source. The distributions peak around Teff = 3150 K, with mass-loss rates spanning 1e-11 to 1e-4 Msun/yr and inner dust temperatures near 1000 K. We find a correlation between variability amplitude and mass-loss rate. This framework provides a statistically robust view of carbon stars across environments with different metallicities. Apparent environmental dependencies are influenced by luminosity distributions and selection effects rather than purely intrinsic metallicity differences. The combined Gaia and WISE selection limits the detection of both highly obscured and faint Magellanic Cloud sources, but the observed trends remain significant within the sampled populations."
  },
  {
    "date": "2026-02-17",
    "title": "CEPAE: Conditional Entropy-Penalized Autoencoders for Time Series Counterfactuals",
    "authors": "Tomàs Garriga, Gerard Sanz, Eduard Serrahima de Cambra, Axel Brando",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.15546v1",
    "source": "arXiv",
    "abstract": "The ability to accurately perform counterfactual inference on time series is crucial for decision-making in fields like finance, healthcare, and marketing, as it allows us to understand the impact of events or treatments on outcomes over time. In this paper, we introduce a new counterfactual inference approach tailored to time series data impacted by market events, which is motivated by an industrial application. Utilizing the abduction-action-prediction procedure and the Structural Causal Model framework, we first adapt methods based on variational autoencoders and adversarial autoencoders, both previously used in counterfactual literature although not in time series settings. Then, we present the Conditional Entropy-Penalized Autoencoder (CEPAE), a novel autoencoder-based approach for counterfactual inference, which employs an entropy penalization loss over the latent space to encourage disentangled data representations. We validate our approach both theoretically and experimentally on synthetic, semi-synthetic, and real-world datasets, showing that CEPAE generally outperforms the other approaches in the evaluated metrics."
  },
  {
    "date": "2026-02-17",
    "title": "Dynamic Training-Free Fusion of Subject and Style LoRAs",
    "authors": "Qinglong Cao, Yuntian Chen, Chao Ma, Xiaokang Yang",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.15539v1",
    "source": "arXiv",
    "abstract": "Recent studies have explored the combination of multiple LoRAs to simultaneously generate user-specified subjects and styles. However, most existing approaches fuse LoRA weights using static statistical heuristics that deviate from LoRA's original purpose of learning adaptive feature adjustments and ignore the randomness of sampled inputs. To address this, we propose a dynamic training-free fusion framework that operates throughout the generation process. During the forward pass, at each LoRA-applied layer, we dynamically compute the KL divergence between the base model's original features and those produced by subject and style LoRAs, respectively, and adaptively select the most appropriate weights for fusion. In the reverse denoising stage, we further refine the generation trajectory by dynamically applying gradient-based corrections derived from objective metrics such as CLIP and DINO scores, providing continuous semantic and stylistic guidance. By integrating these two complementary mechanisms-feature-level selection and metric-guided latent adjustment-across the entire diffusion timeline, our method dynamically achieves coherent subject-style synthesis without any retraining. Extensive experiments across diverse subject-style combinations demonstrate that our approach consistently outperforms state-of-the-art LoRA fusion methods both qualitatively and quantitatively."
  },
  {
    "date": "2026-02-17",
    "title": "Functional Central Limit Theorem for Stochastic Gradient Descent",
    "authors": "Kessang Flamand, Victor-Emmanuel Brunel",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.15538v1",
    "source": "arXiv",
    "abstract": "We study the asymptotic shape of the trajectory of the stochastic gradient descent algorithm applied to a convex objective function. Under mild regularity assumptions, we prove a functional central limit theorem for the properly rescaled trajectory. Our result characterizes the long-term fluctuations of the algorithm around the minimizer by providing a diffusion limit for the trajectory. In contrast with classical central limit theorems for the last iterate or Polyak-Ruppert averages, this functional result captures the temporal structure of the fluctuations and applies to non-smooth settings such as robust location estimation, including the geometric median."
  },
  {
    "date": "2026-02-17",
    "title": "Reactive Coarse Grained Force Field for Metal-Organic Frameworks applied to Modeling ZIF-8 Self-Assembly",
    "authors": "Sangita Mondal, Cecilia M. S. Alvares, Rocio Semino",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.15534v1",
    "source": "arXiv",
    "abstract": "Decoding the self-assembly mechanism of metal-organic frameworks is a crucial step in reducing trial-and-error tests in their synthesis protocols. Atomistic simulations have proven essential in revealing molecular-level features of MOF nucleation, but they still exhibit limitations in the simulation setups due to size constraints (inability of reaching realistic concentrations or exploring non-stoichiometric metal:ligand ratios). In this contribution, we develop a methodology to derive reactive coarse grained force fields based on multiscale coarse graining methods. We apply our novel methodology to the case of the archetypal zeolitic-imidazolate framework ZIF-8. Our coarse grained force field, which we call nb-CG-ZIF-FF, does not contain any explicit connectivity information, but learns the tetrahedral Zn-connectivity from many body correlations within an atomistic benchmark. nb-CG-ZIF-FF quantitatively reproduces the features of bulk, crystalline ZIF-8 as well as the structural evolution of pre-nucleation species in terms of Zn n-fold coordination populations from the atomistic benchmark. While the range of rings that are formed along the synthesis process are well captured by nb-CG-ZIF-FF, the model cannot exactly reproduce ring populations. Our reactive CG force field fitting approach can be applied to any MOF, opening new research avenues in modeling MOF formation, decomposition, defect dynamics and phase transition processes."
  },
  {
    "date": "2026-02-17",
    "title": "Observing quantum many-body dynamics in emergent curved spacetime using programmable quantum processors",
    "authors": "Brendan Rhyno, Bastien Lapierre, Smitha Vishveshwara, Khadijeh Najafi, Ramasubramanian Chitra",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.15524v1",
    "source": "arXiv",
    "abstract": "We digitally simulate quantum many-body dynamics in emergent curved backgrounds using 80 superconducting qubits on IBM Heron processors. By engineering spatially varying couplings in the spin-$\\frac12$ XXZ chain, consistent with the low energy description of the model in terms of an inhomogeneous Tomonaga-Luttinger liquid, we realize excitations that follow geodesics of an effective metric inherited from the underlying spatial deformation. Following quenches from Néel and few-spin-flip states, we observe curved light-cone propagation, horizon-induced freezing in the local magnetization, and position-dependent oscillation frequencies set by the engineered spatial deformation. Despite strong spatial inhomogeneity, unequal-time correlators reveal ballistic quasiparticle propagation in the spin chain. These results establish large-scale digital quantum processors as a flexible platform for detailed and controlled exploration of many-body dynamics in tunable and synthetic curved spacetimes."
  },
  {
    "date": "2026-02-17",
    "title": "Displacement memory in regular black hole spacetimes",
    "authors": "Ritwik Acharyya, Sayan Kar",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.15523v1",
    "source": "arXiv",
    "abstract": "Displacement memory, induced by a wave pulse in a regular black hole spacetime, is studied using geodesic (timelike) separation and geodesic deviation. The presence of the wave pulse in such a black hole is modeled via a function $H(u)$ appearing in a restricted version of a generic Bondi-Sachs type line element. Choosing a sech-squared profile for $H(u)$, we first study (numerically) geodesic separation and geodesic deviation in a flat background. Thereafter, similar investigations are carried out in the presence of the black hole, but in regions far away from the vicinity of the horizon. Our results suggest the presence of a distinct displacement memory effect, which depends on the value of the regularisation parameter $g$ as well as the pulse height. Between different types of regular black holes, one notices parameter-dependent changes in the net displacement memory. Further, a clear difference in the magnitude of displacement memory (at large $u$) in regular and singular black holes is also visible in our numerical results."
  },
  {
    "date": "2026-02-17",
    "title": "ExpertWeaver: Unlocking the Inherent MoE in Dense LLMs with GLU Activation Patterns",
    "authors": "Ziyu Zhao, Tong Zhu, Zhi Zhang, Tiantian Fan, Jinluan Yang, Kun Kuang, Zhongyu Wei, Fei Wu, Yu Cheng",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.15521v1",
    "source": "arXiv",
    "abstract": "Mixture-of-Experts (MoE) effectively scales model capacity while preserving computational efficiency through sparse expert activation. However, training high-quality MoEs from scratch is prohibitively expensive. A promising alternative is to convert pretrained dense models into sparse MoEs. Existing dense-to-MoE methods fall into two categories: \\textbf{dynamic structural pruning} that converts dense models into MoE architectures with moderate sparsity to balance performance and inference efficiency, and \\textbf{downcycling} approaches that use pretrained dense models to initialize highly sparse MoE architectures. However, existing methods break the intrinsic activation patterns within dense models, leading to suboptimal expert construction. In this work, we argue that the Gated Linear Unit (GLU) mechanism provides a natural blueprint for dense-to-MoE conversion. We show that the fine-grained neural-wise activation patterns of GLU reveal a coarse-grained structure, uncovering an inherent MoE architecture composed of consistently activated universal neurons and dynamically activated specialized neurons. Leveraging this discovery, we introduce ExpertWeaver, a training-free framework that partitions neurons according to their activation patterns and constructs shared experts and specialized routed experts with layer-adaptive configurations. Our experiments demonstrate that ExpertWeaver significantly outperforms existing methods, both as a training-free dynamic structural pruning technique and as a downcycling strategy for superior MoE initialization."
  },
  {
    "date": "2026-02-17",
    "title": "The space of marked Dyer systems, monotonicity, and continuity of growth rates",
    "authors": "Tomoshige Yukita",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.15518v1",
    "source": "arXiv",
    "abstract": "The space $\\mathcal{G}_n$ of $n$-marked groups provides a natural framework for studying algebraic and geometric invariants under deformation. In general, the growth rate is not continuous on $\\mathcal{G}_n$. In this paper, we investigate the subspace $\\mathcal{D}_n \\subset \\mathcal{G}_n$ consisting of $n$-marked Dyer systems, which extend Coxeter systems and include graph products of cyclic groups and right-angled Artin groups. We prove that $\\mathcal{D}_n$ is closed in $\\mathcal{G}_n$ and introduce a natural partial order on $\\mathcal{D}_n$ with respect to which the growth rate is monotonically increasing. As a consequence, the growth rate function $τ: \\mathcal{D}_n \\to \\mathbb{R}_{\\geq 1}$ is continuous. The proof combines the solution to the word problem for Dyer systems by Paris and Soergel, the parabolic growth formula by Paris and Varghese, and analytic arguments based on normal convergence and Hurwitz's theorem. This extends the continuity results known for Coxeter systems to the broader class of Dyer systems."
  },
  {
    "date": "2026-02-17",
    "title": "On the Geometric Coherence of Global Aggregation in Federated GNN",
    "authors": "Chethana Prasad Kabgere, Shylaja SS",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.15510v1",
    "source": "arXiv",
    "abstract": "Federated Learning (FL) enables distributed training across multiple clients without centralized data sharing, while Graph Neural Networks (GNNs) model relational data through message passing. In federated GNN settings, client graphs often exhibit heterogeneous structural and propagation characteristics. When standard aggregation mechanisms are applied to such heterogeneous updates, the global model may converge numerically while exhibiting degraded relational behavior.Our work identifies a geometric failure mode of global aggregation in Cross- Domain Federated GNNs. Although GNN parameters are numerically represented as vectors, they encode relational transformations that govern the direction, strength, and sensitivity of information flow across graph neighborhoods. Aggregating updates originating from incompatible propagation regimes can therefore introduce destructive interference in this transformation space.This leads to loss of coherence in global message passing. Importantly, this degradation is not necessarily reflected in conventional metrics such as loss or accuracy.To address this issue, we propose GGRS (Global Geometric Reference Structure), a server-side framework that regulates client updates prior to aggregation based on geometric admissibility criteria. GGRS preserves directional consistency of relational transformations as well as maintains diversity of admissible propagation subspaces. It also stabilizes sensitivity to neighborhood interactions, without accessing client data or graph topology. Experiments on heterogeneous GNN-native, Amazon Co-purchase datasets demonstrate that GGRS preserves global message-passing coherence across training rounds by highlighting the necessity of geometry-aware regulation in federated graph learning."
  },
  {
    "date": "2026-02-17",
    "title": "LuxMT Technical Report",
    "authors": "Nils Rehlinger",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.15506v1",
    "source": "arXiv",
    "abstract": "We introduce LuxMT, a machine translation system based on Gemma 3 27B and fine-tuned for translation from Luxembourgish (LB) into French (FR) and English (EN). To assess translation performance, we construct a novel benchmark covering LB-FR, LB-EN, and LB-FR using human-translated data from Luci, a tourist magazine about Luxembourg. Training data stems from LuxAlign, a parallel corpus of multilingual Luxembourgish news articles, and LB parliamentary transcripts augmented with Google Translate. We filter the data using LuxEmbedder, LB sentence embeddings, to remove low-equivalence segment-pairs. Overall, LuxMT's results suggest strong improvements over the Gemma 3 baseline, even for translating LB to German (DE), despite the training data not containing any DE. We also explore LuxEmbedder's potential to be used as a quality estimation metric and find strong correlations with other reference-based metrics. However, we call for further research to fully assess the metric's utility and advise using it with caution."
  },
  {
    "date": "2026-02-17",
    "title": "Scaling solutions in three-form cosmology",
    "authors": "Vitor da Fonseca, Bruno J. Barros, Tiago Barreiro, Nelson J. Nunes",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.15498v1",
    "source": "arXiv",
    "abstract": "A hybrid three-form model of dark energy is developed in order to identify scaling solutions, a long-sought feature in three-form cosmology. Exploiting Hodge dualities, the theory is formulated in terms of two scalar functions that are associated with the conjugate momentum, and the three-form dual vector in an isotropic background. The resulting Lagrangian yields a stable scaling attractor where the three-form energy density tracks the dominant background fluid. A dynamical mechanism is also identified that naturally drives the system out of this regime toward a late-time accelerated phase distinguishable from a cosmological constant. This constitutes the first realization of scaling behavior within a three-form dark energy framework."
  },
  {
    "date": "2026-02-17",
    "title": "Polynomial-time isomorphism test for $k$-generated extensions of abelian groups",
    "authors": "Saveliy V. Skresanov",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.15497v1",
    "source": "arXiv",
    "abstract": "The group isomorphism problem asks whether two finite groups given by their Cayley tables are isomorphic or not. Although there are polynomial-time algorithms for some specific group classes, the best known algorithm for testing isomorphism of arbitrary groups of order $ n $ has time complexity $ n^{O(\\log n)} $. We consider the group isomorphism problem for some extensions of abelian groups by $ k $-generated groups for bounded $ k $. In particular, we prove that one can decide isomorphism of abelian-by-cyclic extensions in polynomial time, generalizing a 2009 result of Le Gall for coprime extensions. As another application, we give a polynomial-time isomorphism test for abelian-by-simple group extensions, generalizing a 2017 result of Grochow and Qiao for central extensions. The main novelty of the proof is a polynomial-time algorithm for computing the unit group of a finite ring, which might be of independent interest."
  },
  {
    "date": "2026-02-17",
    "title": "Generalized Geometric Brownian motion and the Infinite Ergodicity concept",
    "authors": "S. Giordano, R. Blossey",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.15494v1",
    "source": "arXiv",
    "abstract": "We investigate stochastic processes that generalize geometric Brownian motion, focusing on cases where the standard invariant measure, i.e. the solution of the stationary Fokker-Planck equation does not necessarily exist. We demonstrate that the existence of such a measure depends sensitively on the structure of the drift and diffusion terms, as well as on the chosen discretization scheme of the underlying stochastic dynamics. To ground our discussion, we draw motivation from phenomenological models in statistical theories of turbulence, where geometric Brownian motion serves as a classical example. To address situations where the standard invariant measure fails to exist, we heuristically explore the concept of infinite ergodicity, a notion recently introduced in the context of statistical physics for drift-diffusion stochastic processes."
  },
  {
    "date": "2026-02-17",
    "title": "Efficient Approximate Nearest Neighbor Search under Multi-Attribute Range Filter",
    "authors": "Yuanhang Yu, Dawei Cheng, Ying Zhang, Lu Qin, Wenjie Zhang, Xuemin Lin",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.15488v1",
    "source": "arXiv",
    "abstract": "Nearest neighbor search on high-dimensional vectors is fundamental in modern AI and database systems. In many real-world applications, queries involve constraints on multiple numeric attributes, giving rise to range-filtering approximate nearest neighbor search (RFANNS). While there exist RFANNS indexes for single-attribute range predicates, extending them to the multi-attribute setting is nontrivial and often ineffective. In this paper, we propose KHI, an index for multi-attribute RFANNS that combines an attribute-space partitioning tree with HNSW graphs attached to tree nodes. A skew-aware splitting rule bounds the tree height by $O(\\log n)$, and queries are answered by routing through the tree and running greedy search on the HNSW graphs. Experiments on four real-world datasets show that KHI consistently achieves high query throughput while maintaining high recall. Compared with the state-of-the-art RFANNS baseline, KHI improves QPS by $2.46\\times$ on average and up to $16.22\\times$ on the hard dataset, with larger gains for smaller selectivity, larger $k$, and higher predicate cardinality."
  },
  {
    "date": "2026-02-17",
    "title": "How to Detect Information Voids Using Longitudinal Data from Social Media and Web Searches",
    "authors": "Irene Scalco, Francesco Gesualdo, Roy Cerqueti, Matteo Cinelli",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.15476v1",
    "source": "arXiv",
    "abstract": "The model of the attention economy, where content producers compete for the attention of users, relies on two key forces: information supply and demand. This study leverages the feedback loop between these forces to develop a method for detecting and quantifying information voids, i.e., periods in which little or no reliable information is available on a given topic. Using a case study on COVID-19 vaccines rollout in six European countries, and drawing on data from multiple platforms including Facebook, Google, Twitter, Wikipedia, and online news outlets, we examine how information voids emerge, persist and correlate with a decline in the proportion of high-quality information circulating online. By conceptualising information voids as a specific regime of information spreading, we also quantify their counterpart, information overabundance, which constitute a central component of the current definition of infodemic. We show that information voids are associated with a higher prevalence of misinformation, thus representing problematic hotspots in which individuals are more likely to be misled by low-quality online content. Overall, our findings provide empirical support for the inclusion of information voids in mechanistic explanations of misinformation emergence."
  },
  {
    "date": "2026-02-17",
    "title": "Coronal Non-Thermal and Doppler Plasma Flows Driven by Photospheric Flux in 28 Active Regions",
    "authors": "James McKevitt, Sarah Matthews, Deborah Baker, Hamish A. S. Reid, David H. Brooks, Ignacio Ugarte-Urra, Peter R. Young, Teodora Mihailescu",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.15475v1",
    "source": "arXiv",
    "abstract": "Magnetohydrodynamic (MHD) waves and/or the braiding of magnetic field lines are largely thought to be responsible for heating the solar corona, both being mechanisms which are driven by the Sun's photospheric magnetic field. Recent modelling work leads us to expect that such heating mechanisms would be seen in the excess broadening (non-thermal velocity) of coronal spectral emission lines and that larger magnitudes of photospheric magnetic flux would generate more heating, but a direct connection between magnetic flux and spectral line broadening has been difficult to establish. We combine measurements of the photospheric magnetic field from SDO/HMI and non-thermal velocity in log T~6.2 coronal plasma from Hinode/EIS for 28 active regions and find a moderate correlation between the two exists in quiescent active regions, consistent with the photospheric field injecting upward Poynting flux into the solar corona and causing coronal heating. We find that no strong correlation with coronal composition makes it difficult to distinguish between MHD wave heating and magnetic field braiding heating using these diagnostics with current instrumentation."
  },
  {
    "date": "2026-02-17",
    "title": "Conformal Metrics on the Disk with Prescribed Negative Gaussian Curvature and Boundary Geodesic Curvature",
    "authors": "Rafael López-Soriano, Francisco J. Reyes-Sánchez, David Ruiz",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.15471v1",
    "source": "arXiv",
    "abstract": "We study the problem of prescribing the Gaussian curvature on the disk and the geodesic curvature on its boundary via a conformal change of the metric. In this paper the case of negative Gaussian curvature is treated, a regime for which the bubbling behavior of approximate solutions is not so well understood. This is due to the possible appearance of blow-up solutions with diverging length and area. We give an existence result under assumptions on the curvatures which are somewhat natural, in view of some obstructions inherent to the problem. Our strategy is variational and relies on the study of certain families of approximated problems. By performing a refined blow-up analysis for solutions with bounded Morse index, we conclude compactness."
  },
  {
    "date": "2026-02-17",
    "title": "Electric-field-tuned consecutive topological phase transitions between distinct correlated insulators in moire MoTe2/WSe2 heterobilayer",
    "authors": "Xumin Chang, Zui Tao, Bowen Shen, Wanghao Tian, Jenny Hu, Kateryna Pistunova, Kenji Watanabe, Takashi Taniguchi, Tony F. Heinz, Tingxin Li, Kin Fai Mak, Jie Shan, Shengwei Jiang",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.15466v1",
    "source": "arXiv",
    "abstract": "Consecutive topological phase transitions (TPTs) between strongly correlated electronic phases that differ simultaneously in symmetry breaking and topological order are of fundamental interest in condensed matter physics, yet are rarely realized experimentally. We report two consecutive electric-field-driven TPTs at half filling (nu = 1) in angle-aligned MoTe2/WSe2 moire heterobilayers. With increasing out-of-plane displacement field, a geometrically frustrated Mott insulator evolves into a ferromagnetic quantum anomalous Hall (QAH) Mott insulator, i.e., a spin-polarized topological Mott insulator without an observable charge-gap closure, and subsequently into an antiferromagnetic, valley-coherent Mott insulator (VC-AFM) accompanied by a continuous charge-gap collapse and the emergence of a critical metallic state. Layer-resolved magnetic circular dichroism (MCD), magneto-transport, and compressibility measurements jointly determine the phase diagram. The high-field evolution of the antiferromagnetic state reveals a metamagnetic-like transition at a critical field B*, above which a Chern insulating transport response reappears. Our results establish the MoTe2/WSe2 moire platform as a tunable realization of an extended Kane-Mele-Hubbard model hosting sequential correlation-topology-intertwined transitions."
  },
  {
    "date": "2026-02-17",
    "title": "Hydrostatic Pressure-enhanced correlated magnetism and Chern insulator in moir'e WSe2",
    "authors": "Pengfei Jiao, Chenghao Qian, Ning Mao, Xumin Chang, Jiayong Xiao, Feng Liu, Shaozheng Wang, Xiaokai Wu, Di Peng, Cheng Xu, Hongliang Dong, Yuchen Zheng, Juncai Wu, Tong Zheng, Kenji Watanabe, Takashi Taniguchi, Jinfeng Jia, Xiaoxue Liu, Zhiwen Shi, Shiyong Wang, Guorui Chen, Tingxin Li, Ruidan Zhong, Yang Zhang, Dong Qian, Zhiqiang Chen, Shengwei Jiang",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.15465v1",
    "source": "arXiv",
    "abstract": "Moiré semiconductors offer flat bands where Coulomb interactions and band topology intertwine, while interlayer coupling plays a central role in forming the moiré potential. However, limited interlayer coupling strength and the lack of efficient tuning methods hinder further exploration of correlated phenomena in moiré semiconductors. Here we introduce a cryogenic dual-gated diamond-anvil platform using helium as a pressure medium, enabling reversible hydrostatic tuning together with magneto-optical spectroscopy in twisted bilayer WSe2. Pressure enhances the moiré potential, redshifts excitons, and stabilizes Stoner ferromagnetism otherwise absent at a 3.1-degree twist. Simultaneously, the half-filled C = 1 Chern insulating state strengthens, exhibiting a reduced saturation field. Moreover, we observe a topological phase transition from a Chern insulator to a Mott insulator at around 2 GPa. First-principles calculations reveal that a Gamma-to-K valence-band-maximum switching drives this transition by converting an Ising-like topological K-valley miniband into a spin-degenerate trivial Gamma miniband. Our findings demonstrate hydrostatic pressure as a powerful, continuous control axis for correlated magnetism and topological band engineering in moiré materials."
  },
  {
    "date": "2026-02-17",
    "title": "Subgroups with all finite lifts isomorphic are conjugate",
    "authors": "Ido Karshon, Alexander Lubotzky, D. B. McReynolds, Alan W. Reid, Mark Shusterman",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.15463v1",
    "source": "arXiv",
    "abstract": "We show that for non-conjugate subgroups $G_1$ and $G_2$ of a finite group $G$ there exists an extension of $G$ (by a finite group) in which the pre-images of $G_1$ and $G_2$ are not isomorphic. This allows us to show that $\\mathbb Z$-coset equivalent subgroups of a finite group are not necessarily isomorphic, answering a question of Dipendra Prasad. We also indicate connections to profinite rigidity, anabelian geometry, mapping class groups, and non-arithmetic lattices in Lie groups."
  },
  {
    "date": "2026-02-17",
    "title": "A Universal Neural Receiver that Learns at the Speed of Wireless",
    "authors": "Lingjia Liu, Lizhong Zheng, Yang Yi, Robert Calderbank",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.15458v1",
    "source": "arXiv",
    "abstract": "Today we design wireless networks using mathematical models that govern communication in different propagation environments. We rely on measurement campaigns to deliver parametrized propagation models, and on the 3GPP standards process to optimize model-based performance, but as wireless networks become more complex this model-based approach is losing ground. Mobile Network Operators (MNOs) are counting on Artificial Intelligence (AI) to transform wireless by increasing spectral efficiency, reducing signaling overhead, and enabling continuous network innovation through software upgrades. They may also be interested in new use cases like integrated sensing and communications (ISAC). All we need is an AI-native physical layer, so why not simply tailor the offline AI algorithms that have revolutionized image and natural language processing to the wireless domain? We argue that these algorithms rely on off-line training that is precluded by the sub-millisecond speeds at which the wireless interference environment changes. We present an alternative architecture, a universal neural receiver based on convolution, which governs transmit and receive signal processing of any signal in any part of the wireless spectrum. Our neural receiver is designed to invert convolution, and we separate the question of which convolution to invert from the actual deconvolution. The neural network that performs deconvolution is very simple, and we configure this network by setting weights based on domain knowledge. By telling our neural network what we know, we avoid extensive offline training. By developing a universal receiver, we hope to simplify discussions about the proper choice of waveform for different use cases in the international standards. Since the receiver architecture is largely independent of technologies introduced at the base station, we hope to increase the rate of innovation in wireless."
  },
  {
    "date": "2026-02-17",
    "title": "In Agents We Trust, but Who Do Agents Trust? Latent Source Preferences Steer LLM Generations",
    "authors": "Mohammad Aflah Khan, Mahsa Amani, Soumi Das, Bishwamittra Ghosh, Qinyuan Wu, Krishna P. Gummadi, Manish Gupta, Abhilasha Ravichander",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.15456v1",
    "source": "arXiv",
    "abstract": "Agents based on Large Language Models (LLMs) are increasingly being deployed as interfaces to information on online platforms. These agents filter, prioritize, and synthesize information retrieved from the platforms' back-end databases or via web search. In these scenarios, LLM agents govern the information users receive, by drawing users' attention to particular instances of retrieved information at the expense of others. While much prior work has focused on biases in the information LLMs themselves generate, less attention has been paid to the factors that influence what information LLMs select and present to users. We hypothesize that when information is attributed to specific sources (e.g., particular publishers, journals, or platforms), current LLMs exhibit systematic latent source preferences- that is, they prioritize information from some sources over others. Through controlled experiments on twelve LLMs from six model providers, spanning both synthetic and real-world tasks, we find that several models consistently exhibit strong and predictable source preferences. These preferences are sensitive to contextual framing, can outweigh the influence of content itself, and persist despite explicit prompting to avoid them. They also help explain phenomena such as the observed left-leaning skew in news recommendations in prior work. Our findings advocate for deeper investigation into the origins of these preferences, as well as for mechanisms that provide users with transparency and control over the biases guiding LLM-powered agents."
  },
  {
    "date": "2026-02-17",
    "title": "Perturbative calculations of nucleon-deuteron elastic scattering in chiral effective field theory",
    "authors": "Lin Zuo, Wendi Chen, Dan-Yang Pang, Bingwei Long",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.15453v1",
    "source": "arXiv",
    "abstract": "We develop a framework for calculating nucleon-deuteron scattering using strict perturbation theory for treating subleading interactions in chiral effective field theory (ChEFT). Rather than using direct evaluations in the distorted-wave expansion, our approach solves a hierarchy of integral equations to obtain subleading scattering amplitudes. A benchmark with the wave packet continuum-discretization is performed. This framework benefits from the fact that the renormalization-group invariance chiral forces involves only a limited number of two-body partial waves at leading order. We use it to calculate nucleon-deuteron elastic scattering differential cross sections and analyzing powers up to next-to-leading order."
  },
  {
    "date": "2026-02-17",
    "title": "Molecular Design beyond Training Data with Novel Extended Objective Functionals of Generative AI Models Driven by Quantum Annealing Computer",
    "authors": "Hayato Kunugi, Mohsen Rahmani, Yosuke Iyama, Yutaro Hirono, Akira Suma, Matthew Woolway, Vladimir Vargas-Calderón, William Kim, Kevin Chern, Mohammad Amin, Masaru Tateno",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.15451v1",
    "source": "arXiv",
    "abstract": "Deep generative modeling to stochastically design small molecules is an emerging technology for accelerating drug discovery and development. However, one major issue in molecular generative models is their lower frequency of drug-like compounds. To resolve this problem, we developed a novel framework for optimization of deep generative models integrated with a D-Wave quantum annealing computer, where our Neural Hash Function (NHF) presented herein is used both as the regularization and binarization schemes simultaneously, of which the latter is for transformation between continuous and discrete signals of the classical and quantum neural networks, respectively, in the error evaluation (i.e., objective) function. The compounds generated via the quantum-annealing generative models exhibited higher quality in both validity and drug-likeness than those generated via the fully-classical models, and was further indicated to exceed even the training data in terms of drug-likeness features, without any restraints and conditions to deliberately induce such an optimization. These results indicated an advantage of quantum annealing to aim at a stochastic generator integrated with our novel neural network architectures, for the extended performance of feature space sampling and extraction of characteristic features in drug design."
  },
  {
    "date": "2026-02-17",
    "title": "The First Instrumentally Documented Fall of an Iron Meteorite: atmospheric trajectory and ground impact",
    "authors": "Jarmo Moilanen, Maria Gritsevich, Jaakko Visuri",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.15440v1",
    "source": "arXiv",
    "abstract": "Iron meteorite falls are rare compared to stony meteorites, and until recently no iron meteorite had a reliably determined pre-atmospheric orbit. This changed on 2020 November 7, when a bright fireball was observed across Sweden and neighboring regions, with optical, acoustic, and seismic detections extending up to 665 km from the trajectory. After a month-long recovery effort, a 13.8 kg iron meteorite was discovered near Ådalen, representing the first instrumentally recorded and recovered fall of its type and the first iron meteorite with a derivable heliocentric orbit; the event also exhibited the lowest terminal height measured for a well-documented fireball. We combine optical, infrasound, and seismic data to reconstruct the luminous trajectory and employ a Monte Carlo model to simulate the dark flight phase and predicted strewn field, while also investigating the plausibility of a ricochet prior to final deposition. Our analysis identifies distinct aerodynamic properties of iron meteoroids compared to stony bodies, including the influence of streamlined shapes and deep regmaglypts on drag and flight stability, underscoring the need to incorporate iron-specific parameters into entry models to constrain atmospheric dynamics and improve recovery predictions for future events."
  },
  {
    "date": "2026-02-17",
    "title": "Measuring Social Integration Through Participation: Categorizing Organizations and Leisure Activities in the Displaced Karelians Interview Archive using LLMs",
    "authors": "Joonatan Laato, Veera Schroderus, Jenna Kanerva, Jenni Kauppi, Virpi Lummaa, Filip Ginter",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.15436v1",
    "source": "arXiv",
    "abstract": "Digitized historical archives make it possible to study everyday social life on a large scale, but the information extracted directly from text often does not directly allow one to answer the research questions posed by historians or sociologists in a quantitative manner. We address this problem in a large collection of Finnish World War II Karelian evacuee family interviews. Prior work extracted more than 350K mentions of leisure time activities and organizational memberships from these interviews, yielding 71K unique activity and organization names -- far too many to analyze directly. We develop a categorization framework that captures key aspects of participation (the kind of activity/organization, how social it typically is, how regularly it happens, and how physically demanding it is). We annotate a gold-standard set to allow for a reliable evaluation, and then test whether large language models can apply the same schema at scale. Using a simple voting approach across multiple model runs, we find that an open-weight LLM can closely match expert judgments. Finally, we apply the method to label the 350K entities, producing a structured resource for downstream studies of social integration and related outcomes."
  },
  {
    "date": "2026-02-17",
    "title": "Fano varieties with split tangent sheaf",
    "authors": "Andreas Höring",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.15427v1",
    "source": "arXiv",
    "abstract": "Let $X$ be a mildly singular Fano variety such that the tangent sheaf is a direct sum. We show that the direct factors are algebraically integrable, so the infinitesimal decomposition induces a product structure on a quasi-étale cover of $X$."
  },
  {
    "date": "2026-02-17",
    "title": "Particle production, absorption, scattering, and geodesics in a Schwarzschild--Hernquist black hole",
    "authors": "N. Heidari, A. A. Araújo Filho, P. H. M. Barros",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.15420v1",
    "source": "arXiv",
    "abstract": "We investigate quantum and classical signatures of a Schwarzschild black hole embedded in a Hernquist dark matter halo. Starting from the exact spherically symmetric solution describing this composite system, we analyze particle production for both bosonic and fermionic fields using semiclassical techniques. Hawking radiation is derived through Bogoliubov transformations and independently via the tunneling method with energy conservation, allowing us to identify the effective temperature, emission spectrum, and the role of dark matter parameters in suppressing particle creation. The evaporation process is examined in the high-frequency regime, leading to modified evaporation times and emission rates relative to the vacuum Schwarzschild case. We further study absorption and scattering of massless scalar waves employing a partial-wave analysis, computing phase shifts, partial and total cross sections, and assessing the impact of the Hernquist scale radius and density on these observables. Finally, null and timelike geodesics are explored to characterize light propagation and particle motion in the presence of the dark matter halo."
  },
  {
    "date": "2026-02-17",
    "title": "A Robust Truncated-Domain Approach for Cone--Jet Simulations in Electrospinning and Electrospraying",
    "authors": "Ghanashyam K. C., Satyavrata Samavedi, Harish N Dixit",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.15416v1",
    "source": "arXiv",
    "abstract": "Direct numerical simulations of electrospinning and electrospraying are computationally demanding due to large-scale separation between the needle and the tip-to-collector distance. The cone-jet mode that occurs in the vicinity of the needle arises from a delicate balance between surface tension, viscous stresses, inertia, and electric stresses. This mode has a central role in determining the subsequent instabilities of the jet and the eventual outcomes on the collector. Truncated-domain simulations offer a viable alternative but depend critically on the accuracy of far-field electrostatic boundary conditions. Existing truncated-domain approaches based on analytical expressions for the electric potential systematically underestimate the electric field near the needle tip and require empirical tuning informed by prior experiments or full-domain simulations, thereby limiting their predictive capability. Here, we present a general truncated-domain framework for electrohydrodynamic (EHD) simulations of the cone-jet mode that avoids these limitations. Our approach exploits inexpensive full-domain electrostatic simulations to obtain the exact electric field and potential distributions near the needle, which are then imposed as boundary conditions in an EHD simulation carried out on a truncated domain. Comparisons with full-domain EHD simulations and experimental data demonstrate that the proposed approach accurately reproduces cone-jet shapes as well as key physical quantities, including electric currents, charge distributions, velocity fields, and Maxwell stresses, while converging at substantially smaller domain sizes. The formulation eliminates tunable parameters, does not require prior knowledge of the cone-jet configuration, and significantly reduces computational cost, providing a reliable and predictive framework for studying electrohydrodynamic cone-jet flows."
  },
  {
    "date": "2026-02-17",
    "title": "Social Life of Code: Modeling Evolution through Code Embedding and Opinion Dynamics",
    "authors": "Yulong He, Nikita Verbin, Sergey Kovalchuk",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.15412v1",
    "source": "arXiv",
    "abstract": "Software repositories provide a detailed record of software evolution by capturing developer interactions through code-related activities such as pull requests and modifications. To better understand the underlying dynamics of codebase evolution, we introduce a novel approach that integrates semantic code embeddings with opinion dynamics theory, offering a quantitative framework to analyze collaborative development processes. Our approach begins by encoding code snippets into high-dimensional vector representations using state-of-the-art code embedding models, preserving both syntactic and semantic features. These embeddings are then processed using Principal Component Analysis (PCA) for dimensionality reduction, with data normalized to ensure comparability. We model temporal evolution using the Expressed-Private Opinion (EPO) model to derive trust matrices and track opinion trajectories across development cycles. These opinion trajectories reflect the underlying dynamics of consensus formation, influence propagation, and evolving alignment (or divergence) within developer communities -- revealing implicit collaboration patterns and knowledge-sharing mechanisms that are otherwise difficult to observe. By bridging software engineering and computational social science, our method provides a principled way to quantify software evolution, offering new insights into developer influence, consensus formation, and project sustainability. We evaluate our approach on data from three prominent open-source GitHub repositories, demonstrating its ability to reveal interpretable behavioral trends and variations in developer interactions. The results highlight the utility of our framework in improving open-source project maintenance through data-driven analysis of collaboration dynamics."
  },
  {
    "date": "2026-02-17",
    "title": "Residue-Enhanced Pion-Rho Mixing as the Origin of Nonmonotonic Charged Pion Mass in Magnetic Fields",
    "authors": "Ziyue Wang",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.15410v1",
    "source": "arXiv",
    "abstract": "We identify the dynamical origin of the non-monotonic magnetic field dependence of the charged pion mass observed in lattice QCD. Using a near-pole effective action derived from the SU(2) Nambu--Jona-Lasinio model, we show that the lowest Landau level charged pion mixes with the longitudinally polarized charged rho meson, which shares the same quantum numbers in a magnetic background. This mixing, generated by quark-loop polarization and a gauge-invariant tree-level operator matched to the vacuum decay $ρ^\\pm\\rightarrowπ^\\pmγ$, induces strong level repulsion. Crucially, this effect is dynamically amplified by a rapid suppression of the rho-meson wave function renormalization near the pole. As a result, the lower eigenmode exhibits a turnover as the magnetic field increases. The mechanism is analogous to singlet-triplet mixing in positronium and provides a natural explanation for the lattice results. Such effects are expected to be generic for charged mesons in magnetic fields when symmetry allowed mixing and near-pole residue suppression are present."
  },
  {
    "date": "2026-02-17",
    "title": "Joint Enhancement and Classification using Coupled Diffusion Models of Signals and Logits",
    "authors": "Gilad Nurko, Roi Benita, Yehoshua Dissen, Tomohiro Nakatani, Marc Delcroix, Shoko Araki, Joseph Keshet",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.15405v1",
    "source": "arXiv",
    "abstract": "Robust classification in noisy environments remains a fundamental challenge in machine learning. Standard approaches typically treat signal enhancement and classification as separate, sequential stages: first enhancing the signal and then applying a classifier. This approach fails to leverage the semantic information in the classifier's output during denoising. In this work, we propose a general, domain-agnostic framework that integrates two interacting diffusion models: one operating on the input signal and the other on the classifier's output logits, without requiring any retraining or fine-tuning of the classifier. This coupled formulation enables mutual guidance, where the enhancing signal refines the class estimation and, conversely, the evolving class logits guide the signal reconstruction towards discriminative regions of the manifold. We introduce three strategies to effectively model the joint distribution of the input and the logit. We evaluated our joint enhancement method for image classification and automatic speech recognition. The proposed framework surpasses traditional sequential enhancement baselines, delivering robust and flexible improvements in classification accuracy under diverse noise conditions."
  },
  {
    "date": "2026-02-17",
    "title": "One Agent to Guide Them All: Empowering MLLMs for Vision-and-Language Navigation via Explicit World Representation",
    "authors": "Zerui Li, Hongpei Zheng, Fangguo Zhao, Aidan Chan, Jian Zhou, Sihao Lin, Shijie Li, Qi Wu",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.15400v1",
    "source": "arXiv",
    "abstract": "A navigable agent needs to understand both high-level semantic instructions and precise spatial perceptions. Building navigation agents centered on Multimodal Large Language Models (MLLMs) demonstrates a promising solution due to their powerful generalization ability. However, the current tightly coupled design dramatically limits system performance. In this work, we propose a decoupled design that separates low-level spatial state estimation from high-level semantic planning. Unlike previous methods that rely on predefined, oversimplified textual maps, we introduce an interactive metric world representation that maintains rich and consistent information, allowing MLLMs to interact with and reason on it for decision-making. Furthermore, counterfactual reasoning is introduced to further elicit MLLMs' capacity, while the metric world representation ensures the physical validity of the produced actions. We conduct comprehensive experiments in both simulated and real-world environments. Our method establishes a new zero-shot state-of-the-art, achieving 48.8\\% Success Rate (SR) in R2R-CE and 42.2\\% in RxR-CE benchmarks. Furthermore, to validate the versatility of our metric representation, we demonstrate zero-shot sim-to-real transfer across diverse embodiments, including a wheeled TurtleBot 4 and a custom-built aerial drone. These real-world deployments verify that our decoupled framework serves as a robust, domain-invariant interface for embodied Vision-and-Language navigation."
  },
  {
    "date": "2026-02-17",
    "title": "Hybrid F' and ROS2 Architecture for Vision-Based Autonomous Flight: Design and Experimental Validation",
    "authors": "Abdelrahman Metwally, Monijesu James, Aleksey Fedoseev, Miguel Altamirano Cabrera, Dzmitry Tsetserukou, Andrey Somov",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.15398v1",
    "source": "arXiv",
    "abstract": "Autonomous aerospace systems require architectures that balance deterministic real-time control with advanced perception capabilities. This paper presents an integrated system combining NASA's F' flight software framework with ROS2 middleware via Protocol Buffers bridging. We evaluate the architecture through a 32.25-minute indoor quadrotor flight test using vision-based navigation. The vision system achieved 87.19 Hz position estimation with 99.90\\% data continuity and 11.47 ms mean latency, validating real-time performance requirements. All 15 ground commands executed successfully with 100 % success rate, demonstrating robust F'--PX4 integration. System resource utilization remained low (15.19 % CPU, 1,244 MB RAM) with zero stale telemetry messages, confirming efficient operation on embedded platforms. Results validate the feasibility of hybrid flight-software architectures combining certification-grade determinism with flexible autonomy for autonomous aerial vehicles."
  },
  {
    "date": "2026-02-17",
    "title": "Dual thermodynamic ensembles, relative entropies, and excess free energy",
    "authors": "Gavin E. Crooks",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.15392v1",
    "source": "arXiv",
    "abstract": "It has long been known that the relative entropy of a non-equilibrium ensemble to the corresponding equilibrium ensemble is the excess free energy. We show that the reverse relative entropy also has a thermodynamic interpretation: it is the excess free energy of a dual ensemble in which the roles of energy and entropy are interchanged."
  },
  {
    "date": "2026-02-17",
    "title": "Improving LLM Reliability through Hybrid Abstention and Adaptive Detection",
    "authors": "Ankit Sharma, Nachiket Tapas, Jyotiprakash Patra",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.15391v1",
    "source": "arXiv",
    "abstract": "Large Language Models (LLMs) deployed in production environments face a fundamental safety-utility trade-off either a strict filtering mechanisms prevent harmful outputs but often block benign queries or a relaxed controls risk unsafe content generation. Conventional guardrails based on static rules or fixed confidence thresholds are typically context-insensitive and computationally expensive, resulting in high latency and degraded user experience. To address these limitations, we introduce an adaptive abstention system that dynamically adjusts safety thresholds based on real-time contextual signals such as domain and user history. The proposed framework integrates a multi-dimensional detection architecture composed of five parallel detectors, combined through a hierarchical cascade mechanism to optimize both speed and precision. The cascade design reduces unnecessary computation by progressively filtering queries, achieving substantial latency improvements compared to non-cascaded models and external guardrail systems. Extensive evaluation on mixed and domain-specific workloads demonstrates significant reductions in false positives, particularly in sensitive domains such as medical advice and creative writing. The system maintains high safety precision and near-perfect recall under strict operating modes. Overall, our context-aware abstention framework effectively balances safety and utility while preserving performance, offering a scalable solution for reliable LLM deployment."
  },
  {
    "date": "2026-02-17",
    "title": "Bayesian Nonparametrics for Gene-Gene and Gene-Environment Interactions in Case-Control Studies: A Synthesis and Extension",
    "authors": "Durba Bhattacharya, Sourabh Bhattacharya",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.15387v1",
    "source": "arXiv",
    "abstract": "Gene-gene and gene-environment interactions are widely believed to play significant roles in explaining the variability of complex traits. While substantial research exists in this area, a comprehensive statistical framework that addresses multiple sources of uncertainty simultaneously remains lacking. In this article, we synthesize and propose extension of a novel class of Bayesian nonparametric approaches that account for interactions among genes, loci, and environmental factors while accommodating uncertainty about population substructure. Our contribution is threefold: (1) We provide a unified exposition of hierarchical Bayesian models driven by Dirichlet processes for genetic interactions, clarifying their conceptual advantages over traditional regression approaches; (2) We shed light on new computational strategies that combine transformation-based MCMC with parallel processing for scalable inference; and (3) We present enhanced hypothesis testing procedures for identifying disease-predisposing loci.Through applications to myocardial infarction data, we demonstrate how these methods offer biological insights not readily obtainable from standard approaches. Our synthesis highlights the advantages of Bayesian nonparametric thinking in genetic epidemiology while providing practical guidance for implementation."
  },
  {
    "date": "2026-02-17",
    "title": "Automatic Funny Scene Extraction from Long-form Cinematic Videos",
    "authors": "Sibendu Paul, Haotian Jiang, Caren Chen",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.15381v1",
    "source": "arXiv",
    "abstract": "Automatically extracting engaging and high-quality humorous scenes from cinematic titles is pivotal for creating captivating video previews and snackable content, boosting user engagement on streaming platforms. Long-form cinematic titles, with their extended duration and complex narratives, challenge scene localization, while humor's reliance on diverse modalities and its nuanced style add further complexity. This paper introduces an end-to-end system for automatically identifying and ranking humorous scenes from long-form cinematic titles, featuring shot detection, multimodal scene localization, and humor tagging optimized for cinematic content. Key innovations include a novel scene segmentation approach combining visual and textual cues, improved shot representations via guided triplet mining, and a multimodal humor tagging framework leveraging both audio and text. Our system achieves an 18.3% AP improvement over state-of-the-art scene detection on the OVSD dataset and an F1 score of 0.834 for detecting humor in long text. Extensive evaluations across five cinematic titles demonstrate 87% of clips extracted by our pipeline are intended to be funny, while 98% of scenes are accurately localized. With successful generalization to trailers, these results showcase the pipeline's potential to enhance content creation workflows, improve user engagement, and streamline snackable content generation for diverse cinematic media formats."
  },
  {
    "date": "2026-02-17",
    "title": "Self-dual Stacked Quantum Low-Density Parity-Check Codes",
    "authors": "Ze-Chuan Liu, Chong-Yuan Xu, Yong Xu",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.15372v1",
    "source": "arXiv",
    "abstract": "Quantum low-density parity-check (qLDPC) codes are promising candidates for fault-tolerant quantum computation due to their high encoding rates and distances. However, implementing logical operations using qLDPC codes presents significant challenges. Previous research has demonstrated that self-dual qLDPC codes facilitate the implementation of transversal Clifford gates. Here we introduce a method for constructing self-dual qLDPC codes by stacking non-self-dual qLDPC codes. Leveraging this methodology, we develop double-chain bicycle codes, double-layer bivariate bicycle (BB) codes, double-layer twisted BB codes, and double-layer reflection codes, many of which exhibit favorable code parameters. Additionally, we conduct numerical calculations to assess the performance of these codes as quantum memory under the circuit-level noise model, revealing that the logical failure rate can be significantly reduced with high pseudo-thresholds."
  },
  {
    "date": "2026-02-17",
    "title": "From PhysioNet to Foundation Models -- A history and potential futures",
    "authors": "Gari D. Clifford",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.15371v1",
    "source": "arXiv",
    "abstract": "Over the last 35 years, the sharing of medical data and models for research has evolved from sneakernet to the internet - from mailing magnetic tapes and compact discs of a handful of well-curated recordings, to the high-speed download of relatively comprehensive hospital databases. More recently, the fervor around the potential for modern machine learning and 'AI' to catapult us into the next industrial revolution has led to a seemingly insatiable desire to pump almost any source of data into large models. Although this has great potential, it also presents a whole set of new challenges. In this article I examine these trends over the last 30 years, drawing on examples from cardiology, one of the oldest data-intensive fields that is undergoing a renaissance via machine learning. From the early days of computerized cardiology, the Research Resource for Complex Physiologic Signals (PhysioNet) has been at the cutting edge of this field. This article, therefore, includes much of the Resource's history and the contributions drawn from 25 years of firsthand experience of co-developing elements of the Resource with its founders. I identify the most promising future directions for the PhysioNet Resource, and more generally, the growing issues and opportunities around dissemination and use of massive physiological databases, associated open access code, and public competitions, along with potential solutions to the key issues facing our field. Topics range from how we should approach foundation models in the context of the rapidly growing AI carbon footprint, to the potential of Tiny-ML and edge computing. I also cover issues around prizes and incentives, funding models, and scientific repeatability, as well as how we might address these issues by leveraging the PhysioNet Challenges, consistent with the philosophy of open-access from the early days of the PhysioNet Resource."
  },
  {
    "date": "2026-02-17",
    "title": "MarkSweep: A No-box Removal Attack on AI-Generated Image Watermarking via Noise Intensification and Frequency-aware Denoising",
    "authors": "Jie Cao, Zelin Zhang, Qi Li, Jianbing Ni",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.15364v1",
    "source": "arXiv",
    "abstract": "AI watermarking embeds invisible signals within images to provide provenance information and identify content as AI-generated. In this paper, we introduce MarkSweep, a novel watermark removal attack that effectively erases the embedded watermarks from AI-generated images without degrading visual quality. MarkSweep first amplifies watermark noise in high-frequency regions via edge-aware Gaussian perturbations and injects it into clean images for training a denoising network. This network then integrates two modules, the learnable frequency decomposition module and the frequency-aware fusion module, to suppress amplified noise and eliminate watermark traces. Theoretical analysis and extensive experiments demonstrate that invisible watermarks are highly vulnerable to MarkSweep, which effectively removes embedded watermarks, reducing the bit accuracy of HiDDeN and Stable Signature watermarking schemes to below 67%, while preserving perceptual quality of AI-generated images."
  },
  {
    "date": "2026-02-17",
    "title": "Automated Multi-Source Debugging and Natural Language Error Explanation for Dashboard Applications",
    "authors": "Devendra Tata, Mona Rajhans",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.15362v1",
    "source": "arXiv",
    "abstract": "Modern web dashboards and enterprise applications increasingly rely on complex, distributed microservices architectures. While these architectures offer scalability, they introduce significant challenges in debugging and observability. When failures occur, they often manifest as opaque error messages to the end-user such as Something went wrong. This masks the underlying root cause which may reside in browser side exceptions, API contract violations, or server side logic failures. Existing monitoring tools capture these events in isolation but fail to correlate them effectively or provide intelligible explanations to non technical users. This paper proposes a novel system for Automated Multi Source Debugging and Natural Language Error Explanation. The proposed framework automatically collects and correlates error data from disparate sources such as browser, API, server logs and validates API contracts in real time, and utilizes Large Language Models to generate natural language explanations. This approach significantly reduces Mean Time to Resolution for support engineers and improves the user experience by transforming cryptic error codes into actionable insights."
  },
  {
    "date": "2026-02-17",
    "title": "CREMD: Crowd-Sourced Emotional Multimodal Dogs Dataset",
    "authors": "Jinho Baek, Houwei Cao, Kate Blackwell",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.15349v1",
    "source": "arXiv",
    "abstract": "Dog emotion recognition plays a crucial role in enhancing human-animal interactions, veterinary care, and the development of automated systems for monitoring canine well-being. However, accurately interpreting dog emotions is challenging due to the subjective nature of emotional assessments and the absence of standardized ground truth methods. We present the CREMD (Crowd-sourced Emotional Multimodal Dogs Dataset), a comprehensive dataset exploring how different presentation modes (e.g., context, audio, video) and annotator characteristics (e.g., dog ownership, gender, professional experience) influence the perception and labeling of dog emotions. The dataset consists of 923 video clips presented in three distinct modes: without context or audio, with context but no audio, and with both context and audio. We analyze annotations from diverse participants, including dog owners, professionals, and individuals with varying demographic backgrounds and experience levels, to identify factors that influence reliable dog emotion recognition. Our findings reveal several key insights: (1) while adding visual context significantly improved annotation agreement, our findings regarding audio cues are inconclusive due to design limitations (specifically, the absence of a no-context-with-audio condition and limited clean audio availability); (2) contrary to expectations, non-owners and male annotators showed higher agreement levels than dog owners and female annotators, respectively, while professionals showed higher agreement levels, aligned with our initial hypothesis; and (3) the presence of audio substantially increased annotators' confidence in identifying specific emotions, particularly anger and fear."
  },
  {
    "date": "2026-02-17",
    "title": "Machine learning electronic structure and atomistic properties from the external potential",
    "authors": "Jigyasa Nigam, Tess Smidt, Geneviève Dusson",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.15345v1",
    "source": "arXiv",
    "abstract": "Electronic structure calculations remain a major bottleneck in atomistic simulations and, not surprisingly, have attracted significant attention in machine learning (ML). Most existing approaches learn a direct map from molecular geometries, typically represented as graphs or encoded local environments, to molecular properties or use ML as a surrogate for electronic structure theory by targeting quantities such as Fock or density matrices expressed in an atomic orbital (AO) basis. Inspired by the Hohenberg-Kohn theorem, in this work, we propose an operator-centered framework in which the external (nuclear) potential, expressed in an AO basis, serves as the model input. From this operator, we construct hierarchical, body-ordered representations of atomic configurations that closely mirror the principles underlying several popular atom-centered descriptors. At the same time, the matrix-valued nature of the external potential provides a natural connection to equivariant message-passing neural networks. In particular, we show that successive products of the external potential provide a scalable route to equivariant message passing and enable an efficient description of long-range effects. We demonstrate that this approach can be used to model molecular properties, such as energies and dipole moments, from the external potential, or learn effective operator-to-operator maps, including mappings to the Fock matrix and the reduced density matrix from which multiple molecular observables can be simultaneously derived."
  },
  {
    "date": "2026-02-17",
    "title": "Prescriptive Scaling Reveals the Evolution of Language Model Capabilities",
    "authors": "Hanlin Zhang, Jikai Jin, Vasilis Syrgkanis, Sham Kakade",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.15327v1",
    "source": "arXiv",
    "abstract": "For deploying foundation models, practitioners increasingly need prescriptive scaling laws: given a pre training compute budget, what downstream accuracy is attainable with contemporary post training practice, and how stable is that mapping as the field evolves? Using large scale observational evaluations with 5k observational and 2k newly sampled data on model performance, we estimate capability boundaries, high conditional quantiles of benchmark scores as a function of log pre training FLOPs, via smoothed quantile regression with a monotone, saturating sigmoid parameterization. We validate the temporal reliability by fitting on earlier model generations and evaluating on later releases. Across various tasks, the estimated boundaries are mostly stable, with the exception of math reasoning that exhibits a consistently advancing boundary over time. We then extend our approach to analyze task dependent saturation and to probe contamination related shifts on math reasoning tasks. Finally, we introduce an efficient algorithm that recovers near full data frontiers using roughly 20% of evaluation budget. Together, our work releases the Proteus 2k, the latest model performance evaluation dataset, and introduces a practical methodology for translating compute budgets into reliable performance expectations and for monitoring when capability boundaries shift across time."
  },
  {
    "date": "2026-02-17",
    "title": "Realizing a Universal Quantum Gate Set via Double-Braiding of SU(2)k Anyon Models",
    "authors": "Jiangwei Long, Zihui Liu, Yizhi Li, Jianxin Zhong, Lijun Meng",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.15324v1",
    "source": "arXiv",
    "abstract": "We systematically investigate the implementation of a universal gate set via double-braiding within SU(2)k anyon models. The explicit form of the double elementary braiding matrices (DEBMs) in these models are derived from the F-matrices and R-symbols obtained via the q-deformed representation theory of SU(2). Using these EBMs, standard single-qubit gates are synthesized up to a global phase by a Genetic Algorithm-enhanced Solovay-Kitaev Algorithm (GA-enhanced SKA), achieving the accuracy required for fault-tolerant quantum computation with only 2-level decomposition. For two-qubit entangling gates, Genetic Algorithm (GA) yields braidwords of 30 braiding operations that approximate the local equivalence class [CNOT]. Theoretically, we demonstrate that performing double-braiding in a three-anyon (six-anyon) encoding of single-qubit (two-qubit) is topologically equivalent to a protocol requiring the physical manipulation of only one (three) anyons to execute arbitrary braids. Our numerical results provide strong evidence that double-braiding in SU(2)k anyons models is capable of universal quantum computation. Moreover, the proposed protocol offers a potential new strategy for significantly reducing the number of non-Abelian anyons that need to be physically manipulated in future braiding-based topological quantum computations (TQC)."
  },
  {
    "date": "2026-02-17",
    "title": "Bayesian Inference for Joint Tail Risk in Paired Biomarkers via Archimedean Copulas with Restricted Jeffreys Priors",
    "authors": "Agnideep Aich, Md. Monzur Murshed, Sameera Hewage, Ashit Baran Aich",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.15319v1",
    "source": "arXiv",
    "abstract": "We propose a Bayesian copula-based framework to quantify clinically interpretable joint tail risks from paired continuous biomarkers. After converting each biomarker margin to rank-based pseudo-observations, we model dependence using one-parameter Archimedean copulas and focus on three probability-scale summaries at tail level $α$: the lower-tail joint risk $R_L(θ)=C_θ(α,α)$, the upper-tail joint risk $R_U(θ)=2α-1+C_θ(1-α,1-α)$, and the conditional lower-tail risk $R_C(θ)=R_L(θ)/α$. Uncertainty is quantified via a restricted Jeffreys prior on the copula parameter and grid-based posterior approximation, which induces an exact posterior for each tail-risk functional. In simulations from Clayton and Gumbel copulas across multiple dependence strengths, posterior credible intervals achieve near-nominal coverage for $R_L$, $R_U$, and $R_C$. We then analyze NHANES 2017--2018 fasting glucose (GLU) and HbA1c (GHB) ($n=2887$) at $α=0.05$, obtaining tight posterior credible intervals for both the dependence parameter and induced tail risks. The results reveal markedly elevated extremal co-movement relative to independence; under the Gumbel model, the posterior mean joint upper-tail risk is $R_U(α)=0.0286$, approximately $11.46\\times$ the independence benchmark $α^2=0.0025$. Overall, the proposed approach provides a principled, dependence-aware method for reporting joint and conditional extremal-risk summaries with Bayesian uncertainty quantification in biomedical applications."
  },
  {
    "date": "2026-02-17",
    "title": "Enhancing Computational Efficiency in NetLogo: Best Practices for Running Large-Scale Agent-Based Models on AWS and Cloud Infrastructures",
    "authors": "Michael A. Duprey, Georgiy V. Bobashev",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.15317v1",
    "source": "arXiv",
    "abstract": "The rising complexity and scale of agent-based models (ABMs) necessitate efficient computational strategies to manage the increasing demand for processing power and memory. This manuscript provides a comprehensive guide to optimizing NetLogo, a widely used platform for ABMs, for running large-scale models on Amazon Web Services (AWS) and other cloud infrastructures. It covers best practices in memory management, Java options, BehaviorSpace execution, and AWS instance selection. By implementing these optimizations and selecting appropriate AWS instances, we achieved a 32\\% reduction in computational costs and improved performance consistency. Through a comparative analysis of NetLogo simulations on different AWS instances using the wolf-sheep predation model, we demonstrate the performance gains achievable through these optimizations."
  },
  {
    "date": "2026-02-17",
    "title": "Training-Free Zero-Shot Anomaly Detection in 3D Brain MRI with 2D Foundation Models",
    "authors": "Tai Le-Gia, Jaehyun Ahn",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.15315v1",
    "source": "arXiv",
    "abstract": "Zero-shot anomaly detection (ZSAD) has gained increasing attention in medical imaging as a way to identify abnormalities without task-specific supervision, but most advances remain limited to 2D datasets. Extending ZSAD to 3D medical images has proven challenging, with existing methods relying on slice-wise features and vision-language models, which fail to capture volumetric structure. In this paper, we introduce a fully training-free framework for ZSAD in 3D brain MRI that constructs localized volumetric tokens by aggregating multi-axis slices processed by 2D foundation models. These 3D patch tokens restore cubic spatial context and integrate directly with distance-based, batch-level anomaly detection pipelines. The framework provides compact 3D representations that are practical to compute on standard GPUs and require no fine-tuning, prompts, or supervision. Our results show that training-free, batch-based ZSAD can be effectively extended from 2D encoders to full 3D MRI volumes, offering a simple and robust approach for volumetric anomaly detection."
  },
  {
    "date": "2026-02-17",
    "title": "The general Brannan coefficient conjecture and Watson's lemma",
    "authors": "T. M. Dunster",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.15308v1",
    "source": "arXiv",
    "abstract": "The coefficients $A_n(α,β,ω)$ in the Maclaurin expansion $(1+ωz)^α(1-z)^{-β}= \\sum_{n=0}^{\\infty} A_n(α,β,ω)z^n$ are studied, where $ω,z \\in \\mathbb{C}$ with $|z| < |ω|=1$, and $α,β\\in (0,1]$. In 1973 Brannan conjectured that $|A_n(α,β,ω)|\\le A_n(α,β,1)$ for each positive odd integer $n$, and showed it is true for $n=3$. This has recently been proven for all odd integers $n\\ge5$ by a number of authors in aggregate for the special case $β=1$. In this paper hypergeometric integral representations and Watson-type approximations are utilised, from which the general problem is reduced to numerically evaluating the minima of certain simple, explicit, slowly-varying functions over compact domains. From the positivity of these constants it is shown that the conjecture holds for $α, β\\in (0,1]$, $0 \\le |\\arg(ω)| \\le π-φ_0$ and $n=5,7,9,\\ldots$, where $φ_0=0.061$."
  },
  {
    "date": "2026-02-17",
    "title": "Intellicise Wireless Networks Meet Agentic AI: A Security and Privacy Perspective",
    "authors": "Rui Meng, Zhidi Zhang, Song Gao, Yaheng Wang, Xiaodong Xu, Yijing Lin, Yiming Liu, Chenyuan Feng, Lexi Xu, Yi Ma, Ping Zhang, Rahim Tafazolli",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.15290v1",
    "source": "arXiv",
    "abstract": "Intellicise (Intelligent and Concise) wireless network is the main direction of the evolution of future mobile communication systems, a perspective now widely acknowledged across academia and industry. As a key technology within it, Agentic AI has garnered growing attention due to its advanced cognitive capabilities, enabled through continuous perception-memory-reasoning-action cycles. This paper first analyses the unique advantages that Agentic AI introduces to intellicise wireless networks. We then propose a structured taxonomy for Agentic AI-enhanced secure intellicise wireless networks. Building on this framework, we identify emerging security and privacy challenges introduced by Agentic AI and summarize targeted strategies to address these vulnerabilities. A case study further demonstrates Agentic AI's efficacy in defending against intelligent eavesdropping attacks. Finally, we outline key open research directions to guide future exploration in this field."
  },
  {
    "date": "2026-02-17",
    "title": "AI Sessions for Network-Exposed AI-as-a-Service",
    "authors": "Merve Saimler, Mohaned Chraiti",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.15288v1",
    "source": "arXiv",
    "abstract": "Cloud-based Artificial Intelligence (AI) inference is increasingly latency- and context-sensitive, yet today's AI-as-a-Service is typically consumed as an application-chosen endpoint, leaving the network to provide only best-effort transport. This decoupling prevents enforceable tail-latency guarantees, compute-aware admission control, and continuity under mobility. This paper proposes Network-Exposed AI-as-a-Service (NE-AIaaS) built around a new service primitive: the AI Session (AIS)-a contractual object that binds model identity, execution placement, transport Quality-of-Service (QoS), and consent/charging scope into a single lifecycle with explicit failure semantics. We introduce the AI Service Profile (ASP), a compact contract that expresses task modality and measurable service objectives (e.g., time-to-first-response/token, p99 latency, success probability) alongside privacy and mobility constraints. On this basis, we specify protocol-grade procedures for (i) DISCOVER (model/site discovery), (ii) AI PAGING (context-aware selection of execution anchor), (iii) two-phase PREPARE/COMMIT that atomically co-reserves compute and QoS resources, and (iv) make-before-break MIGRATION for session continuity. The design is standard-mappable to Common API Framework (CAPIF) style northbound exposure, ETSI Multi-access Edge Computing (MEC) execution substrates, 5G QoS flows for transport enforcement, and Network Data Analytics Function (NWDAF) style analytics for closed-loop paging/migration triggers."
  },
  {
    "date": "2026-02-17",
    "title": "Visual Persuasion: What Influences Decisions of Vision-Language Models?",
    "authors": "Manuel Cherep, Pranav M R, Pattie Maes, Nikhil Singh",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.15278v1",
    "source": "arXiv",
    "abstract": "The web is littered with images, once created for human consumption and now increasingly interpreted by agents using vision-language models (VLMs). These agents make visual decisions at scale, deciding what to click, recommend, or buy. Yet, we know little about the structure of their visual preferences. We introduce a framework for studying this by placing VLMs in controlled image-based choice tasks and systematically perturbing their inputs. Our key idea is to treat the agent's decision function as a latent visual utility that can be inferred through revealed preference: choices between systematically edited images. Starting from common images, such as product photos, we propose methods for visual prompt optimization, adapting text optimization methods to iteratively propose and apply visually plausible modifications using an image generation model (such as in composition, lighting, or background). We then evaluate which edits increase selection probability. Through large-scale experiments on frontier VLMs, we demonstrate that optimized edits significantly shift choice probabilities in head-to-head comparisons. We develop an automatic interpretability pipeline to explain these preferences, identifying consistent visual themes that drive selection. We argue that this approach offers a practical and efficient way to surface visual vulnerabilities, safety concerns that might otherwise be discovered implicitly in the wild, supporting more proactive auditing and governance of image-based AI agents."
  },
  {
    "date": "2026-02-17",
    "title": "Compact Q-balls and Q-shells within a $CP^N$ Skyrme-Faddeev type model",
    "authors": "E. L. Colaço, P. Klimas, L. R. Livramento, N. Sawado, S. Yanai",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.15276v1",
    "source": "arXiv",
    "abstract": "While $CP^N$ models with analytic potentials are known to support finite-energy compact Q-ball and Q-shell solutions, their behavior in more complex Lagrangian frameworks remains a subject of active research. This work explores these non-topological structures within an extended Skyrme-Faddeev-type model that incorporates quartic derivative terms. In this context, harmonic time dependence and the presence of quartic terms constitute two independent stabilization mechanisms that allow the configurations to circumvent Derrick's scaling argument. We investigate the necessary conditions for the existence of these solutions and analyze the influence of quartic terms on the properties of the resulting compactons, specifically examining the $E(Q)$ relationship between energy and Noether charge. Our findings provide valuable insights into the stability and characteristics of compact boson stars within $CP^N$ models featuring higher-order derivative terms."
  },
  {
    "date": "2026-02-17",
    "title": "When Remembering and Planning are Worth it: Navigating under Change",
    "authors": "Omid Madani, J. Brian Burns, Reza Eghbali, Thomas L. Dean",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.15274v1",
    "source": "arXiv",
    "abstract": "We explore how different types and uses of memory can aid spatial navigation in changing uncertain environments. In the simple foraging task we study, every day, our agent has to find its way from its home, through barriers, to food. Moreover, the world is non-stationary: from day to day, the location of the barriers and food may change, and the agent's sensing such as its location information is uncertain and very limited. Any model construction, such as a map, and use, such as planning, needs to be robust against these challenges, and if any learning is to be useful, it needs to be adequately fast. We look at a range of strategies, from simple to sophisticated, with various uses of memory and learning. We find that an architecture that can incorporate multiple strategies is required to handle (sub)tasks of a different nature, in particular for exploration and search, when food location is not known, and for planning a good path to a remembered (likely) food location. An agent that utilizes non-stationary probability learning techniques to keep updating its (episodic) memories and that uses those memories to build maps and plan on the fly (imperfect maps, i.e. noisy and limited to the agent's experience) can be increasingly and substantially more efficient than the simpler (minimal-memory) agents, as the task difficulties such as distance to goal are raised, as long as the uncertainty, from localization and change, is not too large."
  },
  {
    "date": "2026-02-17",
    "title": "Ensemble-size-dependence of deep-learning post-processing methods that minimize an (un)fair score: motivating examples and a proof-of-concept solution",
    "authors": "Christopher David Roberts",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.15830v1",
    "source": "arXiv",
    "abstract": "Fair scores reward ensemble forecast members that behave like samples from the same distribution as the verifying observations. They are therefore an attractive choice as loss functions to train data-driven ensemble forecasts or post-processing methods when large training ensembles are either unavailable or computationally prohibitive. The adjusted continuous ranked probability score (aCRPS) is fair and unbiased with respect to ensemble size, provided forecast members are exchangeable and interpretable as conditionally independent draws from an underlying predictive distribution. However, distribution-aware post-processing methods that introduce structural dependency between members can violate this assumption, rendering aCRPS unfair. We demonstrate this effect using two approaches designed to minimize the expected aCRPS of a finite ensemble: (1) a linear member-by-member calibration, which couples members through a common dependency on the sample ensemble mean, and (2) a deep-learning method, which couples members via transformer self-attention across the ensemble dimension. In both cases, the results are sensitive to ensemble size and apparent gains in aCRPS can correspond to systematic unreliability characterized by over-dispersion. We introduce trajectory transformers as a proof-of-concept that ensemble-size independence can be achieved. This approach is an adaptation of the Post-processing Ensembles with Transformers (PoET) framework and applies self-attention over lead time while preserving the conditional independence required by aCRPS. When applied to weekly mean $T_{2m}$ forecasts from the ECMWF subseasonal forecasting system, this approach successfully reduces systematic model biases whilst also improving or maintaining forecast reliability regardless of the ensemble size used in training (3 vs 9 members) or real-time forecasts (9 vs 100 members)."
  },
  {
    "date": "2026-02-17",
    "title": "Perceptive Humanoid Parkour: Chaining Dynamic Human Skills via Motion Matching",
    "authors": "Zhen Wu, Xiaoyu Huang, Lujie Yang, Yuanhang Zhang, Koushil Sreenath, Xi Chen, Pieter Abbeel, Rocky Duan, Angjoo Kanazawa, Carmelo Sferrazza, Guanya Shi, C. Karen Liu",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.15827v1",
    "source": "arXiv",
    "abstract": "While recent advances in humanoid locomotion have achieved stable walking on varied terrains, capturing the agility and adaptivity of highly dynamic human motions remains an open challenge. In particular, agile parkour in complex environments demands not only low-level robustness, but also human-like motion expressiveness, long-horizon skill composition, and perception-driven decision-making. In this paper, we present Perceptive Humanoid Parkour (PHP), a modular framework that enables humanoid robots to autonomously perform long-horizon, vision-based parkour across challenging obstacle courses. Our approach first leverages motion matching, formulated as nearest-neighbor search in a feature space, to compose retargeted atomic human skills into long-horizon kinematic trajectories. This framework enables the flexible composition and smooth transition of complex skill chains while preserving the elegance and fluidity of dynamic human motions. Next, we train motion-tracking reinforcement learning (RL) expert policies for these composed motions, and distill them into a single depth-based, multi-skill student policy, using a combination of DAgger and RL. Crucially, the combination of perception and skill composition enables autonomous, context-aware decision-making: using only onboard depth sensing and a discrete 2D velocity command, the robot selects and executes whether to step over, climb onto, vault or roll off obstacles of varying geometries and heights. We validate our framework with extensive real-world experiments on a Unitree G1 humanoid robot, demonstrating highly dynamic parkour skills such as climbing tall obstacles up to 1.25m (96% robot height), as well as long-horizon multi-obstacle traversal with closed-loop adaptation to real-time obstacle perturbations."
  },
  {
    "date": "2026-02-17",
    "title": "Connection formulas for Askey--Wilson polynomials and related expansions",
    "authors": "Howard S. Cohl, Wolter Groenevelt",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.15824v1",
    "source": "arXiv",
    "abstract": "We derive and study expansions of and over the Askey--Wilson polynomials. We study these expansions and examine some limits to the continuous dual $q$-Hahn, Al-Salam--Chihara, continuous big $q$-Hermite and continuous $q$-Hermite polynomials and their $q^{-1}$-analogues. The Poisson kernel for the infinite discrete orthogonality relation for the $q^{-1}$-Al-Salam--Chihara polynomials is derived which in a special case reduces to the Gupta--Masson biorthogonal rational ${}_4φ_3$-functions. This Poisson kernel implies new infinite series connection relations for the Askey--Wilson polynomials involving these rational ${}_4φ_3$-functions. We also consider various interesting limits."
  },
  {
    "date": "2026-02-17",
    "title": "Separable C*-algebras Without the Countable Axiom of Choice",
    "authors": "Bruce Blackadar, Ilijas Farah",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.15812v1",
    "source": "arXiv",
    "abstract": "The goal of this paper is twofold. In addition to the results stated in the next paragraph, we present some classical results on absoluteness relevant to functional analysis that are well known to logicians but not nearly as well advertised as they should be. We show that the theory of separable C*-algebras can be developed in ZF (that is, without using any Choice). This includes proving the Gelfand-Naimark representation theorems as well as the Spectral Mapping Theorem for polynomials and developing continuous functional calculus for commuting normal elements. Some of our proofs are modifications of the standard ones, obtained by avoiding the use of Choice. Some other proofs require new ideas in order to avoid the use of Choice. Yet another batch of proofs proceeds by using the set-theoretic Shoenfield Absoluteness Theorem. This result (well known to logicians but regrettably not as well advertised as it deserves) implies that statements about standard Borel spaces of low quantifier complexity that are provable in ZFC, or even ZFC together with the Continuum Hypothesis are provable in ZF. One of the main objectives of this paper is to present these results in a convenient form that can be utilized by analysts not familiar with set theory. We also show that in the absence of Choice (more precisely, assuming the existence of a Russell set) there is a concretely representable unital commutative \\cstar-algebra that is not isomorphic to C(X) for any compact Hausdorff space X. Finally, from the model-theoretic point of view, while the property of having a tracial state is provably axiomatizable in ZFC, it is not provably axiomatizable in ZF+DC."
  },
  {
    "date": "2026-02-17",
    "title": "Entanglement in the Dicke subspace",
    "authors": "Aabhas Gulati, Ion Nechita, Clément Pellegrini",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.15800v1",
    "source": "arXiv",
    "abstract": "In this paper, we provide a complete mathematical theory for the entanglement of mixtures of Dicke states. These quantum states form an important subclass of bosonic states arising in the study of indistinguishable particles. We introduce a tensor-based parametrization where the diagonal entries of these states are encoded as a symmetric tensor, enabling a direct translation between entanglement properties and well-studied convex cones of tensors. Our results bridge multipartite entanglement theory with semialgebraic geometry and the theory of completely positive and copositive tensors. This dictionary maps separability to completely positive tensors, the PPT property to moment tensors, entanglement witnesses to copositive tensors, and decomposable witnesses to sum of squares tensors. Using this framework, we construct explicit PPT entangled states in three or more qutrits. In this class of states, we establish that PPT entanglement exists for all multipartite systems with three qutrits or more, disproving a recent conjecture in [J. Math. Phys. 66, 022203 (2025)]. We also show that, for mixtures of Dicke states, the PPT condition with respect to the most balanced bipartition implies PPT with respect to any other bipartition. We further connect bosonic extendibility of mixtures of Dicke states to the duals of known hierarchies for non-negative polynomials, such as the ones by Reznick and Polya. We thus provide semidefinite programming relaxations for separability and entanglement testing in the Dicke subspace."
  },
  {
    "date": "2026-02-17",
    "title": "On Graham's rearrangement conjecture",
    "authors": "Huy Tuan Pham, Lisa Sauermann",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.15797v1",
    "source": "arXiv",
    "abstract": "Graham conjectured in 1971 that for any prime $p$, any subset $S\\subseteq \\mathbb{Z}_p\\setminus \\{0\\}$ admits an ordering $s_1,s_2,\\dots,s_{|S|}$ where all partial sums $s_1, s_1+s_2,\\dots,s_1+s_2+\\dots+s_{|S|}$ are distinct. We prove this conjecture for all subsets $S\\subseteq \\mathbb{Z}_p\\setminus \\{0\\}$ with $|S|\\le p^{1-α}$ and $|S|$ sufficiently large with respect to $α$, for any $α\\in (0,1)$. Combined with earlier results, this gives a complete resolution of Graham's rearrangement conjecture for all sufficiently large primes $p$."
  },
  {
    "date": "2026-02-17",
    "title": "Meteorological data and Sky Images meets Neural Models for Photovoltaic Power Forecasting",
    "authors": "Ines Montoya-Espinagosa, Antonio Agudo",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.15782v1",
    "source": "arXiv",
    "abstract": "Due to the rise in the use of renewable energies as an alternative to traditional ones, and especially solar energy, there is increasing interest in studying how to address photovoltaic forecasting in the face of the challenge of variability in photovoltaic energy production, using different methodologies. This work develops a hybrid approach for short and long-term forecasting based on two studies with the same purpose. A multimodal approach that combines images of the sky and photovoltaic energy history with meteorological data is proposed. The main goal is to improve the accuracy of ramp event prediction, increase the robustness of forecasts in cloudy conditions, and extend capabilities beyond nowcasting, to support more efficient operation of the power grid and better management of solar variability. Deep neural models are used for both nowcasting and forecasting solutions, incorporating individual and multiple meteorological variables, as well as an analytical solar position. The results demonstrate that the inclusion of meteorological data, particularly the surface long-wave, radiation downwards, and the combination of wind and solar position, significantly improves current predictions in both nowcasting and forecasting tasks, especially on cloudy days. This study highlights the importance of integrating diverse data sources to improve the reliability and interpretability of solar energy prediction models."
  },
  {
    "date": "2026-02-17",
    "title": "*-PLUIE: Personalisable metric with Llm Used for Improved Evaluation",
    "authors": "Quentin Lemesle, Léane Jourdan, Daisy Munson, Pierre Alain, Jonathan Chevelu, Arnaud Delhay, Damien Lolive",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.15778v1",
    "source": "arXiv",
    "abstract": "Evaluating the quality of automatically generated text often relies on LLM-as-a-judge (LLM-judge) methods. While effective, these approaches are computationally expensive and require post-processing. To address these limitations, we build upon ParaPLUIE, a perplexity-based LLM-judge metric that estimates confidence over ``Yes/No'' answers without generating text. We introduce *-PLUIE, task specific prompting variants of ParaPLUIE and evaluate their alignment with human judgement. Our experiments show that personalised *-PLUIE achieves stronger correlations with human ratings while maintaining low computational cost."
  },
  {
    "date": "2026-02-17",
    "title": "New Challenges in Plasma Accelerators: Final Focusing for Wakefield Colliders",
    "authors": "Keegan Downham, Spencer Gessner, Lewis Kennedy, Rogelio Tomás, Andrei Seryi",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.15777v1",
    "source": "arXiv",
    "abstract": "The focusing of particle beams for collider experiments is crucial for maximizing the luminosity and thus the discovery potential of these machines. In recent years, plasma wakefield acceleration has emerged as a leading candidate for achieving higher energy collisions with smaller facility footprints due to the large accelerating gradients in the plasma. This higher beam energy poses significant challenges for the final focusing system of the collider. Here, we discuss the various challenges of final focusing for TeV-scale plasma accelerators and propose possible solutions. Finally, we present the first design of a final focusing system for a 10 TeV linear wakefield collider, evaluate its performance, and discuss its shortcomings as well as improvements for future designs."
  },
  {
    "date": "2026-02-17",
    "title": "NeRFscopy: Neural Radiance Fields for in-vivo Time-Varying Tissues from Endoscopy",
    "authors": "Laura Salort-Benejam, Antonio Agudo",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.15775v1",
    "source": "arXiv",
    "abstract": "Endoscopy is essential in medical imaging, used for diagnosis, prognosis and treatment. Developing a robust dynamic 3D reconstruction pipeline for endoscopic videos could enhance visualization, improve diagnostic accuracy, aid in treatment planning, and guide surgery procedures. However, challenges arise due to the deformable nature of the tissues, the use of monocular cameras, illumination changes, occlusions and unknown camera trajectories. Inspired by neural rendering, we introduce NeRFscopy, a self-supervised pipeline for novel view synthesis and 3D reconstruction of deformable endoscopic tissues from a monocular video. NeRFscopy includes a deformable model with a canonical radiance field and a time-dependent deformation field parameterized by SE(3) transformations. In addition, the color images are efficiently exploited by introducing sophisticated terms to learn a 3D implicit model without assuming any template or pre-trained model, solely from data. NeRFscopy achieves accurate results in terms of novel view synthesis, outperforming competing methods across various challenging endoscopy scenes."
  },
  {
    "date": "2026-02-17",
    "title": "ViTaB-A: Evaluating Multimodal Large Language Models on Visual Table Attribution",
    "authors": "Yahia Alqurnawi, Preetom Biswas, Anmol Rao, Tejas Anvekar, Chitta Baral, Vivek Gupta",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.15769v1",
    "source": "arXiv",
    "abstract": "Multimodal Large Language Models (mLLMs) are often used to answer questions in structured data such as tables in Markdown, JSON, and images. While these models can often give correct answers, users also need to know where those answers come from. In this work, we study structured data attribution/citation, which is the ability of the models to point to the specific rows and columns that support an answer. We evaluate several mLLMs across different table formats and prompting strategies. Our results show a clear gap between question answering and evidence attribution. Although question answering accuracy remains moderate, attribution accuracy is much lower, near random for JSON inputs, across all models. We also find that models are more reliable at citing rows than columns, and struggle more with textual formats than images. Finally, we observe notable differences across model families. Overall, our findings show that current mLLMs are unreliable at providing fine-grained, trustworthy attribution for structured data, which limits their usage in applications requiring transparency and traceability."
  },
  {
    "date": "2026-02-17",
    "title": "Power monoids and their arithmetic: a survey",
    "authors": "Salvatore Tringali",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.15754v1",
    "source": "arXiv",
    "abstract": "The non-empty finite subsets of a multiplicatively written monoid form a monoid in their own right, and so do the finite subsets that contain the identity element. Partly due to their unusual arithmetic properties, these structures, known as power monoids, have attracted increasing attention in recent years and have in turn stimulated growing interest in new perspectives in factorization theory, better suited to non-cancellative settings. We survey these developments and briefly review some related aspects."
  },
  {
    "date": "2026-02-17",
    "title": "Hierarchical Decomposition of Separable Workflow-Nets",
    "authors": "Humam Kourani, Gyunam Park, Wil M. P. van der Aalst",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.15739v1",
    "source": "arXiv",
    "abstract": "The Partially Ordered Workflow Language (POWL) has recently emerged as a process modeling notation, offering strong quality guarantees and high expressiveness. While early versions of POWL relied on strict block-structured operators for choices and loops, the language has recently evolved into POWL 2.0, introducing choice graphs to enable the modeling of non-block-structured decisions and cycles. To bridge the gap between the theoretical advantages of POWL and the practical need for compatibility with established notations, robust model transformations are required. This paper presents a novel algorithm for transforming safe and sound workflow nets (WF-nets) into equivalent POWL 2.0 models. The algorithm recursively identifies structural patterns within the WF-net and translates them into their POWL representation. Unlike the previous approach that required separate detection strategies for exclusive choices and loops, our new algorithm utilizes choice graphs to capture generalized decision and cyclic patterns. We formally prove the correctness of our approach, showing that the generated POWL model preserves the language of the input WF-net. Furthermore, we prove the completeness of our algorithm on the class of separable WF-nets, which corresponds to nets constructed via the hierarchical nesting of state machines and marked graphs. We evaluate our algorithm on large-scale process models to demonstrate its high scalability. Furthermore, to test its practical expressiveness, we applied it to a benchmark of 1,493 industrial and synthetic process models. Our algorithm successfully transformed all models in this benchmark, suggesting that POWL 2.0's expressive power is generally sufficient to capture the complex logic found in real-world business processes. This work paves the way for broader adoption of POWL in practical process analysis and improvement applications."
  },
  {
    "date": "2026-02-17",
    "title": "Language and Geometry Grounded Sparse Voxel Representations for Holistic Scene Understanding",
    "authors": "Guile Wu, David Huang, Bingbing Liu, Dongfeng Bai",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.15734v1",
    "source": "arXiv",
    "abstract": "Existing 3D open-vocabulary scene understanding methods mostly emphasize distilling language features from 2D foundation models into 3D feature fields, but largely overlook the synergy among scene appearance, semantics, and geometry. As a result, scene understanding often deviates from the underlying geometric structure of scenes and becomes decoupled from the reconstruction process. In this work, we propose a novel approach that leverages language and geometry grounded sparse voxel representations to comprehensively model appearance, semantics, and geometry within a unified framework. Specifically, we use 3D sparse voxels as primitives and employ an appearance field, a density field, a feature field, and a confidence field to holistically represent a 3D scene. To promote synergy among the appearance, density, and feature fields, we construct a feature modulation module and distill language features from a 2D foundation model into our 3D scene model. In addition, we integrate geometric distillation into feature field distillation to transfer geometric knowledge from a geometry foundation model to our 3D scene representations via depth correlation regularization and pattern consistency regularization. These components work together to synergistically model the appearance, semantics, and geometry of the 3D scene within a unified framework. Extensive experiments demonstrate that our approach achieves superior overall performance compared with state-of-the-art methods in holistic scene understanding and reconstruction."
  },
  {
    "date": "2026-02-17",
    "title": "Generalised Exponential Kernels for Nonparametric Density Estimation",
    "authors": "Laura M. Craig, Wagner Barreto-Souza",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.15731v1",
    "source": "arXiv",
    "abstract": "This paper introduces a novel kernel density estimator (KDE) based on the generalised exponential (GE) distribution, designed specifically for positive continuous data. The proposed GE KDE offers a mathematically tractable form that avoids the use of special functions, for instance, distinguishing it from the widely used gamma KDE, which relies on the gamma function. Despite its simpler form, the GE KDE maintains similar flexibility and shape characteristics, aligning with distributions such as the gamma, which are known for their effectiveness in modelling positive data. We derive the asymptotic bias and variance of the proposed kernel density estimator, and formally demonstrate the order of magnitude of the remaining terms in these expressions. We also propose a second GE KDE, for which we are able to show that it achieves the optimal mean integrated squared error, something that is difficult to establish for the former. Through numerical experiments involving simulated and real data sets, we show that GE KDEs can be an important alternative and competitive to existing KDEs."
  },
  {
    "date": "2026-02-17",
    "title": "Weak mixing for area preserving flows on surfaces",
    "authors": "Adam Kanigowski, Alexey Okunev, Rigoberto Zelada",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.15719v1",
    "source": "arXiv",
    "abstract": "Let $(φ_t)$ be an area-preserving smooth flow on a compact, connected, orientable surface $\\mathcal M$ with at least one but finitely many fixed points. Assume that $(φ_t)$ is analytic (up to a canonical change of coordinates) in the neighborhood of each saddle fixed point. We show that the flow $(φ_t)$ is weakly mixing on each of its (finitely many) quasi-minimal components."
  },
  {
    "date": "2026-02-17",
    "title": "On the existence of a morphism between certain Artin-Schreier curves",
    "authors": "Beatriz Barbero Lucas, Stefano Lia, Gary McGuire",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.15717v1",
    "source": "arXiv",
    "abstract": "It is well known that, given two curves $\\mathcal{X}: y^p+cy=x^m$ and $\\mathcal{Y}:y^p+cy=x^n$, defined over $\\F_p$, if $n$ divides $m$ then there exists a nonconstant morphism $\\mathcal{X} \\longrightarrow \\mathcal{Y}$. In this paper we are interested in studying whether the converse of this statement is true, i.e., if there exists a morphism $\\mathcal{X} \\longrightarrow\\mathcal{Y}$ then must it be true that $n$ divides $m$? In particular, we consider the case when $m=p^{k}+1$ and $n=p^\\ell+1$. We prove that the converse is true under certain hypotheses. We deal with both the cases of Galois morphisms and non-Galois morphisms."
  },
  {
    "date": "2026-02-17",
    "title": "Controlled oscillation modeling using port-Hamiltonian neural networks",
    "authors": "Maximino Linares, Guillaume Doras, Thomas Hélie",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.15704v1",
    "source": "arXiv",
    "abstract": "Learning dynamical systems through purely data-driven methods is challenging as they do not learn the underlying conservation laws that enable them to correctly generalize. Existing port-Hamiltonian neural network methods have recently been successfully applied for modeling mechanical systems. However, even though these methods are designed on power-balance principles, they usually do not consider power-preserving discretizations and often rely on Runge-Kutta numerical methods. In this work, we propose to use a second-order discrete gradient method embedded in the learning of dynamical systems with port-Hamiltonian neural networks. Numerical results are provided for three systems deliberately selected to span different ranges of dynamical behavior under control: a baseline harmonic oscillator with quadratic energy storage; a Duffing oscillator, with a non-quadratic Hamiltonian offering amplitude-dependent effects; and a self-sustained oscillator, which can stabilize in a controlled limit cycle through the incorporation of a nonlinear dissipation. We show how the use of this discrete gradient method outperforms the performance of a Runge-Kutta method of the same order. Experiments are also carried out to compare two theoretically equivalent port-Hamiltonian systems formulations and to analyze the impact of regularizing the Jacobian of port-Hamiltonian neural networks during training."
  },
  {
    "date": "2026-02-17",
    "title": "Analytical Nuclear Gradients of State-Averaged Configuration Interaction Singles Variants: Application to Conical Intersections",
    "authors": "Takashi Tsuchimochi",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.15700v1",
    "source": "arXiv",
    "abstract": "We derive analytical nuclear gradients for state-averaged configuration interaction singles (SACIS) and its spin-projected extension (SAECIS), enabling efficient geometry optimization and minimum-energy conical intersection (MECX) searches within a low-cost CIS-based framework. The formulation employs a Lagrangian approach and explicitly removes null-space contributions in the coupled perturbed equations to ensure numerically stable gradients. For twisted-pyramidalized ethylene, both SACIS and SAECIS qualitatively reproduce the correct conical intersection topology, in sharp contrast to conventional CIS and ECIS. Benchmark calculations on twelve MECXs demonstrate that both methods reproduce geometries with mean RMSDs below 0.1~Å relative to high-level reference methods. SACIS captures the essential degeneracy through variational orbital relaxation, which alleviates ground-state Hartree--Fock (HF) orbital bias and effectively incorporates static correlation through localization effects; notably, spin projection is found to be non-essential for the qualitative description of these intersections. Overall, SACIS and SAECIS provide qualitatively reliable CX descriptions at mean-field computational cost in a black-box manner. Given their comparable accuracy and the additional overhead associated with spin projection, SACIS offers a more favorable cost-performance balance for general applications, whereas SAECIS may become advantageous when higher excited states with significant double-excitation character are involved."
  },
  {
    "date": "2026-02-17",
    "title": "Upper bounds for logarithmic Gromov-Witten invariants of projective space",
    "authors": "Dan Simms",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.15685v1",
    "source": "arXiv",
    "abstract": "We provide an upper bound for the genus zero logarithmic Gromov-Witten invariants of projective space relative to its toric boundary. The upper bound is polynomial in the contact orders, with degree depending on the number of marked points. The result hinges on the positivity of intersections for projective spaces."
  },
  {
    "date": "2026-02-17",
    "title": "Relative and lax volutive categories",
    "authors": "Tim Lüders",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.15667v1",
    "source": "arXiv",
    "abstract": "In this paper we introduce the notion of a relative volutive (higher) category, specializing to the notion of a lax volutive (higher) category. Our primary motivation to study these objects is the following: while any rigid symmetric monoidal category admits a volutive structure, any closed symmetric monoidal category admits a lax volutive structure. We develop some of the basic theory of relative volutive categories and provide several equivalent formulations of lax volutive categories. We then study examples of interest, including categories of complete bornological vector spaces and modules over star-rings. We will also separately discuss unbounded operators between Hilbert spaces and Morita 2-categories, the latter of which in the context of fully closed symmetric monoidal 2-categories."
  },
  {
    "date": "2026-02-17",
    "title": "The stability of Yang-Mills connections on $δ$-pinched manifolds",
    "authors": "Xiaoli Han, Yang Wen",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.15666v1",
    "source": "arXiv",
    "abstract": "In this article, we establish pinching conditions under which all weakly stable Yang-Mills connections on compact manifolds are flat. As a corollary, we provide a dimension-dependent constant $δ(n)$ and prove that there exist no non-flat weakly stable Yang-Mills connections on $δ(n)$-pinched compact simply-connected Riemannian manifolds."
  },
  {
    "date": "2026-02-17",
    "title": "Generalized GMP Algebra for Three-Dimensional Quantum Hall Fluids of Extended Objects",
    "authors": "Giandomenico Palumbo",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.15664v1",
    "source": "arXiv",
    "abstract": "We develop a geometric framework for three-dimensional quantum Hall fluids of extended objects (quasi-strings) in the presence of a strong three-form background field associated with a bundle gerbe. In the strong-field regime, fast internal dynamics is frozen and the low-energy kinematics is governed by generalized guiding-center variables consisting of vectorial and tensorial coordinates. We show that these guiding-center variables obey a noncommutative geometry giving rise to a three-dimensional generalization of the Girvin-MacDonald-Platzman (GMP) algebra for projected density operators. Moreover, we relate this algebra to the canonical quantization of a topological BF+BB theory whose level is identified with the Dixmier-Douady invariant. Our results clarify the structure of incompressible quantum Hall-type phases and their geometric and topological features in three spatial dimensions."
  },
  {
    "date": "2026-02-17",
    "title": "Entropy production reveals hidden dynamical constraints rather than stochastic disorder",
    "authors": "Patrick Romanescu",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.15663v1",
    "source": "arXiv",
    "abstract": "Entropy production is often interpreted as a proxy for microscopic disorder or environmental roughness in stochastic systems. We test this interpretation using controlled simulations of overdamped stochastic dynamics on curved surfaces in which local noise, geometry, and forces are held fixed while global constraints are varied. Trajectories are generated for particles evolving toward a central attractor, and entropy production is quantified using both a continuum probability-current estimator and coarse-grained Markov transition statistics across multiple spatial and temporal resolutions. Across systematic sweeps of timestep size, domain extent, and boundary topology, entropy production is governed primarily by constraint-induced probability flow rather than local stochastic variability. Periodic domains that permit sustained circulation yield substantially higher entropy production than reflecting domains despite identical local stochastic structure, with the magnitude of the separation depending on domain extent. In contrast, coarse-grained estimates decrease as temporal resolution increases and rise with finer spatial binning, demonstrating that discrete estimates depend strongly on observation scale and may fail to resolve topology-induced irreversible structure. Ergo, entropy production is not a direct measure of environmental roughness or randomness. Instead, it quantifies how strongly system dynamics are driven away from reversibility by global constraints, geometry, and the space of allowed trajectories. Interpreted in this way, entropy production maps function as diagnostics of organized probability flow and provide a principled method for detecting hidden dynamical constraints from trajectory data alone."
  },
  {
    "date": "2026-02-17",
    "title": "Self-phoretic oscillatory motion in a one-dimensional channel",
    "authors": "Leah Anderson, David S. Dean",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.15657v1",
    "source": "arXiv",
    "abstract": "We study a simple model for a particle that is active due to self-phoresis and that has been proposed to model symmetric camphor grains. The particle generates a concentration field through the continuous emission of a chemical substance, and its motion is driven by gradients of this field as it diffuses within a confined channel whose ends perfectly reflect the chemical. The reflection of the chemical field leads to an effective confinement of the particle, which itself is reflected before encountering the channel ends. The system displays a transition from a passive state, where the particle rests at the channel midpoint, to an active state characterized by highly regular, non-chaotic oscillations. We analytically construct the phase diagram and derive the oscillation frequency and amplitude in the vicinity of the transition. A perturbative analysis perfectly describes the dynamics of the particle even for oscillations as large as half the channel size. Furthermore, we develop an analysis which explains the mechanism of particle reflection close to the channel edges in the regime of large activity."
  },
  {
    "date": "2026-02-17",
    "title": "Beyond ReLU: Bifurcation, Oversmoothing, and Topological Priors",
    "authors": "Erkan Turan, Gaspard Abel, Maysam Behmanesh, Emery Pierson, Maks Ovsjanikov",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.15634v1",
    "source": "arXiv",
    "abstract": "Graph Neural Networks (GNNs) learn node representations through iterative network-based message-passing. While powerful, deep GNNs suffer from oversmoothing, where node features converge to a homogeneous, non-informative state. We re-frame this problem of representational collapse from a \\emph{bifurcation theory} perspective, characterizing oversmoothing as convergence to a stable ``homogeneous fixed point.'' Our central contribution is the theoretical discovery that this undesired stability can be broken by replacing standard monotone activations (e.g., ReLU) with a class of functions. Using Lyapunov-Schmidt reduction, we analytically prove that this substitution induces a bifurcation that destabilizes the homogeneous state and creates a new pair of stable, non-homogeneous \\emph{patterns} that provably resist oversmoothing. Our theory predicts a precise, nontrivial scaling law for the amplitude of these emergent patterns, which we quantitatively validate in experiments. Finally, we demonstrate the practical utility of our theory by deriving a closed-form, bifurcation-aware initialization and showing its utility in real benchmark experiments."
  },
  {
    "date": "2026-02-17",
    "title": "SpecFuse: A Spectral-Temporal Fusion Predictive Control Framework for UAV Landing on Oscillating Marine Platforms",
    "authors": "Haichao Liu, Yufeng Hu, Shuang Wang, Kangjun Guo, Jun Ma, Jinni Zhou",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.15633v1",
    "source": "arXiv",
    "abstract": "Autonomous landing of Uncrewed Aerial Vehicles (UAVs) on oscillating marine platforms is severely constrained by wave-induced multi-frequency oscillations, wind disturbances, and prediction phase lags in motion prediction. Existing methods either treat platform motion as a general random process or lack explicit modeling of wave spectral characteristics, leading to suboptimal performance under dynamic sea conditions. To address these limitations, we propose SpecFuse: a novel spectral-temporal fusion predictive control framework that integrates frequency-domain wave decomposition with time-domain recursive state estimation for high-precision 6-DoF motion forecasting of Uncrewed Surface Vehicles (USVs). The framework explicitly models dominant wave harmonics to mitigate phase lags, refining predictions in real time via IMU data without relying on complex calibration. Additionally, we design a hierarchical control architecture featuring a sampling-based HPO-RRT* algorithm for dynamic trajectory planning under non-convex constraints and a learning-augmented predictive controller that fuses data-driven disturbance compensation with optimization-based execution. Extensive validations (2,000 simulations + 8 lake experiments) show our approach achieves a 3.2 cm prediction error, 4.46 cm landing deviation, 98.7% / 87.5% success rates (simulation / real-world), and 82 ms latency on embedded hardware, outperforming state-of-the-art methods by 44%-48% in accuracy. Its robustness to wave-wind coupling disturbances supports critical maritime missions such as search and rescue and environmental monitoring. All code, experimental configurations, and datasets will be released as open-source to facilitate reproducibility."
  },
  {
    "date": "2026-02-17",
    "title": "Steenrod operations and symplectic arithmetic duality",
    "authors": "Tony Feng",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.15629v1",
    "source": "arXiv",
    "abstract": "This expository article elaborates upon my talk at the 2025 AMS Summer Institute on Algebraic Geometry. It gives an introduction to a conjecture from Tate's 1966 Séminaire Bourbaki report, predicting the existence of a symplectic form on Brauer groups of surfaces over finite fields, and then an informal tour of the proof in \\cite{Feng20} and \\cite{CF}."
  },
  {
    "date": "2026-02-17",
    "title": "Magnetically assisted spin-resolved electron diffraction: Coherent control of spin population and spatial filtering",
    "authors": "Sushanta Barman, Kuldeep Godara, Sudeep Bhattacharjee",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.15615v1",
    "source": "arXiv",
    "abstract": "Electron diffraction from nanogratings provides a platform for free-electron interferometry, yet controlled manipulation of electron spin in such geometries remains largely unexplored. In particular, the role of the self-generated magnetic field arising from electron motion and the feasibility of coherent spin control without disrupting diffraction coherence have not been quantitatively investigated. In this article, a self-consistent Maxwell-Pauli framework is developed to study spin-resolved electron diffraction from nanogratings in the presence of magnetic fields. The model incorporates geometric confinement, image-charge interactions, self-generated magnetostatic fields, and externally applied magnetic fields. Numerical simulations show that the intrinsic magnetic self-field produced by the electron probability current is several orders of magnitude too weak to induce measurable spin mixing, demonstrating that nanogratings act as spin-conserving beam splitters under field-free conditions. When a uniform magnetic field is applied upstream of the nanograting, coherent Larmor precession enables controlled spin rotation without modifying the diffraction geometry or degrading coherence. The magnetic field required for a $π$ spin rotation scales inversely with the interaction length and electron de Broglie wavelength $λ_{dB}$. Furthermore, a downstream nonuniform magnetic field applied after the nanograting imparts a spatially varying Zeeman phase, producing opposite transverse momentum shifts for the two spin components. The spin-dependent transverse dynamics is analyzed using Husimi Q-function phase-space maps, which visualize spin-dependent population redistribution and momentum separation. The proposed approach enables tunable spatial separation of spin-resolved free electron beams and establishes an all-magnetic route for coherent spin rotation, control, and interferometry."
  },
  {
    "date": "2026-02-17",
    "title": "Fast computation of temperature and polarization coupling matrices",
    "authors": "Georgia Kiddier, Steven Gratton",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.15605v1",
    "source": "arXiv",
    "abstract": "We present a fast and exact method for computing CMB mode-coupling matrices based on an optimised evaluation of Wigner-3j symbols. The method exploits analytic structure in the relevant Wigner-3j symbol configurations appearing in temperature and polarization coupling matrices, expressing all required quantities in terms of a small set of recurrence-generated values which are precomputed and stored in lookup tables. This approach reduces the computational cost of constructing the full coupling matrices whilst maintaining numerical accuracy. We demonstrate the performance of the threej_cosmo implementation using realistic survey masks from current CMB experiments. Relative to standard recursion-based approaches used in existing pseudo-C_l pipelines, the method achieves speedups of 6-25x in practical coupling-matrix constructions, with the largest gains occurring at high multipoles. The algorithm admits efficient parallelisation on both CPUs and GPUs, the latter providing additional acceleration, up to a further order of 50 on modern hardware, without altering the underlying formalism. Beyond full matrix construction, the approach is naturally suited to applications in which only a restricted set of l3 modes is required for each (l1,l2) pair, such as in the computation of band-limited coupling matrices and analytic covariance terms. These features make threej_cosmo a practical backend for pseudo-C_l estimation and related calculations in next-generation CMB analysis pipelines."
  },
  {
    "date": "2026-02-17",
    "title": "Aligned and misaligned metallicity gradients in young stars and star-forming regions in the EAGLE discs",
    "authors": "Isha Shailesh, Patricia B. Tissera, Emanuel Sillero",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.15604v1",
    "source": "arXiv",
    "abstract": "Disc galaxies exhibit radial metallicity gradients in both their stellar and gaseous components. The star-forming gas (SFG) in HII regions and young stars (YSs) trace the recent evolutionary history of the galaxy. We aim to assess the extent to which the joint analysis of metallicity gradient alignment in YSs and SFG can constrain the recent evolutionary history of galaxies. Using the high-resolution run of the EAGLE project, we derived radial, azimuthally averaged oxygen abundance profiles for YSs (age < 2 Gyr) and SFG and measured their gradients as the slopes of linear fits to these profiles. We classified galaxies into four groups based on the signs (N for negative and P for positive) of the slopes: NN, NP, PP, and PN (the first letter is for YSs and the second for SFG). We found that galaxies with NN, NP, PP, and PN combinations of metallicity profiles reflect different evolutionary paths over the past ~ 2 Gyr. NN galaxies exhibit sustained inside-out growth accompanied by high star formation efficiency, whereas NP and PP systems show evidence of recent or ongoing feedback-driven disruption, with PP galaxies likely being predominantly shaped by supernova feedback. PN galaxies, by contrast, show evidence of past violent events followed by gradient recovery, highlighting the interplay between inflows, feedback, and gas cooling in shaping metallicity distributions. The degree of alignment between the stellar and gas metallicity gradients provides a way to time the occurrence of significant events in the evolutionary history of galaxies, which contribute through a combination of gas inflows, star formation triggering, and metal mixing. They could also serve as probes of sub-grid physics when observations provide suitable comparison datasets. [Abridged]"
  },
  {
    "date": "2026-02-17",
    "title": "Influence of the Inhalation Route on Tracheal Flow Structures in Patient-Specific Airways using 3D PTV",
    "authors": "Benedikt H. Johanning-Meiners, Luca Mayolle, Dominik Krug, Michael Klaas",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.15599v1",
    "source": "arXiv",
    "abstract": "The tracheal flow field shapes particle transport into the lower airways and thus influences both the spread of inhaled pathogens and the effectiveness of aerosol-based therapies. Identifying how different inhalation routes modify the flow field is therefore crucial for understanding lower-airway disease transmission and for guiding targeted drug delivery. To gain a detailed understanding of the influence of the inhalation route on the flow structures in the human trachea, the flow field in the trachea is investigated in vitro in a non-compliant, refractive-index matched silicone model of the human respiratory tract. The investigations comprise steady inhalation, and oscillatory flow to simulate calm breathing. A realistic breathing pattern is approximated by a sinusoidal waveform for two Reynolds numbers of $Re_{Tr} = [400, 1200]$, based on the bulk velocity at maximum volume flux and the hydraulic diameter of the trachea and two Womersley numbers of $Wo = [3, 4.5]$, representing the oscillation time scales. To capture the inherently three-dimensional and asymmetric nature of the flow field, 3D particle-tracking velocimetry measurements are performed using the Shake-The-Box algorithm. Using a refractive-index matched fluid consisting of water and glycerin, the complex flow structures inside the trachea are fully resolved. The PTV measurements confirm that the nasal and/or oral cavity must be considered when analyzing the flow field in the lower respiratory tract. In particular, we find that the presence of both cavities significantly alters the flow field compared to idealised, fully developed inflow conditions. However, velocity profiles in the sagittal and coronal plane in the trachea as well as contour plots of the of the normalized velocity magnitude evidence nearly identical flow structures for oral and nasal inhalation, indicating minimal influence of the inhalation route."
  },
  {
    "date": "2026-2-17",
    "title": "About Swami Vivekanand Shikshan Sanstha",
    "authors": "N/A",
    "publish": "2025 IEEE International Conference on Blockchain and Distributed Systems Security (ICBDS)",
    "url": "https://doi.org/10.1109/icbds67396.2025.11376737",
    "source": "IEEE",
    "abstract": null
  },
  {
    "date": "2026-2-17",
    "title": "Copyright Page",
    "authors": "N/A",
    "publish": "2025 IEEE Pune Section International Conference (PuneCon)",
    "url": "https://doi.org/10.1109/punecon67554.2025.11377783",
    "source": "IEEE",
    "abstract": null
  },
  {
    "date": "2026-2-17",
    "title": "CCPQT 2025 Cover Page",
    "authors": "N/A",
    "publish": "2025 IEEE 4th International Conference on Computing, Communication, Perception and Quantum Technology (CCPQT)",
    "url": "https://doi.org/10.1109/ccpqt66408.2025.11382837",
    "source": "IEEE",
    "abstract": null
  },
  {
    "date": "2026-2-17",
    "title": "Table of Contents",
    "authors": "N/A",
    "publish": "2025 2nd International Conference on Intelligent Systems for Cybersecurity (ISCS)",
    "url": "https://doi.org/10.1109/iscs69371.2025.11386177",
    "source": "IEEE",
    "abstract": null
  },
  {
    "date": "2026-2-17",
    "title": "LLM and AI Agents for Autonomous Systems: A Survey of Applications, Datasets, and Security Challenges",
    "authors": "Mohamed Amine Ferrag, Abderrahmane Lakas, Norbert Tihanyi, Merouane Debbah",
    "publish": "IEEE Open Journal of Intelligent Transportation Systems",
    "url": "https://doi.org/10.1109/ojits.2026.3665677",
    "source": "IEEE",
    "abstract": "The rapid integration of Large Language Models (LLMs) into autonomous systems marks a significant transition from modular, rule-based approaches to reasoning-driven, agent-based, and multimodal intelligence. LLM reasoning enables adaptive decision-making, context-aware planning, and human-aligned interaction, while AI agents extend these capabilities into structured autonomy pipelines that coordinate perception, reasoning, and control. These advancements are particularly critical in safety-sensitive domains such as autonomous driving (AD) and unmanned aerial vehicles (UAVs). This survey provides a comprehensive review of LLM reasoning and AI agents across scenario generation, decision-making, multimodal perception, cooperative V2X interactions, and UAV swarm autonomy. We examine the role of simulation platforms and datasets, including CARLA, Apollo ADS, AirSim, nuScenes, DriveLM, and emerging synthetic environments, in supporting reproducible evaluation and benchmarking. In addition, we analyze pressing security and robustness challenges, including adversarial prompt injection, data poisoning, multimodal perturbations, privacy leakage, and vulnerabilities in cooperative agent communication. Finally, we propose future research directions including adversarially robust pipelines, hybrid symbolic LLM planning, secure multimodal fusion, privacy-preserving human alignment, distributed trust mechanisms for swarm autonomy, and optimized Drone-LLM deployment across on-drone, edge, and cloud environments. By unifying applications, datasets, benchmarks, reasoning, agents, and security, this survey establishes a roadmap for developing robust, trustworthy, and secure LLM-enabled autonomous systems."
  },
  {
    "date": "2026-2-17",
    "title": "Three-level noise-tolerance granular-ball distinguishing measures and feature subset selection",
    "authors": "Zhehuang Huang, Yongxi Chen, Jinjin Li",
    "publish": "IEEE Transactions on Fuzzy Systems",
    "url": "https://doi.org/10.1109/tfuzz.2026.3665578",
    "source": "IEEE",
    "abstract": "Uncertainty modeling with different granularity structures is a research hotspot in granular computing. However, most granularity-related uncertainty measures lack effective means to represent and exploit the inherent granularity information in data, making it difficult for them to capture the distribution characteristics of samples and causing noise samples in high-aggregation regions to be misidentified. Meanwhile, they rarely involve noise-resistance mechanisms and struggle to accurately characterize the differences between samples in strongly disturbed environments, resulting in sensitivity to noise and insufficient robustness. Motivated by these issues, we investigate a novel granular-ball distinguishing measure that enhances noise-resistance on three levels: the algebraic perspective (dependency function), information theory (variable-precision entropy), and granular-ball computing (granulation mechanism). To this end, we define a relative-distance fuzzy similarity relation that fully considers local and global data distribution, thus effectively mitigating the influence of noise and outliers. A relative-distance granular-ball dependency function is then introduced by means of the relative-distance fuzzy similarity relation and fuzzy decision. Moreover, several granular-ball fuzzy entropy measures are presented, incorporating a variable-precision view to flexibly deal with noise and uncertainty. Finally, a granular-ball distinguishing measure is presented to comprehensively evaluate the distinguishing ability of candidate features. From the view of maintaining the classification ability, we further developed a heuristic feature selection algorithm with the distinguishing measure. Numerical experiments on 18 benchmark datasets demonstrate the effectiveness and robustness of the proposed model, as well as its superiority over six state-of-the-art comparative algorithms."
  },
  {
    "date": "2026-2-17",
    "title": "Copyright Page",
    "authors": "N/A",
    "publish": "2025 International Conference on Future Telecommunications and Artificial Intelligence (IC-FTAI)",
    "url": "https://doi.org/10.1109/ic-ftai67960.2025.11384321",
    "source": "IEEE",
    "abstract": null
  },
  {
    "date": "2026-2-17",
    "title": "Table of Contents",
    "authors": "N/A",
    "publish": "2025 International Conference on Artificial Intelligence and Technological Solutions (ICAITech)",
    "url": "https://doi.org/10.1109/icaitech66481.2025.11387731",
    "source": "IEEE",
    "abstract": null
  },
  {
    "date": "2026-2-17",
    "title": "2025 5th International Conference on Power System and Energy Internet (PoSEI)",
    "authors": "N/A",
    "publish": "N/A",
    "url": "https://doi.org/10.1109/posei67825.2025",
    "source": "IEEE",
    "abstract": ""
  },
  {
    "date": "2026-2-17",
    "title": "2025 International Conference on Intelligent Control and Computing Science (ICICCS)",
    "authors": "N/A",
    "publish": "N/A",
    "url": "https://doi.org/10.1109/iciccs67942.2025",
    "source": "IEEE",
    "abstract": ""
  },
  {
    "date": "2026-2-17",
    "title": "ICIPW 2025 Committees",
    "authors": "N/A",
    "publish": "2025 IEEE International Conference on Image Processing Workshops (ICIPW)",
    "url": "https://doi.org/10.1109/icipw68931.2025.11386320",
    "source": "IEEE",
    "abstract": null
  },
  {
    "date": "2026-2-17",
    "title": "Strategies for decentralised UAV-based collisions monitoring in rugby",
    "authors": "Yu Cheng, Harun Šiljak",
    "publish": "IEEE Internet of Things Journal",
    "url": "https://doi.org/10.1109/jiot.2026.3665829",
    "source": "IEEE",
    "abstract": "Recent advancements in unmanned aerial vehicle (UAV) technology have opened new avenues for dynamic data collection in challenging environments, such as sports fields during fast-paced sports action. For the purposes of monitoring sport events for dangerous injuries, we envision a coordinated UAV fleet designed to capture high-quality, multi-view video footage of collision events in real-time. The extracted video data is crucial for analyzing athletes’ motions and investigating the probability of sports-related traumatic brain injuries (TBI) during impacts. This research implemented a UAV fleet system on the NetLogo platform, utilizing custom collision observation algorithms to compare against traditional TV-coverage strategies. Our system supports decentralised data capture and autonomous processing, providing resilience in the rapidly evolving dynamics of sports collisions. The collaboration algorithm integrates both shared and local data to generate multi-step analyses aimed at determining the efficacy of custom methods in enhancing the accuracy of TBI prediction models. Missions are simulated in real-time within a two-dimensional model, focusing on the strategic capture of collision events that could lead to TBI, while considering operational constraints such as rapid UAV maneuvering and optimal positioning. Preliminary results from the NetLogo simulations suggest that custom collision record methods offer superior performance over standard TV-coverage strategies by enabling more precise and timely data capture. This comparative analysis highlights the advantages of tailored algorithmic approaches in critical sports safety applications."
  },
  {
    "date": "2026-2-17",
    "title": "GenSTEG: A Light and Scalable Trinary-Based Encryption with Multimodal Generative Steganography",
    "authors": "K M Kaushal Karthik, R Ramesh",
    "publish": "IEEE Access",
    "url": "https://doi.org/10.1109/access.2026.3665790",
    "source": "IEEE",
    "abstract": "The increasing demand for robust and scalable encryption algorithms is driven by rapid advancements in computing technology, and emerging technologies like quantum cryptanalysis pose significant threats to information security. This paper presents a novel trinary-based multistage encryption algorithm designed for scalability and enhanced security through the use of the less-explored trinary number system. By leveraging a dynamically adapting, pseudo-random, multi-dimensional key space and high diffusion transform, the algorithm introduces significant resistance to common attacks. Additionally, two innovative generative steganography schemes are proposed that algorithmically generate unique musical compositions or chess positions directly from the ciphertext. The overall algorithm operates at linear complexity, which ensures optimal performance. To contextualize practicality, the system is benchmarked against established lightweight cryptographic baselines, and a dataset of 1000 plaintext–ciphertext pairs has been publicly released to support independent analysis. Ultimately, this work presents a complete and flexible framework that uniquely combines a novel cipher with generative steganography, offering a robust and efficient system."
  },
  {
    "date": "2026-2-17",
    "title": "EW2A: Evolutionary Window Attention Adaptation for Medical Image Segmentation",
    "authors": "Haonan Mei, Yao Zhou",
    "publish": "IEEE Transactions on Emerging Topics in Computational Intelligence",
    "url": "https://doi.org/10.1109/tetci.2026.3663485",
    "source": "IEEE",
    "abstract": "Medical image segmentation is a critical yet challenging task due to the intricate anatomical structures, low contrast, and high noise levels inherent in medical images. Leveraging the inductive bias for spatial locality, window attention-based Transformer models have demonstrated significant promise in advancing image analysis tasks. However, the reliance on manually tuned window attention mechanisms limits their adaptability to varying feature modeling requirements and the unique challenges posed by medical imaging, resulting in suboptimal performance. In this paper, we propose evolutionary window attention adaptation (EW2A), a novel method specifically designed to overcome these challenges. In particular, a window attention-based supernet architecture is constructed firstly, where its search space focuses on two key aspects: optimal shift sizes for the window attention mechanism and effective upsampling strategies for the decoding process. Then, an adaptive Swin Transformer block and an adaptive upsampling block are built to enable the adaptability for effectively capturing both global and local contexts. Lastly, an evolutionary search algorithm is introduced to systematically explore the search space, identifying the optimal architecture that is highly effective for handling medical image segmentation tasks. Experimental results on benchmark medical image segmentation datasets demonstrate the effectiveness of EW2A, outperforming other competing approaches."
  },
  {
    "date": "2026-2-17",
    "title": "Optimal Tracking Control of Switched Nonlinear Systems Based on Prescribed Performance",
    "authors": "Di Cui, Siyu Liu, Li Ma, Chuang Ma, Kun Jiang, Ruibing Li",
    "publish": "2025 International Conference on Intelligent Control and Computing Science (ICICCS)",
    "url": "https://doi.org/10.1109/iciccs67942.2025.11382253",
    "source": "IEEE",
    "abstract": "This paper focuses on the optimal control problem for switched systems. By utilizing the terminal sliding mode control method and prescribed performance technique, the proposed controller effectively ensures that switched systems achieves tracking control with a bounded convergence time. Besides, through a coupled mechanism of time-varying transformation and performance functions, the prescribed performance constraints are embedded into the optimal control framework, thereby simultaneously achieving controllable convergence accuracy and globally optimal energy consumption."
  },
  {
    "date": "2026-2-17",
    "title": "Performance Evaluation of an Optimised Aluminum–Copper Busbar Design for LV Distribution Panels",
    "authors": "Anzar Ali Zafar, Lala Rukh, Faisal Najam, Abdul Fatah, Kashif Aslam, Hafsa Ikram",
    "publish": "2025 9th International Conference on Environment Friendly Energies and Applications (EFEA)",
    "url": "https://doi.org/10.1109/efea67685.2025.11386162",
    "source": "IEEE",
    "abstract": "This paper focuses on the design of a Low Voltage distribution Panel. It is an 8-way 1000KVA panel having a rated current of up to 1400A. The panel features one incoming and eight outgoing circuits, using a compact design with a combination of aluminium (Al) and copper (Cu) busbars to minimise theft risk and reduce overall costs. Additionally, the panel features an optimised busbar layout that reduces the overall temperature rise. The fibre-reinforced polymer (FRP) has been opted for in the fabrication of the panel body to minimise noise, eddy current, and hysteresis losses. Along with this panel design, a previous experimental design of a panel is also discussed in the study. A detailed comparison between the proposed and previous panel designs is given for a better interpretation of the results. Through these design choices, the panel demonstrates improved efficiency, safety, and cost-effectiveness, which can be implemented in various commercial and industrial setups."
  },
  {
    "date": "2026-2-17",
    "title": "Vision Transformers-Enhanced Signal Denoising System for Robust 6G Communication",
    "authors": "Anurag Vijay Agrawal, Pechetti Girish, S. Gomathy, A. Kistan, S.Nooray Sashmi, JoshuvaArockia Dhanraj",
    "publish": "2025 2nd International Conference on Artificial Intelligence and Knowledge Discovery in Concurrent Engineering (ICECONF)",
    "url": "https://doi.org/10.1109/iceconf65644.2025.11379533",
    "source": "IEEE",
    "abstract": "The accelerated development of 6 G communication networks requires high-order signal denoising methods that would be able to work in extremely noisy, multipath fading, and high-mobility environments. The present paper suggests a Vision Transformers-Enhanced Signal Denoising System, which uses a Hierarchical Vision Transformer (ViT) architecture with self-supervised pretraining and federated fine-tuning. The method takes advantage of hierarchical attention to learn local distortions of wireless signals, as well as global dependencies, and self-supervised learning minimizes the need to use labeled data, leading to increased flexibility to novel channel scenarios. Federated fine-tuning also provides privacy preserving updates of models between heterogeneous edge devices. The system, implemented based on the Hugging face Transformers ecosystem and PyTorch Lightning, shows better performance compared to CNN, GAN, and GNN-based baselines and provides better SNR improvement, BER decrease, and lower processing latency. It has been experimentally shown that the proposed system provides a scalable, robust, and efficient solution, which makes Vision Transformers one of the enabling factors of a reliable 6G communication system."
  },
  {
    "date": "2026-2-17",
    "title": "Harnessing Transformers for Accurate Tea Leaf Disease Detection in Precision Agriculture",
    "authors": "S. Sheeba, C. Saranyaa, R. Vinoth, M. Harivarman",
    "publish": "2025 5th International Conference on Evolutionary Computing and Mobile Sustainable Networks (ICECMSN)",
    "url": "https://doi.org/10.1109/icecmsn68058.2025.11383021",
    "source": "IEEE",
    "abstract": "Tea (Camellia sinensis) leaf disease poses an impact on the plant growth, functionality and agricultural sustainability. In countries such as India, the cultivation marks a major economic importance, contributing significantly to the GDP growth. Detection of diseases in the early stage will provide crucial disease management and ideal tea production. Visual inspection is traditional practice for the disease identification but they are prone to errors, not scalable for large plantation and are labor extensive. To these challenges, this study proposes a transfer learning-based approach for automated tea leaf disease detection. The key contributions of the work include, a) utilization of publicly available dataset for training and evaluation, b) development of customized transfer learning models based on EfficientNet B7, MobileNetV2, Diseases of the tea plant have a major impact on the yield and quality of tea produced worldwide. Therefore, to guarantee sustained cultivation and avoid financial losses, early and precise detection is crucial. Thus, incorporation of parameter optimization and fine-tuning strategies to enhance classification performance. Experimental results demonstrate that the proposed approach achieves an average accuracy of 96% significantly outperforming conventional methods, providing a robust solution for precision agriculture and sustainable tea production."
  },
  {
    "date": "2026-2-17",
    "title": "AI-Driven Framework for Automated On-Tree Orange Sizing",
    "authors": "Mohamed Tawfik, Wael Badawy",
    "publish": "2025 International Conference on Future Telecommunications and Artificial Intelligence (IC-FTAI)",
    "url": "https://doi.org/10.1109/ic-ftai67960.2025.11384711",
    "source": "IEEE",
    "abstract": "This study introduces a novel AI-driven framework for automated orange fruit size estimation using convolutional neural networks (CNNs) combined with explainable AI (XAI) techniques. The proposed model classifies orange sizes into discrete categories (small, medium, large) based on high-resolution RGB images, achieving over 95 % classification accuracy. Our system leverages the YOLO (You Only Look Once) object detection family (YOLOv8 through YOLOv12) for fruit localization and bounding box regression, coupled with Grad-CAM for interpretability. Comparative experimental results demonstrate YOLOv12 offers superior detection precision and recall at the cost of significantly increased inference time. Furthermore, we incorporate realfield dataset annotations aligned with ground-truth measurements to validate model robustness. The explainable outputs provide critical insights into the visual features driving model predictions, making the system both transparent and trustworthy. This research advances post-harvest automation and contributes significantly to smart agriculture applications by offering a scalable, interpretable, and accurate solution for citrus fruit grading."
  },
  {
    "date": "2026-2-17",
    "title": "Net-Zero Pathways and the Future of GB Electricity Transmission Networks",
    "authors": "Shengming Cao, Runsheng He, Waqquas Bukhsh",
    "publish": "2025 9th International Conference on Environment Friendly Energies and Applications (EFEA)",
    "url": "https://doi.org/10.1109/efea67685.2025.11386142",
    "source": "IEEE",
    "abstract": "The UK government set a legally binding net-zero greenhouse gas emission target aiming for a fully decarbonized energy system by 2050. Achieving this will require major reforms in the electricity market. However, a clear, officially recognized pathway to decarbonization has yet to be provided. Several research organizations including the Energy Systems Catapult, the National Energy System Operatthe Centere Center for Alternative Tech and the Climate Change Committee have proposed decarbonization pathways. Although these pathways differ in their assumptions and approaches, they all anticipate a significant increase in both electricity demand and renewable generation. In these scenarios, electricity generation is projected to increase by 51% to 160% by 2050, creating both opportunities and challenges for the power transmission network of GB. In this study, we employ a modeling framework to examine the potential impacts of these decarbonization policies on the Great Britain electricity transmission system up to 2050. We identify likely congestion points and critical transmission lines under the predicted growth in load and generation across all seven pathways, providing information to support planning for a resilient and low-carbon electricity network."
  },
  {
    "date": "2026-2-17",
    "title": "Unmasking the Masked: A Classical Machine Learning Pipeline for Detecting Forged Receipts",
    "authors": "Marita J Neerakan, T Sudhakar, J Logeshwaran",
    "publish": "2025 International Conference on NexGen Networks and Cybernetics (IC2NC)",
    "url": "https://doi.org/10.1109/ic2nc67409.2025.11376086",
    "source": "IEEE",
    "abstract": "The abundance of digital and paper document forgery requires strong automated detection tools against financial fraud. This research provides a classical machine learning method for forged receipt detection using multimodal features from image and text modalities. The approach entailed designing a feature set to obtain textural and statistical attributes from receipt images via Local Binary Patterns (LBP) and Canny edge detection, along with structural features obtained from the associated text files. Another demanding issue in this area is the excessive class imbalance between genuine and forged documents. To overcome this issue, Synthetic Minority Over-sampling Technique (SMOTE) is used to create a balanced training dataset. The models are assessed using the macro F1-score, precision, recall, PR AUC and ROC AUC to address class imbalance. The enhanced detection of the minority class is achieved using SMOTE, while hyperparameter tuning leads to the improvements in performance. The final Tuned Support Vector Machine model achieves a macro F1-score of 0.5429, and it has the highest recall on forged receipts, demonstrating that it detects more histories of tampered documents effectively. This research sets a good baseline for receipt forgery detection and emphasizes that class imbalance solving is a key towards creating a working system."
  },
  {
    "date": "2026-2-17",
    "title": "To Analyse Synthetic Pomegranate Disease Images Using Dual GAN-Diffusion Based Learning for Efficient Disease Detection",
    "authors": "Rutuja S. Magar, Deepali V. Patil, Swati Sharma",
    "publish": "2025 IEEE Pune Section International Conference (PuneCon)",
    "url": "https://doi.org/10.1109/punecon67554.2025.11379810",
    "source": "IEEE",
    "abstract": "Pomegranate is a high-value fruit crop widely cultivated in arid and semi-arid regions. Yet, its productivity is severely constrained by diseases such as healthy fruit rot, Wilt disease, and minor Infections. Early and accurate detection of these diseases is essential for sustainable farming, but the lack of large-scale, balanced, and high-quality datasets limits the performance of existing machine learning models. To address this challenge, we propose a novel synthetic dataset generated through a Dual GAN-Diffusion-based generative learning framework. The method combines the diversity of Generative Adversarial Networks (GANs) with the high-fidelity refinement of Diffusion Models to create realistic and class-balanced images of pomegranate diseases. The dataset comprises <tex xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">$\\text{1 1, 2 5 0}$</tex> images across four categories, including both real and synthetic samples, standardized at <tex xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">$256 \\times 256$</tex> resolution. To ensure reliability, the generated images were validated using quantitative metrics such as Freshet Inception Distance (FID), Structural Similarity Index (SSIM), and Peak Signal-to-Noise Ratio (PSNR), along with qualitative expert agronomist evaluation. Experimental results demonstrate that models trained on the augmented dataset achieve an <tex xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">$\\text{8 - 1 2 \\%}$</tex> improvement in classification accuracy compared to training on real images."
  },
  {
    "date": "2026-2-17",
    "title": "Evaluating the Performance of AI Text Detectors, Few-Shot and Chain-of-Thought Prompting Using DeepSeek-Generated Text",
    "authors": "Hulayyil Alshammari, Praveen Rao",
    "publish": "2025 International Workshop on Artificial Intelligence and Education (WAIE)",
    "url": "https://doi.org/10.1109/waie67422.2025.11381091",
    "source": "IEEE",
    "abstract": "Large Language Models (LLMs) have rapidly transformed the creation of written materials, raising questions about writing integrity and driving the development of Artificial Intelligent (AI) detection technologies. This paper investigates whether six generally accessible AI detection tools-AI Text Classifier, Content Detector AI, Copyleaks, QuillBot, GPT-2, and GPTZero-can consistently recognize text generated by DeepSeek, a recently published LLM. We further investigated DeepSeek’s ability to classify AI vs. human text using few-shot and Chain-ofThought (CoT) prompting techniques. Previous studies, mainly on ChatGPT and other well-known LLMs, have shown that detection accuracy varies significantly among different tools. However, there is a clear void in the literature, given the paucity of information available about DeepSeek. We collected 49 humanauthored question-answer pairs from pre-LLM sources and generated matching responses using DeepSeek to close this gap, hence producing 49 AI-generated samples. Next, we paraphrased 49 of these samples to examine whether content alteration affects detection results. While QuillBot and Copyleaks obtain nearperfect recognition rates for original and paraphrased DeepSeek text, other tools, particularly AI Text Classifier and GPT-2, struggle to show consistent detection performance. The few-shot and chain-of-thought techniques yielded very high accuracy in classification. The findings highlight the need for continuous improvements in AI content identification and urge users in research, professional, and educational settings to exercise caution when relying on current detection tools. This paper builds on and extends existing work by evaluating the new LLM DeepSeek and highlighting its implications for integrity and content verification in an increasingly digital environment."
  },
  {
    "date": "2026-2-17",
    "title": "Athletes’ Perceptions and Intentions to Use ChatGPT for Workout Plans",
    "authors": "Ben Oliver D. Tutor, Erick Voltaire P. Tabing, Milpert John B. Maroto, Jacklyn Judith Junio, Joan Javen",
    "publish": "2025 International Workshop on Artificial Intelligence and Education (WAIE)",
    "url": "https://doi.org/10.1109/waie67422.2025.11381133",
    "source": "IEEE",
    "abstract": "This study explored athletes’ perceptions and behavioral intention to use ChatGPT for planning their workouts, using the Technology Acceptance Model (TAM) as its theoretical underpinning. Specifically, it examined the relationships among perceived ease of use, perceived usefulness, and behavioral intention to adopt ChatGPT as a tool for designing training routines. A total of 338 student-athletes from various sports disciplines participated in the study. A researcher-developed survey instrument, validated by experts and pilot-tested for reliability, was used to collect data. Descriptive statistics revealed that athletes were generally uncertain about ChatGPT’s ease of use and usefulness for workout planning. Spearman’s rho correlation analysis indicated significant and strong positive relationships between perceived usefulness and behavioral intention and between perceived ease of use and behavioral intention. These findings suggest that although athletes are familiar with technology in general, they have not fully explored the use of generative AI tools like ChatGPT in the context of fitness planning. The study highlights the importance of increasing awareness and guided use of ChatGPT to support its adoption in athletic training, particularly for those with limited access to professional coaching."
  },
  {
    "date": "2026-2-17",
    "title": "Confidential Data Aggregation in IoT Systems: Ensuring Privacy Without Compromising Utility",
    "authors": "Apoorva Talwar, Pradeep Semwal, Ravi Singh, Pardeep Kumar, GD Makkar, Pratham Verma, Nitesh Kumar",
    "publish": "2025 IEEE Pune Section International Conference (PuneCon)",
    "url": "https://doi.org/10.1109/punecon67554.2025.11378771",
    "source": "IEEE",
    "abstract": "The widespread integration of Internet of Things (IoT) devices has had a significant impact on many facets of contemporary society, leading to the emergence of intelligent home automation systems. However, concerns about data privacy, security, and social consequences have also followed the increased use of IoT technologies. The primary objective of this research thesis is to analyse and provide workable solutions for the complex issues associated with IoT-based applications, namely in the field of smart home automation. The study starts by thoroughly analysing popular Internet of Things (IoT) devices, paying particular attention to security vulnerabilities and potential attack locations. Vulnerabilities can be found and suitable mitigation techniques can be developed by thoroughly examining the firmware of the device, communication protocols, authentication procedures, and encryption methods."
  },
  {
    "date": "2026-2-17",
    "title": "Smart Learning Environment Design: AI Enhanced Drone Photogrammetry Systems for Participatory Architectural Education",
    "authors": "Jordi Rábago, Antonio Juárez, Lesly Pliego",
    "publish": "2025 International Workshop on Artificial Intelligence and Education (WAIE)",
    "url": "https://doi.org/10.1109/waie67422.2025.11381177",
    "source": "IEEE",
    "abstract": "This study demonstrates the educational potential of integrating artificial intelligence (AI) with drone photogrammetry in architectural education through a participatory learning approach. Conducted within the course “Investigación y Proyecto Arquitectónico” at Tecnologico de Monterrey, the research involved architecture students using advanced technologies to analyze segregated urban areas in Mexico. The methodology employed DJI Phantom 4 RTK drones equipped with high-resolution cameras to capture comprehensive aerial imagery, processing 747 images covering $0.195 \\mathrm{~km}^{2}$ with $2.15 \\mathrm{~cm} /$ pixel ground sampling distance. Data was processed using Pix4D software integrated with AI technologies including convolutional neural networks (CNNs), SuperPoint/SuperGlue networks, and PointNet++ for enhanced spatial analysis. Educational outcomes were measured using the Motivated Strategies for Learning Questionnaire (MSLQ), revealing high intrinsic motivation (M=6.57, SD=0.53) and extrinsic motivation (M=6.43, SD=0.79) among participating students. The study demonstrates that AI-enhanced drone photogrammetry not only improves technical competencies but also fosters critical thinking, data interpretation, and systems understanding essential for modern urban planning practice."
  },
  {
    "date": "2026-2-17",
    "title": "Performance Benchmarking of Machine Learning, Deep Learning, and Transformer Models for Context-Aware Sentiment Analysis on Informal Social Media Text",
    "authors": "Muhammad Awais, Khawaja Muhammad Anees",
    "publish": "2025 International Conference on Engineering &amp;amp; Computing Technologies (ICECT)",
    "url": "https://doi.org/10.1109/icect66235.2025.11381692",
    "source": "IEEE",
    "abstract": "Popularity of Natural Language Processing (NLP) has been increasing because of its importance while dealing with social media when sentiment analysis is required to enable machines to read and comprehend human sentiments in written data. Different machine learning, deep learning and transformer-based models are implemented in this study with the aim of sentiment analysis. Tf-idf (Term Frequency-Inverse Document Frequency) and Bow (Bag of Words) techniques were used to process text while performing analysis. We compared different machine learning (Naive bayes, SVM), deep learning (CNN, LSTM), and transformer (BERT, GPT, Roberta) models to carry out context-sensitive sentiment analysis on 100 k Twitter post. Performance bechnmarking and evalaution of Models was carried out based on Accuracy, Precision, Recall, F1, ROC-AUC and training time. The highest accuracy was reported by RoBERTa (93.2%), followed by BERT (91.8%), GPT (90.1%), LSTM (88.4%) and CNN (85.3%). SVM and Naive Bayes were at the bottom with accuracies of 82.6% and 78.2%. Findings indicate the benefit of contextual transformers on informal, sarcasm-prone text, at the cost of a trade-off in training cost. Although, the great accuracy of machine learning models, it is was not easy to gauge and comprehend instances of sarcasm, irony and other forms of contextual slangs in written comments. The study also proposes sentiment analysis on multilingual and multimodal materials which would combine text, images, speech and videos. We are optimistic that in future we will be able to implement lightweight transformers such as distilbert and albert that do not need much memory but their work will be as accurate as before."
  },
  {
    "date": "2026-2-17",
    "title": "Curriculum Learning in Medical Image Analysis",
    "authors": "Riadh Meghatria, Djamel Gaceb, Fayçal Touazi",
    "publish": "2025 International Conference on Artificial Intelligence and Innovative Applications (AIIA)",
    "url": "https://doi.org/10.1109/aiia68273.2025.11383658",
    "source": "IEEE",
    "abstract": "Deep learning has revolutionized medical image analysis (MIA), offering unprecedented capabilities in diagnostics, prognosis, and treatment planning. However, its full potential is constrained by inherent challenges of medical data, including scarcity of large-scale annotated datasets, significant class imbalance, and the lack of model robustness to data distribution shifts. Curriculum learning (CL), a training paradigm inspired by human pedagogy, addresses these challenges by systematically structuring the learning process from easy to hard examples. This study presents a domain-focused review of CL in MIA. We synthesize how CL has been applied across diverse medical imaging tasks such as lesion detection, segmentation, and disease staging, demonstrating consistent gains in efficiency, robustness, and predictive accuracy. To provide structure to this field, we compile a taxonomy that categorizes CL approaches by their underlying difficulty criteria and learning paradigms. We further discuss open challenges and highlight promising avenues for future research, including the use of large pre-trained models, multi-modal data integration, and federated learning. By consolidating current evidence and perspectives, this study offers researchers and practitioners a comprehensive resource on CL in medical imaging and underscores its potential to advance clinically reliable AI systems."
  },
  {
    "date": "2026-2-17",
    "title": "Advancements in Ovarian Cancer Subtype Classification and Outlier Detection: A Comprehensive Survey of Machine Learning Approaches and Clinical Applications",
    "authors": "P.Rama Mohanrao, G. Zayaraz",
    "publish": "2025 2nd International Conference on Intelligent Systems for Cybersecurity (ISCS)",
    "url": "https://doi.org/10.1109/iscs69371.2025.11385986",
    "source": "IEEE",
    "abstract": "Ovarian cancer is a very heterogeneous disease and, therefore, it is difficult to diagnose, which makes it necessary to clearly categorize the subtype in order to achieve further progress in patient care. The existing classification systems do not effectively use large amounts of molecular and clinical data, uncovering the best performance in the detection of cancer subtypes and in the detection of outliers. The presented literature review presents more than 20 articles published between 2000 and 2024 to review the latest methods of machine learning in the process of classifying subtypes of ovarian cancer and detecting outliers. The major shortcoming of current models is that they do not effectively combine multi-omics data, including genomic, transcriptomic and proteomic profiles, which are essential in improving the accuracy of the classification. Also, current methods of outlier detection often fail to focus on the clinical importance of uncommon subtypes of ovarian cancer, which may be deprived of significant information about the disease. This review will systematize the recent studies in three key directions: (1) development of sophisticated classification algorithms based on extensive molecular and clinical data, (2) development of new outlier detection algorithms to detect rare or unusual cases, and (3) the use and validation of machine learning models in clinical care. The two methodologies are considered based on the ability of the approach to generate clinically actionable information, and to improve individualized treatment plans specifically. Through the evaluation of these developments, this survey shows that the state-of-the-art machine learning solutions can help to fill existing gaps in the classification of subtypes of ovarian cancer and detecting outliers. It further pre-empts the work to come to incorporate computational models into practical clinical environments to eventual enhancements in the accuracy of diagnosis and improved patient outcomes by means of precision medicine."
  },
  {
    "date": "2026-2-17",
    "title": "Design and Implementation of a Conversational AI Platform for Medical Appointment Management",
    "authors": "Chithirala Bala Subramanyam, Garimidi SubbaRao, Kannekanti Maanasa, Juttu Suresh, P. Venkateswarlu Reddy, D. Ganesh",
    "publish": "2025 5th International Conference on Evolutionary Computing and Mobile Sustainable Networks (ICECMSN)",
    "url": "https://doi.org/10.1109/icecmsn68058.2025.11382638",
    "source": "IEEE",
    "abstract": "In this work, design and implemention of a Conversational AI Platform of Medical Appointment Management that will be automated to schedule patients with the help of Natural Language Processing (NLP) and intelligent scheduling algorithms. The system is built on the Rasa framework and connected with a real-time database, MySQL, which provides users with the possibility to book, reschedule, and cancel the appointments using natural dialogue. Experimental analysis on 200 simulated interactions showed that it decreased the time to book by 72 percent, reduced no-show rates by 37 percent, and increased user satisfaction by 24 percent over manual procedures. The findings affirm that conversational AI can be a significant contributor to operational efficiency and patient participation in the e-health setting."
  },
  {
    "date": "2026-2-17",
    "title": "Architectural Design of an Asymmetric Wargaming System Based on Intelligent Blue Force",
    "authors": "Xin Yang, Shu-Hong Liu, Yan-Lin Wu, Rui Tang",
    "publish": "2025 6th International Conference on Artificial Intelligence and Computer Engineering (ICAICE)",
    "url": "https://doi.org/10.1109/icaice68195.2025.11382265",
    "source": "IEEE",
    "abstract": "This paper addresses the asymmetric wargaming environment found in command support exercises, such as those for information and communications, where the Red and Blue sides possess different service branch identities and missions. It analyzes the challenges faced by traditional wargaming due to the lack of a professional Blue Force. To enhance the realism and effectiveness of these exercises, this paper proposes an architectural design for an asymmetric wargaming system based on an intelligent Blue Force. This architecture integrates key modules for intelligent Blue Force generation, asymmetric rule modeling, dynamic environmental interaction, and multidimensional evaluation. By constructing an intelligent Blue Force with an asymmetric cognitive model, a hybrid decision engine, and a continuous learning mechanism, and by designing rules and environments that support cross-domain confrontation, this system aims to provide a highly realistic, intensely competitive, and professional opposition environment for the Red side, who participates as support personnel. This environment effectively trains and hones the Red side's capabilities in information support and system protection."
  },
  {
    "date": "2026-2-17",
    "title": "A Population-Based Computational Framework for Analyzing and Mitigating Project Management Delays in Smart Grid Development",
    "authors": "Ijaz Ahmed, Muhammad Asif, Muhammad Khalid",
    "publish": "2025 IEEE PES 17th Asia-Pacific Power and Energy Engineering Conference (APPEEC)",
    "url": "https://doi.org/10.1109/appeec66370.2025.11382089",
    "source": "IEEE",
    "abstract": "This paper highlights the significance of bi-objective optimization in project management and the potential of dynamic programming approaches to simplify complex industrial management situations. The study investigates the relationships between variables inside systems by employing algorithmic comparisons and the analytic hierarchy approach, so offering valuable insights into the efficacy of project management. The statistics reveals a stark reality: a mere 20.5% of projects are finished prior to the designated date. The occurrence of delays in most projects underscores the importance of project managers employing bi-objective optimization methodologies. To deal with the inherent challenges and uncertainties, the study suggests implementing a wide range of these tactics, which will ultimately enhance the success rates of projects."
  },
  {
    "date": "2026-2-17",
    "title": "A Scalable Hybrid LES-ANN Framework for Wake Prediction in Yawed Wind Turbine Arrays",
    "authors": "Kiran Perkins, Mahdi Erfanian Nakhchi",
    "publish": "2025 9th International Conference on Environment Friendly Energies and Applications (EFEA)",
    "url": "https://doi.org/10.1109/efea67685.2025.11386411",
    "source": "IEEE",
    "abstract": "This study presents a scalable hybrid framework combining Large Eddy Simulation (LES) and Artificial Neural Networks (ANNs) for fast and accurate prediction of yawed wind turbine wakes. High-fidelity LES using the Actuator Disk Method (ADM) was conducted for tandem NREL-5MW turbines under yaw angles of 0°–40° and spacings of 3D–10D. The resulting velocity fields trained spacing-specific ANNs with adaptive yaw-weighted loss functions. The networks reproduced LES wake structures with mean relative errors below 7% while reducing computation time from 17.2 hours per LES run to 0.16 seconds. The model accurately captured wake deflection, recovery, and velocity deficits across configurations, achieving a 400,000× speed-up over LES. This hybrid LES-ANN framework offers a robust and computationally efficient tool for large-scale wind farm optimisation and wake control analysis."
  },
  {
    "date": "2026-2-17",
    "title": "Sparse Matrix Factorization for Scalable Machine Learning in Cloud Environments",
    "authors": "Srinivasu Yalamati",
    "publish": "2025 International Conference on NexGen Networks and Cybernetics (IC2NC)",
    "url": "https://doi.org/10.1109/ic2nc67409.2025.11376338",
    "source": "IEEE",
    "abstract": "Demand for intelligent and versatile resource management techniques has increased with the proliferation of cloud computing and acceleration of industry adoption of microservice-style architectures. Dynamic, heterogenous, and dynamic workloads encountered by large-scale cloud systems are commonly not appropriate to be served by classic static or rule-based orchestration systems. AISF is a decentralized intelligent orchestration architecture that exploits predictive modeling and mutants-enabled deep reinforcement learning for contextually-aware, real-time resource allocation. In order to forecast load dynamics and dynamically re-distribute resources automatically using hierarchical control loops, including always evaluating system telemetry data, the AISF architecture makes use of learning agents that are deployed directly at service fabric level. AISF surpasses other baselines that include static-auto scaling and single-agent reinforcement learning in Google Cluster Workload Traces. It maintains 98.6% SLA satisfaction and demonstrates up to 25% resources saving, 40% latency reduction, and 21.9% energy expenditure mitigation. The model also possesses advantages of the better scalability, faster policy convergence, fault tolerance through distributed multi-agent coordination. AISF realizes energy-efficient and greening of cloud by the help of prediction with energy-awareness to stimulate carbon-conscious operation. The proposed solution positions AI as a fundamental power supply for future intelligent infrastructure management solutions and is a major step toward self-learning, self-healing, and self-optimization in the cloud."
  },
  {
    "date": "2026-2-17",
    "title": "Behind the Words: Unmasking Bias Lurking in LLMs and Data",
    "authors": "Naina Dhingra, Gargi Kale, Harshada Chavan, Sandhya Arora",
    "publish": "2025 IEEE Pune Section International Conference (PuneCon)",
    "url": "https://doi.org/10.1109/punecon67554.2025.11378839",
    "source": "IEEE",
    "abstract": "This study examines hidden biases in large language models (LLMs). Three popular models-RoBERTa, BERT, and GPT-2-were evaluated using StereoSet, CrowS-Pairs, and Indian-BhED, datasets designed to expose biases. Our comparative analysis reveals clear variations in how these models encode and reproduce bias, underscoring the difficulty of mitigation. The results highlight the need for bias-aware evaluation. By contributing empirical evidence, this work advances the discussion on ethical AI and points to directions for building more responsible language technologies."
  },
  {
    "date": "2026-2-17",
    "title": "A Multi-Dimensional Extended TOF Material Classification Technique Based on Deep Convolutional Networks",
    "authors": "Lianzi Wang, Zhibin Liu, Miguel Heredia Conde",
    "publish": "2025 IEEE International Conference on Image Processing Workshops (ICIPW)",
    "url": "https://doi.org/10.1109/icipw68931.2025.11386042",
    "source": "IEEE",
    "abstract": "The multi-dimensional data acquired by a Time-of-Flight (ToF) camera successfully captures the material-dependent responses to modulated light, demonstrating excellent recognition performance in material classification tasks. Additionally, the material recognition technology integrated with deep learning has gradually become a focal point in current intelligent recognition research. However, when confronted with complex real material data exhibiting variable poses, the existing models reveal instability in the classification task. In response, we propose a multidimensional extended deep convolutional network for ToF-based material classification, building on our previous work. This approach incorporates observation angle information to enhance the ability to classify different materials while retaining the frequency domain information of the Fourier features, extends the dimension of features in the spatial domain and introduces a residual structure in the Convolutional Neural Network (CNN) to prevent the degradation of feature information. Through various analyses of multiple-materials datasets, we find that the method proposed in this paper achieves accurate real material classification by streamlining the network structure and reducing data processing."
  },
  {
    "date": "2026-2-17",
    "title": "Comparative Analysis of Fault Detection Techniques for Edge Enabled Smart Power Grids",
    "authors": "Jayashree Kulkarni",
    "publish": "2025 International Conference on NexGen Networks and Cybernetics (IC2NC)",
    "url": "https://doi.org/10.1109/ic2nc67409.2025.11376509",
    "source": "IEEE",
    "abstract": "The increasing complexity of modern power grids and utilization of renewable sources of energy necessitate faster and more reliable methods of fault detection. Conventional centralized monitoring tends to be delayed, suffers from bandwidth constraints, and is not scalable. Edge computing presents a convincing alternative due to data analysis near the source. This research explores how edge computing can enhance power grid fault detection, with an emphasis on how rapid fault detections are avoided. There is a comparison with conventional cloud-based systems with improved response times, energy consumption, and system reliability. Various fault detection methods, such as Wavelet Transform-based thresholding, Zscore anomaly detection, and Isolation Forest algorithm are compared. The performance indicates that although the Z-score did not detect transient disturbances and the Isolation Forest detected more anomalies (with more false advantages), the Wavelet Transform approach was the best performing and computationally most efficient for edge nodes and thus suitable for real-time fault detection in power networks."
  },
  {
    "date": "2026-2-17",
    "title": "Enhance Tool Invocation with Large Language Models through Cluster-Augmented Demonstration Sampling",
    "authors": "Guoliang Hu, Liang Qian, Houlong Xiong",
    "publish": "2025 IEEE 4th International Conference on Computing, Communication, Perception and Quantum Technology (CCPQT)",
    "url": "https://doi.org/10.1109/ccpqt66408.2025.11383431",
    "source": "IEEE",
    "abstract": "With the rapid development of large language models (LLMs), their integration with external tools has become a key research area, greatly enhancing their applicability in real-world scenarios. However, a core challenge lies in enabling LLMs to accurately and efficiently invoke these tools while adhering to precise structured output formats. Prevailing approaches, which predominantly depend on instruction tuning and reinforcement learning, often overlook the potential of in-context learning and exhibit limited generalization across diverse tools and contexts, underscoring the demand for more adaptable and robust solutions. To tackle this issue, we propose a novel framework that enhances tool invocation by combining clustering and retrieval strategy, namely cluster-augmented demonstration retrieval (CA-DR) mechanism that significantly improves the tool invocation accuracy, leading to an average 25.8% improvement in coarse-grained accuracy over baselines on ToolACE and BFCL benchmarks. By considering both the relevance and diversity of demonstrations, our approach effectively improves the few-shot capabilities of LLMs. Evaluation across multiple different types and scales of LLMs show that our method achieves relatively high tool invocation accuracy while maintaining high efficiency."
  },
  {
    "date": "2026-2-17",
    "title": "Design and Analysis of SRAM Circuits at 45nm Technology Using Sleeper Cells",
    "authors": "Niveditha, G K Shashank, R R Sumanth, Priyadarshini K Desai, N Hemanth Prasad",
    "publish": "2025 Second International Conference on Computing, Semiconductor, Mechatronics, Intelligent Systems and Communications (COSMIC)",
    "url": "https://doi.org/10.1109/cosmic67569.2025.11380847",
    "source": "IEEE",
    "abstract": "The VLSI technology has evolved from 180 nm to 45 nm technology. In this evolution process power consumption and delay reduction are considered to be major requirements to be met. Any VLSI circuit is made up of many subunits, but it is known that the memory unit is considered to be one among the circuits, that consume major power and are responsible for delay operation. The memory unit majorly requires hold time to switch between read and write operations; that is the reason why the memory unit consumes the most power. In order to reduce the power consumption and improve the speed, sleeper cells can be introduced. In this work, initially SRAM is constructed using 3T, 6T & 9T technology. The power and delay measurements for read, write, and hold are carried out. Further, sleeper cells are introduced. Basically, a sleeper cell is constructed using PMOS, NMOS, and a combination of both. Power and delay performance of the SRAM memory unit is done with the deployment of the sleeper cell, without affecting the read, write, and hold operation. Through the experimentation it observed that the impact of adding NMOS, PMOS, and a combination of both is a significant reduction in leakage power in the majority of setups, along with a noticeable increase in speed during read and write operations. The work concludes that the sleeper cell composed of NMOS and PMOS appeared to balance speed and power savings the best during the sleeper cell analysis process in comparison with sleeper cell designed exclusively by PMOS and NMOS. With the introduction of sleeper cells made up of both NMOS and PMOS, a 90% reduction in power leakage is achieved. The obtained results clearly show that the deployment of sleeper transistors in SRAM designs can result in a memory unit that is more energy-efficient for modern SoCs and portable electronics."
  },
  {
    "date": "2026-2-17",
    "title": "Intelligent Three-Phase Imbalance Optimization Considering Participation Willingness of Flexible Resources: A Deep Learning Approach",
    "authors": "Xin Chen, Zheling Zhou, Weisheng Xu, Hongshi Chen, Xiang Zheng, Yingmou Chen",
    "publish": "2025 13th International Conference on Smart Grid and Clean Energy Technologies (ICSGCE)",
    "url": "https://doi.org/10.1109/icsgce67490.2025.11380632",
    "source": "IEEE",
    "abstract": "With the rapid penetration of distributed energy resources and single-phase loads in distribution networks, three-phase imbalance has emerged as a critical power quality issue affecting system efficiency and equipment lifespan. Traditional imbalance mitigation approaches often overlook user participation willingness and the heterogeneous characteristics of different flexible resources, leading to suboptimal performance and low user satisfaction. This paper proposes an intelligent three-phase imbalance optimization method that considers the participation willingness of various flexible resources including residential air conditioners, commercial air conditioners, electric vehicles, water heaters, and distributed energy storage systems. A Long Short-Term Memory neural network is employed to predict user participation willingness based on historical behavior patterns, economic incentives, and temporal characteristics. A multi-objective optimization framework is developed to balance imbalance mitigation and user comfort through coordinated control strategies. The proposed elastic willingness guidance mechanism dynamically adjusts incentive strategies based on three-phase imbalance severity levels. Simulation results on a typical distribution network demonstrate that the proposed method reduces three-phase imbalance violations while maintaining user comfort levels above acceptable thresholds, achieving improvements in power quality and user satisfaction compared to conventional approaches."
  },
  {
    "date": "2026-2-17",
    "title": "A Hybrid Explainable Deep Learning Model for Chronic Disease Risk Stratification using Multivariate Electronic Health Records",
    "authors": "T.Dhanalakshmi, Benasir Begam.F, K. Logu, A.Jegatheesan, Karpagam V, Narenthirakumar Appavu",
    "publish": "2025 5th International Conference on Evolutionary Computing and Mobile Sustainable Networks (ICECMSN)",
    "url": "https://doi.org/10.1109/icecmsn68058.2025.11383411",
    "source": "IEEE",
    "abstract": "This work aims to meet the need for easy risk rating in chronic diseases by proposing a time-based deep-learning technique for analysing large electronic health record, or EHR, data, therefore promoting equal medical access and sustainable healthcare innovation. It maintains openness and transparency while analysing the medical records of patients over an extended period to help predict how a disease will progress and figure out the best approach to break up patient groups according to risk. By involving chronology and attention mechanisms, the model can make precise predictions and offer medically relevant explanations for its decisions. Its efficacy in identifying high-risk patients and facilitating early intervention is demonstrated by research using actual EHR data. Additionally, by supporting AI-driven, accessible, and environmentally friendly medical solutions, it is appropriate for healthcare institutions with limited equipment and aligns with SDG 3 (Good Nutrition and Well-Being), SDG 9 (Industry, Innovation, as well as Infrastructures), as well as SDG 10 (Reduced Inequalities."
  },
  {
    "date": "2026-2-17",
    "title": "Early Detection of Apraxia of Speech in Children using MATLAB",
    "authors": "Dr Abha Dargar, Narisetty Gautam Babu, Somisetty Venakata Sumanth, Kosuri Satya Deeven Kumar",
    "publish": "2025 5th International Conference on Evolutionary Computing and Mobile Sustainable Networks (ICECMSN)",
    "url": "https://doi.org/10.1109/icecmsn68058.2025.11382894",
    "source": "IEEE",
    "abstract": "Childhood Apraxia of Speech (CAS) is a rare neurological disorder that impacts a child’s ability to coordinate the precise muscle movements required for speech. Detecting CAS at an early stage can significantly improve therapeutic outcomes. This paper presents a Convolutional Neural Network (CNN)-based approach for the automatic detection of Apraxia of Speech using spectrogram representations of children’s speech samples. The dataset consists of 150 audio recordings (100 normal and 50 apraxia), each 10-15 seconds long, processed in MATLAB. The system converts raw audio into standardized spectrogram segments and trains a CNN to classify them as either Normal or Apraxia. The model achieved an accuracy of 75–78%, showing that spectrogram-based CNN models can efficiently detect speech irregularities without handcrafted features like MFCCs. The results indicate the potential of deep learning-based speech analysis in assisting clinicians with early, objective, and automated diagnosis."
  },
  {
    "date": "2026-2-17",
    "title": "Domain-Adapted Video Frame Interpolation for Atmospheric Satellite Imagery",
    "authors": "Anson Saju George, T. Jemima Jebaseeli",
    "publish": "2025 International Conference on NexGen Networks and Cybernetics (IC2NC)",
    "url": "https://doi.org/10.1109/ic2nc67409.2025.11376065",
    "source": "IEEE",
    "abstract": "Video Frame Interpolation (VFI) is an essential method for improving scientific and atmospheric visuals. The advanced VFI models trained on general video datasets struggle when directly used on specialized satellite images because of a substantial domain shift. The non-linear, flexible movement of clouds and other atmospheric events create significant visual distortions and blurriness that conventional models struggle to manage. This research addresses this challenge. First, a baseline is established by demonstrating a well-known VFI model trained on generic data that fails to produce coherent results on the specialized Weather Map Service (WMS) imagery. Second, a robust and effective transfer learning framework is introduced. This involves fine-tuning the pre-trained model on the WMS dataset using a novel custom loss function specifically designed to address the non-rigid dynamics of the cloud motion. The experiments show a significant improvement in the performance for satellite imagery. This suggests a refined model that significantly diminishes artifacts and improves perceptual quality, surpassing the standard baseline by a considerable margin on quantitative measures such as PSNR and SSIM, along with visual comparisons in terms of quality. This study validates that domain adaptation is a significant phase for utilizing VFI in scientific contexts and offers a robust, demonstrable method for interpolating intricate atmospheric phenomena."
  },
  {
    "date": "2026-2-17",
    "title": "The Personalization-Privacy Paradox in AI-Driven E-Commerce: A Consumer Trust Perspective",
    "authors": "Dhrishya Shetty, D K Sreekantha",
    "publish": "2025 IEEE Pune Section International Conference (PuneCon)",
    "url": "https://doi.org/10.1109/punecon67554.2025.11378826",
    "source": "IEEE",
    "abstract": "Online shopping, the most widely used by people across the world. In this digital era, AI plays a very important role in online retail, specially in giving personalized experience to each customer. But it faces many challenges, one of which is privacy of customer information. The choices or information of the customer is a major concern in today's world. How the details of customers is being used to make personalised experiences. and also how their data is being stored. This causes conflict for marketers who have to balance privacy and the choices of customers. The key suggestions to build and retain customer trust by improving data handling transparency, using marketing methods that does cause discomfort to customers, and ensuring ethical data practices. The study goes through the importance of maintaining a balance between ethical and privacy standards and AI innovation."
  },
  {
    "date": "2026-2-17",
    "title": "Generative Adversarial Networks(GANs) for AI-Based Wireless Security Detection in Cloud Environments",
    "authors": "C. Nithyaprabha, M Keerthi, N Madesh, K Mathiarasu, R Naveenkumar",
    "publish": "2025 2nd International Conference on Intelligent Systems for Cybersecurity (ISCS)",
    "url": "https://doi.org/10.1109/iscs69371.2025.11386432",
    "source": "IEEE",
    "abstract": "The threat of cyberattacks is growing due to the wide use of wireless technologies in the cloud-based infrastructures that demand effective intrusion detection systems. The paper describes a Generative Adversarial Network (GAN)-based system of artificial intelligence (AI)-based wireless security monitoring that will be more accurate, scalable and able to respond in real-time. The model also requires a Wasserstein GAN with Gradient Penalty (WGAN-GP) structure to generate adversarial traffic patterns to provide a reasonable training of the discriminator that boosts its sensitivity to both known and zero-day threats. The experimental tests have shown that the suggested model has a detection accuracy of 96.8, an average inference time of 95 ms, and the detection latency is reduced by 34% relative to other traditional intrusion detection systems. In addition, the system identifies zero-day threats including spoofing and replay attacks with more than 90 percent completeness, which makes them resilient to dynamic threats. These findings confirm how GANs could be used to further enhance the security infrastructure in wireless, and users can count on these scalable and dependable infrastructures as a solution to the cloud-based network."
  },
  {
    "date": "2026-2-17",
    "title": "Design of Arbitrary-Ratio Microwave Power Divider Based on Artificial Neural Network",
    "authors": "Guo Cheng, Tongzhou Xiang, Jiani Xue, Jiale Gao, Cong Xu, Yanghui Wu",
    "publish": "2025 6th International Conference on Artificial Intelligence and Computer Engineering (ICAICE)",
    "url": "https://doi.org/10.1109/icaice68195.2025.11382227",
    "source": "IEEE",
    "abstract": "To simplify the design process of microwave power dividers, this paper proposes a deep neural network (DNN)-based design method for microwave power dividers with arbitrary power division ratios. Taking a one-to-sixteen Wilkinson power divider as an example, a data set containing characteristic parameters such as micro strip line width, length, and isolation resistor values is constructed through theoretical calculations and electromagnetic simulations. Using ADS(Advanced Design System) software, 700 sets of simulation data are generated, with port power distribution ratios, maximum insertion loss, and maximum voltage standing wave ratio (VSWR) as inputs, and characteristic parameters as outputs, to train four independent DNN models. Experimental results demonstrate that the proposed method effectively predicts the structural parameters of the power divider within the frequency range of 1.15–1.35 GHz. All performance metrics (insertion loss < 1 dB, VSWR < 1.5, isolation > 15 dB, phase balance ±5°) meet the design requirements, validating the feasibility and efficiency of neural networks in microwave device design."
  },
  {
    "date": "2026-2-17",
    "title": "A Study on the Application of YOLOPose in the Policing Psychological Training in Combat Situations",
    "authors": "Haitao Wang",
    "publish": "2025 6th International Conference on Artificial Intelligence and Computer Engineering (ICAICE)",
    "url": "https://doi.org/10.1109/icaice68195.2025.11382362",
    "source": "IEEE",
    "abstract": "A study on the application of YOLOPose in police psychological training in combat situations. Police tactical training, the posture of the trainee and clinical psychology is the focus of training, especially the trainee's posture changes can reflect the trainee's psychological situation, so as to find out the trainee's psycho-logical problems in the actual combat training, targeted adjustment of the training programme. The posture detection algorithm analyses the human body movement information in the image or video to extract the position and movement trajectory of the key points, so as to achieve the recognition and analysis of human body posture. It has important application value in many fields such as sports, traffic safety, medical treatment and so on, but there are few related researches in police tactical training, paper propose a research on the application of YOLOPose in police tactical training based on YOLOv5, to analyse the human body postures of the trainees in police tactical training, and to effectively improve the safety and timeliness of police tactical training. This gap highlights the need for intelligent, data-driven tools that can enhance the precision and safety of tactical training environments, where split-second decisions and accurate posture control are critical. The experimental conclusions show that the use of YOLOPose in police combat training can effectively detect the posture changes and psychological fluctuations of trainees, provide auxiliary decision-making for the detection of trainees' posture errors and clinical psychological problems, and significantly improve the safety and timeliness of police tactical training. By leveraging real-time pose estimation, the system aims to provide actionable feedback, reduce training injuries, and standardise tactical movements across different training scenarios."
  },
  {
    "date": "2026-2-17",
    "title": "Variational Bayesian Dehazing With Atmospheric Scattering Model for Synthetic-to-Real Generalization",
    "authors": "Stepan Babayan, Francisco Javier Sáez-Maldonado, Javier Mateos, Rafael Molina",
    "publish": "2025 IEEE International Conference on Image Processing Workshops (ICIPW)",
    "url": "https://doi.org/10.1109/icipw68931.2025.11385969",
    "source": "IEEE",
    "abstract": "Image dehazing is vital for enhancing visibility in applications like autonomous driving and surveillance, yet it remains challenging due to its ill-posed nature and the limitations of existing methods in real-world conditions. In this work, we introduce a variational Bayesian framework for single-image dehazing based on the atmospheric scattering model. Our approach effectively addresses complex haze characteristics, ensuring robust estimation of the haze-free image, transmission map, and atmospheric light. By integrating probabilistic deep learning with atmospheric scattering model-based techniques, our method, trained solely on synthetic data, achieves superior generalization on real-world datasets, outperforming state-of-the-art approaches trained on the same synthetic data and validated on both synthetic and real-world benchmarks."
  },
  {
    "date": "2026-2-17",
    "title": "Green Bond Default Risk Prediction Based on LSTM-Adaboost Classification Algorithm",
    "authors": "Juncheng Chen",
    "publish": "2025 6th International Conference on Artificial Intelligence and Computer Engineering (ICAICE)",
    "url": "https://doi.org/10.1109/icaice68195.2025.11382490",
    "source": "IEEE",
    "abstract": "Driven by the dual carbon goals, green finance has become a core force in promoting industrial structure upgrading and achieving ecological sustainable development. As a key tool for direct financing, the market size of green bonds has been steadily growing. However, as the issuers become increasingly diverse and the industry coverage continues to expand, some enterprises have encountered problems such as insufficient environmental protection information disclosure and a mismatch between ESG performance and financing purposes, gradually highlighting the default risk of green bonds. To this end, this paper proposes the LSTM-Adaboost fusion classification algorithm. Firstly, data features are mined through correlation analysis and violin graph analysis, and then comparative experiments are conducted with various machine learning algorithms such as decision tree, random forest, AdaBoost, KNN, XGBoost, and GBDT. The results show that the LSTM-Adaboost model performs the best in all evaluation indicators. The accuracy rate and recall rate both reach 86.5%, the precision rate is 83.7%, the F1 value is 83.8%, and the AUC value is 90.1%. The accuracy rate is 3 percentage points higher than that of the suboptimal GBDT model. It has significant advantages in the accuracy of positive and negative sample recognition, comprehensive classification efficiency and generalization ability. In the comparison models, GBDT performed outstandingly comprehensively, with XGBoost achieving an accuracy rate of 80.1%. However, the other models had performance shortcomings. This model, by integrating the sequence feature capture capability of LSTM with the integrated learning advantages of AdaBoost, effectively makes up for the deficiencies of traditional models in feature extraction depth and classification accuracy, providing an efficient technical solution for the precise prevention and control of green bond default risks. It has significant practical significance for consolidating the foundation of green finance development and ensuring the smooth progress of the dual carbon goals."
  },
  {
    "date": "2026-2-17",
    "title": "A Trajectory Planning and Control Method for Multi-Axis Synchronous Motion Scanning Mechanism",
    "authors": "Ai Zhang, Zhe Lin, Fengchao Liang, Lidong Jia, Jing Li, Xin Zhao, Yuanwei Jiu, Chao Zhang, Gang Huang",
    "publish": "2025 IEEE 4th International Conference on Computing, Communication, Perception and Quantum Technology (CCPQT)",
    "url": "https://doi.org/10.1109/ccpqt66408.2025.11382715",
    "source": "IEEE",
    "abstract": "High-precision scanning mechanisms are critical components in space remote sensing cameras. To meet the requirements of remote sensing imaging, this study addresses the challenges of decoupling and high-precision control in multi-axis synchronous scanning systems. Existing deviation coupling control strategies suffer from limited synchronization performance and coupled tracking-following dynamics. This paper proposes a high-precision decoupling control algorithm for multi-axis scanning mechanisms in space cameras. The algorithm eliminates the influence of follower-axis disturbances on the master-axis control, achieving excellent synchronization and high control accuracy. It is applicable to various types of multi-axis scanning mechanisms in space cameras."
  },
  {
    "date": "2026-2-17",
    "title": "A Reinforcement Learning Method for Cyber Range Cloud Resource Scheduling",
    "authors": "Hongbin Zhang, Haibin Zhang, Chaoyang Ye",
    "publish": "2025 6th International Conference on Artificial Intelligence and Computer Engineering (ICAICE)",
    "url": "https://doi.org/10.1109/icaice68195.2025.11382420",
    "source": "IEEE",
    "abstract": "Currently, cyber ranges play a vital role in scientific research, production, and technological development. A critical challenge in these environments lies in the efficient scheduling of cloud service resources and the rapid deployment of corresponding supporting architectures. With the proliferation of intelligent technologies, artificial intelligence has emerged as a powerful and adaptive alternative for job scheduling and resource management. To address the computational constraints of single-node cloud servers that limit task scalability, this paper proposes a robust reinforcement learning framework for resource scheduling in cloud server environments, designed to enhance task scheduling and management capabilities. First, a resource scheduling model is established to capture computational resource profiles and data flow characteristics. Next, a deep reinforcement learning algorithm is applied to optimize resource allocation, thereby improving processing efficiency for large-scale tasks. Experimental simulations demonstrate the effectiveness of the proposed approach."
  },
  {
    "date": "2026-2-17",
    "title": "SiC-Enabled DAB Converter for Battery Pack Active Balancing: Extensible Energy Management Framework for Electric Vehicles",
    "authors": "Guangze Sun, Dongze Li, Yunzhu Cao, Xusheng Wang, Abhisek Ukil, Akshya Swain",
    "publish": "2025 IEEE PES 17th Asia-Pacific Power and Energy Engineering Conference (APPEEC)",
    "url": "https://doi.org/10.1109/appeec66370.2025.11382149",
    "source": "IEEE",
    "abstract": "This paper proposes an extensible active balancing framework for electric vehicle (EV) battery packs that combines a dual active bridge converter based on silicon carbide switches (SiC-DAB) with a reconfigurable switching array. The system achieves coordinated control through proportional-integral (PI)- regulated phase-shift modulation and dynamic state-of-charge (SOC)-based battery pack selection for adaptive power allocation. Simulation results show that the system achieves an efficiency of 96% at 50 kHz operating frequency and equalizes the SOC of four series-connected packs within about 12 minutes. This research provides a high-power-density, high-efficiency bidirectional active balancing solution for multi-pack battery systems in next-generation EV platforms."
  },
  {
    "date": "2026-2-17",
    "title": "Expert Operational Gans: Towards Real-Color Underwater Image Restoration",
    "authors": "Ozer Can Devecioglu, Serkan Kiranyaz, Mehmet Yamac, Moncef Gabbouj",
    "publish": "2025 IEEE International Conference on Image Processing Workshops (ICIPW)",
    "url": "https://doi.org/10.1109/icipw68931.2025.11386072",
    "source": "IEEE",
    "abstract": "The wide range of deformation artifacts that arise from complex light propagation, scattering, and depth-dependent attenuation makes the underwater image restoration to remain a challenging problem. Like other single deep regressor networks, conventional GAN-based restoration methods struggle to perform well across this heterogeneous domain, since a single generator network is typically insufficient to capture the full range of visual degradations. In order to overcome this limitation, we propose xOp-GAN, a novel GAN model with several expert generator networks, each trained solely on a particular subset with a certain image quality. Thus, each generator can learn to maximize its restoration performance for a particular quality range. Once a xOp-GAN is trained, each generator can restore the input image and the best restored image can then be selected by the discriminator based on its perceptual confidence score. As a result, xOP-GAN is the first GAN model with multiple generators where the discriminator is being used during the inference of the regression task. Experimental results on benchmark Large Scale Underwater Image (LSUI) dataset demonstrates that xOp-GAN achieves PSNR levels up to 25.16 dB, surpassing all single-regressor models by a large margin even, with reduced complexity."
  },
  {
    "date": "2026-2-17",
    "title": "ASCID-Net: A Unified Framework for Joint Imputation and Classification with Few Labels",
    "authors": "Chun Xie, Zerui Li, Shumi Zhao",
    "publish": "2025 6th International Conference on Artificial Intelligence and Computer Engineering (ICAICE)",
    "url": "https://doi.org/10.1109/icaice68195.2025.11382535",
    "source": "IEEE",
    "abstract": "Classification on data with both missing values and few labels is a persistent challenge in machine learning. To address this, this paper proposes ASCID-Net, a novel semi-supervised framework that unifies imputation and classification in an end-to-end manner by learning the joint distribution of features and labels. The framework integrates three core components: a dynamic autoregressive modeler to learn the joint data distribution, a label-guided transformation network to enhance feature representations using label signals, and a hybrid semi-supervised trainer to effectively leverage unlabeled data. Experiments on public datasets demonstrate the effectiveness and competitive performance of the proposed approach."
  },
  {
    "date": "2026-2-17",
    "title": "CAN Data-Processing, Diagnosis and Firmware Flashing Application Implementation using Python",
    "authors": "Ved Singh, Dhirendra Singh, Sachin Parandekar, Rohit Adake, Steve Francis, Azhan Farooqui",
    "publish": "2025 IEEE Pune Section International Conference (PuneCon)",
    "url": "https://doi.org/10.1109/punecon67554.2025.11378782",
    "source": "IEEE",
    "abstract": "CAN is the networking system that a large number of vehicle categories utilize today because of its low cost, centralization and robustness. The CAN protocol is encapsulated within the ISO 11898 - (1 to 5). Raw CAN data however, is not usable for the end user. Most companies utilize DBC files to write debugging rules and utilize software to organize the processing of the data so as to be able to use the CAN logs for various applications (Fault Diagnosis, Preventative maintenance, AI related model training etc.). This paper focuses on a design workflow utilizing CAN python API's and Tkinter Design to construct an Executable that streamlines and simplifies this process so as to be able to be utilized by individuals with non-technical backgrounds."
  },
  {
    "date": "2026-2-17",
    "title": "Cross-Domain Computational Model: Joint Wavelet Subspace and Dual-Attention Mechanism for Hyperspectral Image Denoising",
    "authors": "Xinyi Li, Guangxian Xu, Fei Ma",
    "publish": "2025 IEEE 4th International Conference on Computing, Communication, Perception and Quantum Technology (CCPQT)",
    "url": "https://doi.org/10.1109/ccpqt66408.2025.11383435",
    "source": "IEEE",
    "abstract": "The hyperspectral imaging system is inevitably affected by sensor noise and environmental interference during data acquisition, leading to noise contamination in the raw data,which poses significant challenges to the accuracy of subsequent computational tasks.To address the limited local receptive field issue of traditional Transformers in high-dimensional tensor computations, this paper proposes a cross-domain computational model: a denoising method combining wavelet subspace decomposition with a dual-attention mechanism.The method adopts an encoder-decoder architecture, which decomposes the input features into four parallel computational subspaces through Discrete Wavelet Transform (DWT), with the low-frequency component (LL) serving as the computational unit for transmitting fundamental features.In the wavelet domain, we design a Cooperative Dual-mode Attention Transformer (CDA-Transformer) that effectively integrates spectral and spatial information. Through a dynamic weight allocation mechanism, it achieves coordinated optimization of global context and local details. Experimental results on both ICVL and Urban datasets demonstrate that the proposed model delivers superior performance in denoising tasks."
  },
  {
    "date": "2026-2-17",
    "title": "AI-Driven Cybersecurity: Predictive Insights Into Attack Patterns and Effective Preventive Strategies",
    "authors": "Suhas Chavan, Rajneeshkaur Sachdeo",
    "publish": "2025 IEEE International Conference on Blockchain and Distributed Systems Security (ICBDS)",
    "url": "https://doi.org/10.1109/icbds67396.2025.11378233",
    "source": "IEEE",
    "abstract": "The tremendous growth of digital technology transformed several domains, making them increasingly susceptible to a growing spectrum of cyber-attacks. This paper investigates the multifacted picture of cyberattacks, and specifically of the adversarial threats, which leverage vulnerabilities within AI systems. As cyber attackers become more and more sophisticated with their attacks, the old cybersecurity defenses become less effective, thus highlighting an increased need for implementation of more defensive strategies. This paper provides a survey about different types of cyberattacks such as phishing, ransomware and adversarial attacks, that affect Aidriven systems and shows their impacts on such systems. Furthermore, the paper investigates advanced AI approaches for threat detection and response such as ML and deep learning which are used for fast discovery and suppression of new cyber threats. The article also stresses that a defense-in-depth approach combining AI capabilities and conventional security policies is required to mitigate the attack surface. Finally, this research attempts to advance the broader discussion on computer security by shedding light on the perils from adversarial attacks and by offering practical prevention strategies."
  },
  {
    "date": "2026-2-17",
    "title": "Emergency Communication Command and Dispatch Method Based on AI Agent",
    "authors": "Chao Zhang, Donghao Li, Linuo Zhang, Bin Dong",
    "publish": "2025 6th International Conference on Artificial Intelligence and Computer Engineering (ICAICE)",
    "url": "https://doi.org/10.1109/icaice68195.2025.11382333",
    "source": "IEEE",
    "abstract": "Emergency communication plays a vital and irreplaceable role in rescue and disaster relief. When natural disasters or emergencies occur, whether communication is unobstructed directly affects the success or failure of rescue operations and the safety of people's lives. Monitoring and early warning, and resource allocation play a crucial role in emergency communication, rescue, and disaster relief. Traditional emergency communication has the pain points of manual information capture and unintelligent command and dispatch. This paper designs an AI agent for emergency communication command and dispatch, which provides capabilities such as intelligent screening and identification of emergency communication information, information integration and association, intelligent dispatch of personnel and materials, decision support for command and dispatch, and automatic dispatch of emergency work orders. Meanwhile, a new emergency communication command and dispatch process was designed based on the proposed agent, which realized the automatic generation of emergency briefings, the automatic generation and dynamic adjustment of dispatch plans, and the automatic distribution of emergency work orders. The efficiency of emergency briefing editing and command and dispatch plan generation was increased by 82%, and the input of emergency communication on-duty personnel was reduced."
  },
  {
    "date": "2026-2-17",
    "title": "Multifunctional Landscapes and AI Validation as a Strategy to Enhance Creative Place-Making in Urban Voids",
    "authors": "Sahar Sadegh Malakabadi",
    "publish": "2025 2nd International Conference on Artificial Intelligence and Knowledge Discovery in Concurrent Engineering (ICECONF)",
    "url": "https://doi.org/10.1109/iceconf65644.2025.11379542",
    "source": "IEEE",
    "abstract": "Urban voids fragment the city fabric and erode civic identity, yet they also represent untapped opportunities for transformative urban design. This research demonstrates how multifunctional landscapes serve as powerful catalysts for urban revitalization by enhancing placemaking value in neglected spaces. Using a Tehran case study, rigorous statistical analyses were employed to identify critical design elements that significantly elevate community engagement and spatial cohesion. Water features emerged as the most influential design component <tex xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">$\\mathrm{F}(2,320)=51.943;\\mathrm{p} &lt;$</tex>. 001, followed by artistic activities and social gathering spaces, elements that collectively achieved the highest placemaking scores (Mean = 32.565, n <tex xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">$=85)$</tex>. The strong correlation between water features and placemaking success illustrates deep cultural connections to the Persian garden tradition. This study provides empirical evidence that context-sensitive, multifunctional landscape strategies can optimize ecological services, strengthen social bonds, and enhance economic vitality, transforming problematic urban voids into vibrant community assets that advocate sustainable urban development."
  },
  {
    "date": "2026-2-17",
    "title": "Speed Control of DC Motor with Microcontroller Using Hand Gestures",
    "authors": "T.D. Sudhakar, R Nitish, H Aqeel, M Mohamed Askar, R R Prajesh, K Boopathy",
    "publish": "2025 2nd International Conference on Artificial Intelligence and Knowledge Discovery in Concurrent Engineering (ICECONF)",
    "url": "https://doi.org/10.1109/iceconf65644.2025.11379445",
    "source": "IEEE",
    "abstract": "This paper explores an innovative approach to adjusting the DC motor speed by hand gestures detected through a laptop camera, integrating image processing and microcontroller technology. Traditional methods of motor speed control often rely on physical interfaces like knobs, switches, or keypads. However, the proposed system leverages computer vision to interpret real-time hand movements, which are processed through software to generate appropriate signals. These indications are transmitted to a microcontroller (such as an Arduino), which adjusts the motor's speed via a motor driver. The goal is to generate a touch-free, intuitive control mechanism which enhances user interaction and reduces mechanical wear from physical components."
  },
  {
    "date": "2026-2-17",
    "title": "Anomaly-Oriented Multi-Class Intrusion Detection Using Machine Learning and Ensemble Methods",
    "authors": "Arya Jadhav, Aadi Parkhi, Manas Bhise, Shrey Bhandari, Amar Buchade, Santosh Kumar",
    "publish": "2025 IEEE International Conference on Blockchain and Distributed Systems Security (ICBDS)",
    "url": "https://doi.org/10.1109/icbds67396.2025.11378109",
    "source": "IEEE",
    "abstract": "This study evaluates six intrusion detection models using the UNSW-NB15 dataset, which serves as a modern benchmark encompassing diverse attack types and authentic traffic conditions. We analyze four traditional classifiers (Random Forest, XGBoost, SVM, and Logistic Regression), one deep learning approach (MLP + Autoencoder), and a stacking ensemble featuring RF, XGB, and SVM as base models with XGBoost as the meta model. Surprisingly, although ensemble and deep models are highly complex, Random Forest attained top macro-F1 and accuracy, especially performing well on minority classes. Preprocessing methods such as SMOTE and one-hot encoding played a significant role in feature balancing and encoding. Results point to RF as a robust, interpretable baseline. Future directions are diverse ensembles, hybrid DLML frameworks, and explainable AI."
  },
  {
    "date": "2026-2-17",
    "title": "A Lightweight Real-Time Dual-Metric System for Bicep Curl Form Correction",
    "authors": "Pradyumna Wagholikar, Ravindra B. Murumkar",
    "publish": "2025 International Conference on NexGen Networks and Cybernetics (IC2NC)",
    "url": "https://doi.org/10.1109/ic2nc67409.2025.11376139",
    "source": "IEEE",
    "abstract": "Correct execution of strength-training exercises is critical for maximizing performance and minimizing injury risk. Automated systems that can monitor posture and provide immediate feedback are therefore of increasing importance in fitness applications. This research presents a real-time, vision-based system for the analysis and correction of bicep curl form, utilizing the MediaPipe Pose framework for landmark detection. The primary contribution is a dualmetric evaluation method that concurrently assesses the elbow flexion angle and the spatial stability of the elbow joint. This method enables the real-time identification of biomechanical errors, such as excessive joint displacement, while tracking repetitions based on adherence to a target angular range. The efficacy of this approach is validated through a quantitative analysis of captured motion data, which demonstrates a clear correlation between decreased joint stability and the terminal phases of flexion and extension. The framework operates in real time on standard consumer hardware, demonstrating the potential of lightweight vision-based systems for accessible fitness training."
  },
  {
    "date": "2026-2-17",
    "title": "Face Clustering Based on Local Identity Relation Estimation and Conservative Edge Expansion",
    "authors": "Jong-Hyeon Baek, Yeong Jun Koh",
    "publish": "2025 IEEE International Conference on Image Processing Workshops (ICIPW)",
    "url": "https://doi.org/10.1109/icipw68931.2025.11386429",
    "source": "IEEE",
    "abstract": "Face clustering aims to group unlabeled face images into identity-consistent clusters and is essential for large-scale face retrieval and dataset construction. However, existing graph-based methods often suffer from false positive connections and limited recall in complex feature spaces. This paper introduces a robust face clustering framework that addresses these challenges through two key components. First, the proposed local identity relation estimation network (LIRENet) verifies edge reliability by modeling both local context and identity-level interactions. Second, a neighborhood edge extension module adaptively expands the graph using shared neighbor constraints and similarity thresholds. The combination of these components enhances connectivity prediction while preserving cluster quality. Experimental results on MS-Celeb-1M, IJB-B, and DeepFashion demonstrate consistent improvements over previous state-of-the-art methods on both closed- and open-set benchmarks."
  },
  {
    "date": "2026-2-17",
    "title": "Intelligent Route Optimization Framework with IoT Integration for Efficient Waste Collection Trucks",
    "authors": "Nivethitha T, Abinav G, Dhanushwaran S, Gowshik M, Hanshan Kumar B, Hariharan S",
    "publish": "2025 5th International Conference on Evolutionary Computing and Mobile Sustainable Networks (ICECMSN)",
    "url": "https://doi.org/10.1109/icecmsn68058.2025.11382586",
    "source": "IEEE",
    "abstract": "Inefficient collection of the traditional waste is based on fixed routes and schedules with overflowing bins, fuel wastage and higher costs. In this paper, a proposal will be provided regarding an Internet of Things (IoT) intelligent route optimization framework that utilizes real-time sensor data, machine learning predictions, and dynamically planned routes. The system utilizes the ultrasonic and MQ-135 gas sensors to measure the fill and odor levels on waste containers that are connected to ESP32 microcontrollers. A real-time dashboard is available on a Flask basis and offers administration. A nearest-neighbor greedy algorithm is used to perform route optimization with a Haversine distance calculation and bin fill-time prediction is done with a Random Forest Regressor model using various environmental and temporal features. The finding of simulation shows that efficiency of routes can improve by 15-30 percent, using resources can be saved, and functioning can improve, which opens the way towards sustainable smart city waste management."
  },
  {
    "date": "2026-2-17",
    "title": "Location-Supported Lesions Representation with Potato Leaf Blight Disease Detection Using Dual-Head Convolutional Neural Network",
    "authors": "Y. V. Bhaskar Reddy, Imad Shalout, K. Latha, Rajkumar Bhookya, Swathi B, R. Premkumar",
    "publish": "2025 2nd International Conference on Artificial Intelligence and Knowledge Discovery in Concurrent Engineering (ICECONF)",
    "url": "https://doi.org/10.1109/iceconf65644.2025.11379652",
    "source": "IEEE",
    "abstract": "A deep learning framework designed for classifying potato leaf blight diseases using the Plant Village Dataset, we developed the Location-Supported Lesions Representation with Potato Leaf Blight Disease Detection Using Dual-Head Convolutional Neural Network (LLPLDC) model which consists of 2,152 processed images. To improve model generalization and tackle data imbalance, the dataset undergoes noise removal and augmentation. A Diffusion-based IGN-Net generates synthetic images of diseased leaves from healthy ones, the DH-CNN features dual outputs: one for identifying healthy versus diseased leaves and another for differentiating between early and late blight. Training utilizes stochastic gradient descent with learning rate adjustments and ReLU activations, enhancing classification accuracy. The confusion matrix, training and validation loss and accuracy of DHCNN and ROC curve are used to calculate the performance of LLPLDC."
  },
  {
    "date": "2026-2-17",
    "title": "“CryptoKalp”: A Tool for Cryptocurrency Investigation",
    "authors": "Sanjita Jain, Rupprashik Khare, Samyak Lahire, Chaitali Patil",
    "publish": "2025 IEEE International Conference on Blockchain and Distributed Systems Security (ICBDS)",
    "url": "https://doi.org/10.1109/icbds67396.2025.11376940",
    "source": "IEEE",
    "abstract": "There are more than over 23,000 cryptocurrencies” in existence which represent one of the biggest unregulated markets across the globe. Currently, each cryptocurrency utilises distinct public-private key and public address formats. This diversity complicates the investigator's task of tracing and verifying a suspect's involvement in cryptocurrency-related crimes. Moreover, law enforcement agencies such as the police frequently seize digital devices, generating digital disk images for investigation which is a time consuming process. Thus, the investigation of cryptocurrencies has emerged as a major challenge. for law enforcement agencies across the world. Our proposed solution “CryptoKalp” aims to combat cybercrimes involving cryptocurrencies. The essence of our proposed tool is encapsulated in its name: “CryptoKalp.” The name is a fusion of two significant terms - “crypto,” signifying cryptocurrency, and “kalp,” a Sanskrit word representing investigation [1]. Our proposed tool makes the investigation process quicker by taking digital images, strings, various formats of files and folders as input and utilising a comprehensive database of regular expressions covering various cryptocurrency public-private key and address formats. Currently, our tool successfully identifies Bitcoin public-private keys and addresses from text files, with future plans outlined expanding its capabilities for Ether, Tether, Monero, Dash and Dogecoin. Investigating officers can access the system's user-friendly interface and the database containing login credentials, cryptocurrency formats, and history of searched strings, which enables officers to track a specific criminal associated with a series of crypto transactions. Police can confirm whether a suspect is involved in cryptocurrency transactions and take necessary actions. Our solution will aid law enforcement authorities in combating cybercrime."
  },
  {
    "date": "2026-2-17",
    "title": "Unlocked Learning: How Educators Navigate AI in Open Education Spaces",
    "authors": "Abdelhak Senadjki, Hui-Nee Au Yong, Iddrisu Mohammed Awal, Samuel Ogbeibu",
    "publish": "2025 International Workshop on Artificial Intelligence and Education (WAIE)",
    "url": "https://doi.org/10.1109/waie67422.2025.11381122",
    "source": "IEEE",
    "abstract": "With the changing face of open learning because of the involvement of artificial intelligence (AI), the education sector is presented with new possibilities and intricate ambiguities. Although most of the existing discussions focus on technological innovation, the opinions of educators, who are the ones who are experiencing the influence of AI in pedagogy and access, have not been voiced yet. The proposed research seeks to address the question of how teachers of various backgrounds view and experience the use of AI in the open learning setting. A qualitative research design was used to gather data using in-depth interviews and focus group discussions with 30 educators selected in terms of disciplines, institutions, and regions. Five major themes have been uncovered: (1) AI tools are perceived as a means to improve administrative efficiency but not to substitute pedagogical judgment; (2) there are concerns about algorithmic bias, learner data privacy, and cultural neutrality; (3) AI-driven platforms can create digital divides unless equitably deployed; (4) educators want to have more agency and training in the adoption of AI; and (5) attitudes and preparedness toward AI depend heavily on disciplinary and regional contexts. The results indicate that inclusive AI policies should put a lot of emphasis on the voice of educators, contextual awareness, and lifelong learning. To make AI truly useful in open learning, systems should shift away from automation to supporting educators as co-designers of equitable, AI-enhanced learning."
  },
  {
    "date": "2026-2-17",
    "title": "AI based Assistive Device For Aphasia Elderly Patients",
    "authors": "N.N. Baalakumar, S. Prabakar, K.Mythili, N.Naveen, M.Sabharigirivasan, S.Mathan",
    "publish": "2025 5th International Conference on Evolutionary Computing and Mobile Sustainable Networks (ICECMSN)",
    "url": "https://doi.org/10.1109/icecmsn68058.2025.11382686",
    "source": "IEEE",
    "abstract": "Communication is a very crucial part of human interaction, and it enables people to express their ideas, wants, and feelings. Aphasia is a language disorder that is commonly caused by stroke or brain damages, which impairs speech comprehension and production, but cognitive and motor skills are generally unaffected. As a result, there are extreme communication barriers among the affected individuals in their everyday lives. This paper introduces an AI-supported communication system that combines the real-time hand gesture recognition with the text-to-speech features to support aphasic people. The Python based system which is implemented using OpenCV library uses a web camera to record and read the hand gestures, depending on the number of extended fingers. Every gesture is associated with a prepared verbal communication, e.g. one finger means I need water and two fingers I am hungry. The identified gestures are translated into audio both with the offline (pyttsx3) and online (Google Text-to-Speech) engines to provide the flexibility when different network conditions occur. The device is affordable, portable, and very easy to use and it only needs a normal computer and a webcam. It has a modular design whereby one can easily customize gestures and message mappings to suit personal requirements. The future products are to introduce machine learning based on dynamic gesture recognition, speech support in multiple languages and the implementation of the product on the mobile platform to increase its accessibility. The suggested system demonstrates the possibilities of computer and AI. mission to create all-inclusive, low-cost technologies that will contribute much to the quality of life of people with speech and language impairments."
  },
  {
    "date": "2026-2-17",
    "title": "Learning Single-Image Super-Resolution In The Jpeg Compressed Domain",
    "authors": "Sruthi Srinivasan, Elham Shakibapour, Rajy Rawther, Mehdi Saeedi",
    "publish": "2025 IEEE International Conference on Image Processing Workshops (ICIPW)",
    "url": "https://doi.org/10.1109/icipw68931.2025.11386224",
    "source": "IEEE",
    "abstract": "Deep learning models have grown increasingly complex, with input data sizes scaling accordingly. Despite substantial advances in specialized deep learning hardware, data loading continues to be a major bottleneck that limits training and inference speed. To address this challenge, we propose training models directly on encoded JPEG features, reducing the computational overhead associated with full JPEG decoding and significantly improving data loading efficiency. While prior works have focused on recognition tasks, we investigate the effectiveness of this approach for the restoration task of single-image super-resolution (SISR). We present a lightweight super-resolution pipeline that operates on JPEG discrete cosine transform (DCT) coefficients in the frequency domain. Our pipeline achieves a 2.6 x speedup in data loading and a 2.5 x speedup in training, while preserving visual quality comparable to standard SISR approaches."
  },
  {
    "date": "2026-2-17",
    "title": "Secure Healthcare Predictions via Homomorphic Encryption: A Privacy-Centric Framework",
    "authors": "Ashwini Kunal Bhavsar, Jaya Nag Mathur, Alaknanda S. Patil, Shweta G. Lilhare, Abhijit Hanumantrao Khadke, Vishal Borate",
    "publish": "2025 IEEE International Conference on Blockchain and Distributed Systems Security (ICBDS)",
    "url": "https://doi.org/10.1109/icbds67396.2025.11377403",
    "source": "IEEE",
    "abstract": "Providing privacy for data in healthcare analytics is a major challenge, especially when handling sensitive patient data. This paper introduces a privacy-preserving machine-learning framework utilizing Cheonimim Song (CKKS) Homomorphic Encryption to provide secure computation on encrypted medical data without divulging plaintext values. The proposed approach employs logistic regression to predict potential health risks with end-to-end encryption throughout the whole process. For additional protection of data in transit, a second level of Advanced Encryption Standard - Galois/Counter Mode (AES- GCM) encryption is applied. The experimental outputs demonstrate that the accuracy of the encrypted model is the same as the accuracy of the non-encrypted one, which confirms that homomorphic encryption may allow to do secure machine learning without significant performance degradation. Homomorphic encryption may increase the computation load, though; batch encoding and cipher text packing make it more efficient. These findings lead to the possibility of machine learning in encrypted medicine, and more research can be done to create safe medical AI systems."
  },
  {
    "date": "2026-2-17",
    "title": "Enhanced Underwater Image Visibility Using Adaptive Fusion Integrated with Local Intensity Filter",
    "authors": "Allaika Yadav, Dhruv Yadav, Sneha Arora, Vipin Kumar Sharma",
    "publish": "2025 IEEE Pune Section International Conference (PuneCon)",
    "url": "https://doi.org/10.1109/punecon67554.2025.11378210",
    "source": "IEEE",
    "abstract": "This paper introduces a revolutionary underwater image enhancement method that employs an adaptive fusion framework utilizing a local intensity filter. The suggested procedure centers upon improving regional contrast and luminance dispersal since it integrates block-oriented intensity modulation which is steered via adjacency data, and this curtails lingering mist plus ocular anomalies. Mean Squared Error (MSE) as well as Peak Signal-to-Noise Ratio (PSNR) were utilized such that performance metrics could be evaluated across four test images. The results depict that MSE diminishes by 13.3% on average while PSNR gains climb up to 1.9%, also PSNR values get to 79.13 dB in the best instance. Considerably, the procedure improved the MSE regarding Image 2 via 27.8% also heightened definition substantially while conserving border honesty. Improved visual outcomes strengthen these numerical enhancements. The procedure is simple and yields superior renovation, appropriate for instantaneous subaquatic imagery applications. It is furthermore helpful to preparation in nautical robotics, archaeological recording, and submerged monitoring."
  },
  {
    "date": "2026-2-17",
    "title": "Cognitive Cyber Armor: AI-Driven Resilience against Intelligent Threat Actors",
    "authors": "Mohammad Majharul Islam Jabed, Muntaha Islam, Lamia Akter, Sharmin Ferdous, Sakera Begum, Amit Banwari Gupta",
    "publish": "2025 2nd International Conference on Artificial Intelligence and Knowledge Discovery in Concurrent Engineering (ICECONF)",
    "url": "https://doi.org/10.1109/iceconf65644.2025.11379541",
    "source": "IEEE",
    "abstract": "Substantial advancement of cyberattacks necessitates smart defense systems that have the ability to adjust to changing threat horizons. The following paper is about Cognitive Cyber Armor, an AI-based resilience model that uses sophisticated learning methods to neutralize intelligent threat agents. The suggested algorithm combines the Robust PCA to pre-process the data to remove noise and improve the signal quality, mRMR to select the features and maximize the relevant characteristics, and a Graph Attention Network classifier to detect the malicious actions. The system is implemented in Python with PyTorch and PyTorch Geometric and is associated with high accuracy in detection and low false-positives but better interpretability with regard to attention-based graph modeling. The results of the experiments point to its effectiveness in eliminating redundancy, achieving processing speed, and maintaining a strong performance even in adversarial situations. Cognitive Cyber Armor can be used to develop a scalable defense paradigm by integrating resilience, adaptability, and explainability, further developing proactive approaches to cybersecurity to secure against intelligent and adaptable cyber threats against major infrastructures."
  },
  {
    "date": "2026-2-17",
    "title": "Analysis of Kannada Tweets for Depression using Machine Learning Models",
    "authors": "V D Praveen, K Soorya Krishna, Smeely Mary Picardo, Aishwarya, Prashanth Kannadaguli",
    "publish": "2025 Second International Conference on Computing, Semiconductor, Mechatronics, Intelligent Systems and Communications (COSMIC)",
    "url": "https://doi.org/10.1109/cosmic67569.2025.11380909",
    "source": "IEEE",
    "abstract": "The expanding role of social media has positioned platforms like X, Facebook, and WhatsApp as critical spaces for individuals to convey their thoughts and emotions instantaneously. This study focuses on the classifying users as depressive or non-depressive based on their social media posts in Kannada using machine learning techniques. Kannada’s distinct linguistic characteristics and scarcity of language resources create specific challenges for Natural Language Processing. In the present work, Machine Learning algorithms are used to find the indications of depressive thoughts of the user based on the tweets. This can then be used further for providing necessary aid and counselling to the depressed persons. A labelled dataset of Kannada tweets, adapted from the Sentiment140 corpus, was utilized in this study. Pre-processing techniques including tokenization, stop-word removal, vectorization and lemmatization using Word2Vec were applied. Logistic Regression, Extreme Gradient Boost, Ridge Classifier, Linear Discriminant Analysis and Stochastic Gradient Descent Classifier were trained using the vectorized dataset with their performance being evaluated using metrics accuracy and the Area Under the Curve score. The Linear Discriminant Analysis outperformed the chosen models with $79.95 \\%$ accuracy."
  },
  {
    "date": "2026-2-17",
    "title": "Historical Frame and Motion Guided Diffusion Model for Video Anomaly Detection",
    "authors": "Rongxin Li, Xinlong Liu, Guangchao Wang, Bin Chen",
    "publish": "2025 5th International Conference on Measurement Control and Instrumentation (MCAI)",
    "url": "https://doi.org/10.1109/mcai66356.2025.11381969",
    "source": "IEEE",
    "abstract": "Video anomaly detection aims to identify events that deviate from normal behavior in surveillance videos. However, current methods still suffer from the long-range dependencies problem due to the limited capability in spatio-temporal modeling. In this paper, we propose HMDiff, a conditional diffusion model guided by the historical frames and motion features. In the HMDiff, videos are first compressed into discrete latent codes through a vector-quantized variational autoencoder (VQ-VAE). Then, vid3o frames are predicted in this latent space conditioned on the latent codes of historical frame and motion. Finally, anomalies are detected by the frame-level prediction error. Extensive experiments on UCSD Ped2, CUHK Avenue, and ShanghaiTech demonstrate that HMDiff achieves competitive performance compared with recent baselines, especially on long-temporal-range scenarios."
  },
  {
    "date": "2026-2-17",
    "title": "Design and Development of a RAG-Supported Chatbot Enhanced with RGC Prompt Method for Competency Assessment in Maritime Education",
    "authors": "Furkan Eyup Kizilay, Metin Celik",
    "publish": "2025 International Workshop on Artificial Intelligence and Education (WAIE)",
    "url": "https://doi.org/10.1109/waie67422.2025.11381056",
    "source": "IEEE",
    "abstract": "This study focuses on the preliminary design of a chatbot enhanced with a structured RGC prompt method based on Retrieval-Augmented Generation (RAG) integrated with generative artificial intelligence (GAI) to assess the competencies of seafarers in maritime education. The chatbot system targets the IMO Model Courses $\\mathbf{1. 2 0}$ and $\\mathbf{2. 0 3}$ related to “Fire Prevention and Fire Fighting” and “Advanced Fire Fighting” under the Standards of Training, Certification and Watchkeeping for Seafarers (STCW), generating situational judgment test (SJT) scenarios aligned with STCW requirements. The chatbot, coded in Python and developed in a Docker environment with a PostgreSQL database, uses the Groq large language model (LLM) along with the Chainlit interface to analyze user queries and generate STCW compliant content. Thanks to the unique structure of the RGC method, the scenario creation process ensures suitability for maritime operations by considering roles, results, goals, context, and constraints. When the RGC prompt is entered into the system, the system generates scenarios, questions, and multiple-choice options for the user. This contributes to the development of competency assessment processes in maritime education. Future studies will include pilot applications to test the system’s validity and reliability, as well as the integration of other international maritime conventions."
  },
  {
    "date": "2026-2-17",
    "title": "Reinforcement Learning -Based Dynamic Pricing Framework for E-Commerce Revenue Growth",
    "authors": "Neelam Mohit Pashte, Chandni. M. C., Reshmi V Suresh, Niravkumar Rameshchandra Joshi, Praveen Rathod, Ranjitha Radhakrishna",
    "publish": "2025 2nd International Conference on Artificial Intelligence and Knowledge Discovery in Concurrent Engineering (ICECONF)",
    "url": "https://doi.org/10.1109/iceconf65644.2025.11379561",
    "source": "IEEE",
    "abstract": "Dynamic pricing has become one of the most important tactics of maximizing revenue within the context of e-commerce when consumers and competitor activity develop at an extremely high rate. This research suggests a Dynamic Pricing Framework that is based on Reinforcement Learning with the use of Deep Q-Networks (DQN) to make optimal price decisions in real time. Pricing problem is defined as a Markov Decision Process (MDP) where the states are the demand patterns, inventory levels and competitor prices and the actions are (price changes). The reward feature is seen to maximize revenue growth in the long term as opposed to the short-term. The framework is implemented with the help of TensorFlow and trains a deep neural network to produce approximations of Q-values, making it possible to implement adaptive pricing policies. Simulations of synthetic e-commerce data shows that the average revenue is dramatically improved when using the experimental simulation method over the traditional rule-based and demand-elasticity approaches. The findings point at the prospects of integrating reinforcement learning and scalable deep learning applications to design smart, competitive, customer-sensitive pricing systems of modern e-commerce platforms."
  },
  {
    "date": "2026-2-17",
    "title": "Comparative Study on Aeroelastic Control Laws for NACA 0012 and NACA 64A010",
    "authors": "Patcharaphon Koedprayodsuk, Nopdanai Ajavakom, Niphon Wansophark",
    "publish": "2025 8th International Conference on Robotic Systems and Applications (ICRSA)",
    "url": "https://doi.org/10.1109/icrsa66467.2025.11383791",
    "source": "IEEE",
    "abstract": "Flutter is an important factor that must be considered in airfoil design. One of the key indicators of flutter is the flutter speed, which represents the critical airspeed that may cause structural instability. This project aims to increase the flutter speed of airfoils using a control law. The study compares the control efficiency between two airfoils: NACA 0012 and NACA 64A010. The control method used in this study is gain feedback control, designed using the Linear-Quadratic Regulator (LQR) approach in MATLAB. The aerodynamic loads acting on the airfoils are calculated using the Theodorsen Unsteady Modeling while the flutter speed is determined using the <tex xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">$\\mathbf{P}-\\mathbf{K}$</tex> method, which relies on the eigenvalues of a state-space system. The comparison is conducted at 120 % of the flutter speed for each airfoil. The results show that aeroelasticity control law for NACA 64A010 is more effective than aeroelasticity control law for NACA 0012. However, it is important to note that this study does not include thickness and shape airfoil. Future work should consider the thickness case to improve the accuracy of the analysis."
  },
  {
    "date": "2026-2-17",
    "title": "Site Selection and Capacity Allocation Strategy for Mobile Photovoltaic Charging Stations",
    "authors": "Hengli Zhang, Tianze Zheng, Jiaqi Hong, Yinuo Huang",
    "publish": "2025 5th International Conference on Power System and Energy Internet (PoSEI)",
    "url": "https://doi.org/10.1109/posei67825.2025.11382310",
    "source": "IEEE",
    "abstract": "Recent years, to achieve carbon peaking and carbon neutrality, the popularization of electric vehicles (EVs) makes great contributions to the reduction of carbon emissions. However, the charging behavior of large-scale EVs also brings great challenges to the safe and stable operation of the power system. The rational allocation of photovoltaic (PV) and energy storage (ES) in solar charging stations, including their optimal site selection and capacity allocation, plays a critical role in mitigating EVs charging loads and ensuring the secure operation of distribution networks. This paper proposes a mathematical model for site selection and capacity allocation of mobile photovoltaic charging stations (MPVCS), which mainly consist of two parts: mobile PV(MPV) and mobile ES (MES). The site selection and capacity allocation of MPVCS directly affect their operating costs and overall feasibility. In order to minimize the total annualized costs of MPVCS, including investment costs, maintenance costs, power purchase costs, PV curtailment costs and network loss costs within a one-year dispatch horizon, guided by nodal tariffs, MPVCS can flexibly adjust the siting and capacity of MPV and MES. Case studies demonstrate that MPVCS significantly reduces total costs compared to fixed photovoltaic charging stations (FPVCS) and the risk of voltage overruns is greatly reduced, providing theoretical support for the future promotion of MPVCS."
  },
  {
    "date": "2026-2-17",
    "title": "Fusing Binocular Stereo Matching and Object Detection for Substation Safety Distance Monitoring",
    "authors": "Jian Fu, Wen Zhu, Xixi Zeng, Neng Liao, Bin Li, Song Zeng, Zhibin Tu, Wenxin Guo",
    "publish": "2025 5th International Conference on Measurement Control and Instrumentation (MCAI)",
    "url": "https://doi.org/10.1109/mcai66356.2025.11381957",
    "source": "IEEE",
    "abstract": "Aiming at the safety management and control requirements of substation near-electric operation, a safety distance monitoring scheme combining binocular stereo matching and target detection is proposed. Binocular stereo matching is used to obtain three-dimensional information of the scene, and the improved target detection algorithm is used to accurately identify operators and equipment. To overcome the problem of ranging error caused by ambient temperature, optimize feature extraction and occlusion target recognition, and realize real-time monitoring and early warning of safe distance. After testing, it can effectively improve the efficiency of risk identification of near-electric operation, reduce the probability of accidents, provide technical support for intelligent supervision of substation operation safety, and adapt to multi-voltage substation scenarios."
  },
  {
    "date": "2026-2-17",
    "title": "A Development of Integrated Offshore Floating Photovoltaic System with Wind-Solar Farm Designs Using Green Hydrogen and Electricity",
    "authors": "Govindaraj R, Vadela Pavan Kumar, Ashraf Shaqadan, A Bulli Babu, Devolla Manogna, Aravinda K",
    "publish": "2025 2nd International Conference on Artificial Intelligence and Knowledge Discovery in Concurrent Engineering (ICECONF)",
    "url": "https://doi.org/10.1109/iceconf65644.2025.11379523",
    "source": "IEEE",
    "abstract": "The IFPVWS is proposed to enhance offshore renewable energy generation by combining floating solar photovoltaic (FPV) systems with offshore wind turbines. This study utilizes high-resolution wind speed data over Spanish waters, focusing on historical and projected periods under two climate scenarios. The research includes determining wind power density, designing turbine spacing to mitigate wake effects, and minimizing energy costs through optimization techniques. The output from the solar component is modelled through variables including solar irradiance and temperature effects. The system also implements energy management strategies and conducts optimization using an optimization algorithm, accounting for system variables and performance across different metrics. The performance of the IFPVWS model was assessed by comparing wind park energy and solar park energy to total park energy. This evaluation included calculations for wind speed, solar radiation, and load power."
  },
  {
    "date": "2026-2-17",
    "title": "A Comprehensive Battery Management System for Lithium Batteries with Active Balancing and a Novel Lead-Acid Battery Capacity Test Meter",
    "authors": "Omar Lasheen, Hossam El-Dine Mostafa, Mohamed Ismail El-Banna",
    "publish": "2025 International Conference on Future Telecommunications and Artificial Intelligence (IC-FTAI)",
    "url": "https://doi.org/10.1109/ic-ftai67960.2025.11384181",
    "source": "IEEE",
    "abstract": "This paper presents the design and implementation of a comprehensive Battery Management System (BMS) for 3 S Li-ion battery prototypes, utilizing the BQ40Z50 fuel-gauge IC and active balancing. The BMS effectively protects the battery and employs the Impedance Track algorithm for accurate State of Charge (SOC) and State of Health (SOH) estimation, alongside other critical lifetime, protection, and gauging parameters. The system is intended for smartphones, laptops, and electric-vehicle applications. In addition, a novel capacity-test metefor lead-acid batteries is introduced. The meter replicates the standard 20-hour capacity test in approximately one minute by correlating initial Open-Circuit Voltage (OCV) with SOC, performing a short <tex xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">$\\mathbf{C} / \\mathbf{2 0}$</tex> discharge, and using the change in SOC to extrapolate full capacity. Experimental validation demonstrates Fuel gauge BMS SOC accuracy within 1-3 % and rapid and repeatable capacity estimates using the designed capacity test meter for flooded, AGM, and GEL chemistries."
  },
  {
    "date": "2026-2-17",
    "title": "Deep Features Based on Contrastive Fusion of Transformer and CNN for Semantic Segmentation",
    "authors": "Margi Pandya, Tushar Sandhan",
    "publish": "2025 IEEE International Conference on Image Processing Workshops (ICIPW)",
    "url": "https://doi.org/10.1109/icipw68931.2025.11386334",
    "source": "IEEE",
    "abstract": "The development of safe and adaptive autonomous vehicles (AVs) requires perception models that are accurate and interpretable, while also capable of adapting to dynamic environments. Traditional deep learning models rely on large, static datasets and require retraining, which limits their flexibility in real-world AV deployment. We propose ContraFusionNet (CFN), a hybrid student-teacher framework that integrates local spatial features from a CNN teacher with global context from a Transformer student. Using bidirectional contrastive learning, CFN aligns intermediate feature representations, enabling efficient knowledge transfer and incremental adaptation without full retraining. Evaluated on the Cityscapes dataset using only fine annotations, CFN improves segmentation performance while reducing reliance on additional supervision. Its modular design supports transparency and continual refinement, making it well-suited for data-constrained and evolving AV scenarios. CFN contributes to the broader goals of explainable and efficient learning in AV systems. Code is publicly available at: https://github.com/ MargiPandya27/ContraFusionNet."
  },
  {
    "date": "2026-2-17",
    "title": "Evaluating Static Time-of-Use Tariffs for an Interconnected Mini-grid in Nigeria",
    "authors": "Oluwanifemi Blessing Ojo, Alberto Rodríguez Gómez, Fola Aminu, Ridwan Zubair, Gianfranco Chicco",
    "publish": "2025 9th International Conference on Environment Friendly Energies and Applications (EFEA)",
    "url": "https://doi.org/10.1109/efea67685.2025.11386019",
    "source": "IEEE",
    "abstract": "Interconnected minigrids (IMGs) in Nigeria often rely on diesel generators to meet morning and evening demand, raising both operational costs and emissions in the absence of battery storage or a reliable grid supply. This study evaluates the potential of static Time-of-Use (ToU) tariffs as a demand-side strategy to shift household appliance use to solar production hours in an IMG setting. A bottom-up, appliance-level simulation was developed to model household load profiles and evaluate cost savings from load shifting under ToU pricing. Implementing ToU pricing led to a 64 percent reduction in diesel use, 24 percent decrease in customer energy costs, and 25 percent reduction in solar energy curtailment. These results demonstrate that demand flexibility reduces customer energy costs, lowers developers’ reliance on fossil-fuel backup generation, and enhances solar photovoltaic (PV) utilisation."
  },
  {
    "date": "2026-2-17",
    "title": "Spectrum Sensing and Channel State Prediction for Cognitive Visible Light Communication Based on Deep Neural Network",
    "authors": "Xinyi Liu",
    "publish": "2025 6th International Conference on Artificial Intelligence and Computer Engineering (ICAICE)",
    "url": "https://doi.org/10.1109/icaice68195.2025.11382260",
    "source": "IEEE",
    "abstract": "With the rapid growth of wireless data traffic, radio frequency spectrum resources are becoming increasingly scarce, and visible light communication technology has become an important supplement with its advantages of wide spectrum and high security. However, the visible light channel is easily affected by environmental factors and presents fast time-varying characteristics, and the traditional methods have the problems of insufficient modeling accuracy and adaptive ability in dynamic scenes. By introducing the idea of cognitive radio, this paper designs a hybrid deep learning architecture combining convolutional neural network and long short-term memory network to realize end-to-end spectrum idle state judgment and channel parameter prediction. Experimental results show that the proposed model significantly outperforms traditional algorithms such as energy detection and matched filtering in terms of detection probability and prediction accuracy, and verifies its effectiveness in improving system performance through feature sharing and collaborative optimization. This paper provides a new solution for dynamic resource management of intelligent visible light communication system."
  },
  {
    "date": "2026-2-17",
    "title": "Emotion-Based Email Notification System Using AI and Google Oauth2",
    "authors": "Seenivasan D, Dharun K S, MidhunKumar S, Vel Aravindhan S",
    "publish": "2025 2nd International Conference on Artificial Intelligence and Knowledge Discovery in Concurrent Engineering (ICECONF)",
    "url": "https://doi.org/10.1109/iceconf65644.2025.11379477",
    "source": "IEEE",
    "abstract": "Due to the fast development of digital communication, there is an increasing necessity to have smart email management tools, which will get the opportunity to identify the emotional intent of the message and assign it the highest priority. The conventional email filtering systems are unable to detect nuanced emotional signals in written material, which results in latency in response and lost important messages. This paper introduces a Transformer-Driven Multimodal Emotion Cognition Framework with Adaptive Priority Routing and secure feature of Google o Auth2 authentication to provide real-time emotion-aware email notification. In the model, a transformer backbone that is based on DeBERTa and multimodal features, including punctuations intensity, lexical stress, and emoj ies are used to gain an understanding of emotions on a fine-grained scale. The system can classify emails as expressions of anger, urgency, joy, and neutral states with a precision of 96.72 according to advanced attention mechanisms and probability calibration outperforming traditional machine learning and previous baselines of deep-learning. The adaptive routing layer also optimizes priority assignment, based on reinforcement learning based on user interaction feedback. Detailed analysis of key performance indicators has shown that the system has improved significant operation in response time (reduced by a 60-67%), routing accuracy (more than 94%) and very low system latency of less than 250 ms at high loads. The framework has a high potential in terms of minimizing cognitive overloads and making sure that emotionally important communication is addressed in time. The future plans involve the incorporation of multilingual transformers, modeling of cross-senders and multimodal speech-text fusion to analyze voice-enabled emails. The suggested system lays a strong and safe foundation of emotionally intelligent fulfillment and management of email messages applicable in individual, enterprise, and massive communications processes."
  },
  {
    "date": "2026-2-17",
    "title": "Multiple Treatments Causal Effects in Mathematics Education",
    "authors": "Tomoko Nagai, Takayuki Okuda, Tomoya Nakamura, Yuichiro Sato, Kensaku Kinjo, Kengo Kawamura, Shin Kikuta, Naoto Kumano-Go",
    "publish": "2025 International Workshop on Artificial Intelligence and Education (WAIE)",
    "url": "https://doi.org/10.1109/waie67422.2025.11381207",
    "source": "IEEE",
    "abstract": "We investigate the causal effects of multiple treatments provided by the Mathematics Division of the Academic Support Center at Kogakuin University. The Center supports all students through personal assistance, basic classes, and various on-demand educational materials available on its Learning Management System (LMS). Personal assistance is provided through both face-to-face and remote sessions. In our previous work, we examined educational effects of face-to-face sessions on regular examination using T-learner approach within the framework of causal inference. However, the influence of other resources provided by the Center remains unexplored. To address this, we extend our analysis from a single treatment causal effect to a multiple treatment causal effect framework, considering the combined effects of three types of resources: personal assistance, basic classes, and on-demand materials on the LMS. To estimate these treatment effects, we employ the T-learner, a machine learning model for causal inference."
  },
  {
    "date": "2026-2-17",
    "title": "Graph Neural Network Based Escalation Detection in Grievance Network",
    "authors": "A Saranya, Pushpalatha. V, Thinega. C. E",
    "publish": "2025 2nd International Conference on Artificial Intelligence and Knowledge Discovery in Concurrent Engineering (ICECONF)",
    "url": "https://doi.org/10.1109/iceconf65644.2025.11379675",
    "source": "IEEE",
    "abstract": "The sudden digitization of urban services has caused a rapid boom in the volume of civic grievances from infrastructural failure to chronic public service failures While accessibility has increased with online complaint centres this has also given rise to information overload, which has made it increasingly challenging for authorities to sift through complaints on the basis of urgency and risk of escalation Traditional machine learning methods primarily treat complaints as isolated text inputs, processing them separately and not considering relationships between them. Sequencing in this manner is able to suppress underlying patterns and structural relationships among complaints that become apparent only when data are viewed in the aggregate to avoid this weakness, the proposed approach models the complaint context as a graph, where a complaint is a node and edges are formed based on relations such as geographical proximity, keyword similarity, similar re-submissions by the same individual, timing, or department relevance. The main advantage of the strength of GNN s is that they can consider these dependent nodes. The model learns from historical complaint data, with labeled outcomes whether a complaint escalated or closed without further issue."
  },
  {
    "date": "2026-2-17",
    "title": "A Hybrid ConvNeXt-ViT Framework for Fine-Grained Grape Leaf Disease Classification",
    "authors": "Nidhi Sharma, Alok Misra, Raj Gaurang Tiwari",
    "publish": "2025 5th International Conference on Evolutionary Computing and Mobile Sustainable Networks (ICECMSN)",
    "url": "https://doi.org/10.1109/icecmsn68058.2025.11382862",
    "source": "IEEE",
    "abstract": "Early and proper detection of grape leaf diseases is of great importance to maintain the health and global wine production of the vineyards. Although deep learning has been demonstrated in the context of plant disease diagnostics, the current models that use convolutional neural networks ( CNNs) tend to be less sensitive to fine-grained visual features of various pathologies since they not only focus on the local features but also on the global context features. To overcome this drawback, this research suggests an innovative hybrid architecture that makes the best of ConvNeXt, which is a contemporary CNN, and a Vision Transformer (ViT). The suggested framework utilises a pretrained ConvNeXt backbone as an effective feature extractor to learn hierarchical local features like lesions and spots. The resulting rich feature maps are tokenized and run through a Transformer encoder, which uses self-attention to learn long-range dependency and global contextual relationships across the leaf. This dual stream methodology allows our model to gain insight into the fine details of the symptoms in an integrated manner, as well as the space-based interaction of these symptoms, which is important to distinguish between two visually similar diseases, such as Esca and Leaf Blight. Applied to the Grape400 dataset, the proposed hybrid model achieves the state-of-the-art macro F1-score of 98.2, which is far above the standard CNN and pure Transformer baseline. The suggested findings indicate that the suggested ConvNeXt-ViT framework is a powerful and efficient system to address fine-grained agricultural classification problems and can be applied in the context of precision viticulture."
  },
  {
    "date": "2026-2-17",
    "title": "Touch-Based Hybrid Authentication with Accurate Feature Extraction and Hyperparameter Tuning for Biometric Applications",
    "authors": "T P Ramachandran",
    "publish": "2025 2nd International Conference on Artificial Intelligence and Knowledge Discovery in Concurrent Engineering (ICECONF)",
    "url": "https://doi.org/10.1109/iceconf65644.2025.11379549",
    "source": "IEEE",
    "abstract": "Touch-Based Hybrid Authentication uses behavioral biometrics along with machine learning to authenticate a user on the basis of their one-of-a-kind touchscreen behaviors, for example, taps, swipes, and pattern locks. The Touch-based Hybrid Authentication Technology with Hybrid Biometric (THAFHB) is a system for user verification that integrates biometrics with Deep Learning (DL). The two Android applications on a Samsung Galaxy SII take the touch gesture data. The applications also measure user ID, type of gesture, pressure, and timestamps. The framework employs a modified DarkNet-53 architecture that does have Res Net connections to improve feature learning. To improve performance and calibrate the parameters, the framework utilizes a recently developed algorithm inspired by rabbit behavior, the Adaptive Rabbit Optimization (ARO) algorithm, to facilitate a trade-off between exploration and exploitation. A Hyper Parameter Optimization (HPO) algorithm, based on predator-prey dynamics, is used to set the parameters for ShuffleNetv2.3. It follows a two-phase process, i.e. exploration and exploitation. The result discussion by mean squared error calculation, validation rate vs noise level calculation, mean absolute error vs noise level calculation, THAFHB overall performance calculation, and THAFHB confusion matrix calculation."
  },
  {
    "date": "2026-2-17",
    "title": "Corrigendum: The Last Mile in Remote Sensing Poverty Prediction",
    "authors": "Woojin Jung, Arunesh Sinha, Andrew H. Kim, Vatsal Shah, Yuxiao Lu, Lami Lee, Tawfiq Ammari",
    "publish": "ACM Journal on Computing and Sustainable Societies",
    "url": "https://doi.org/10.1145/3777389",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-17",
    "title": "Message by Guest of Honour",
    "authors": "N/A",
    "publish": "2025 IEEE International Conference on Blockchain and Distributed Systems Security (ICBDS)",
    "url": "https://doi.org/10.1109/icbds67396.2025.11376857",
    "source": "IEEE",
    "abstract": null
  },
  {
    "date": "2026-2-17",
    "title": "WAIE 2025 TOC",
    "authors": "N/A",
    "publish": "2025 International Workshop on Artificial Intelligence and Education (WAIE)",
    "url": "https://doi.org/10.1109/waie67422.2025.11381220",
    "source": "IEEE",
    "abstract": null
  },
  {
    "date": "2026-2-17",
    "title": "ICECMSN 2025 Committees",
    "authors": "N/A",
    "publish": "2025 5th International Conference on Evolutionary Computing and Mobile Sustainable Networks (ICECMSN)",
    "url": "https://doi.org/10.1109/icecmsn68058.2025.11383370",
    "source": "IEEE",
    "abstract": null
  },
  {
    "date": "2026-2-17",
    "title": "ICICCS 2025 Content Announcement Page",
    "authors": "N/A",
    "publish": "2025 International Conference on Intelligent Control and Computing Science (ICICCS)",
    "url": "https://doi.org/10.1109/iciccs67942.2025.11382247",
    "source": "IEEE",
    "abstract": null
  },
  {
    "date": "2026-2-17",
    "title": "PoSEI 2025 Copyright Page",
    "authors": "N/A",
    "publish": "2025 5th International Conference on Power System and Energy Internet (PoSEI)",
    "url": "https://doi.org/10.1109/posei67825.2025.11382298",
    "source": "IEEE",
    "abstract": null
  },
  {
    "date": "2026-2-17",
    "title": "SIGNAL: Stereo Image Neural Learner for Continuous Super-Resolution",
    "authors": "Xu Liu, Yang Zhao, Yuan Chen, Xinjie Li, Zhao Zhang, Wei Jia",
    "publish": "IEEE Transactions on Consumer Electronics",
    "url": "https://doi.org/10.1109/tce.2026.3665449",
    "source": "IEEE",
    "abstract": "Stereo images are widely used in many scenarios such as autonomous driving and stereoscopic display. Stereo image super-resolution is a common technique to obtain high-definition stereo images. However, existing methods are mainly designed for fixed scales and cannot smoothly support arbitrary upscaling. To address these problems, this paper proposes a Stereo ImaGe NeurAl Learner (SIGNAL) based on implicit neural representation, which consists of three parts. First, a feature extraction module leveraging the iPASSR architecture to robustly extract hierarchical features from low-resolution stereo images. Second, a novel stereo implicit representation module that explicitly models the inherent geometric consistency and contextual relationships between the two views, enhancing the latent features through view-specific and cross-view interactions. Third, a cross-view decoding module designed to fully exploit the complementary information across views during the image reconstruction process. Extensive experiments across diverse datasets demonstrate that the proposed SIGNAL framework achieves superior performance. The results underscore the effectiveness of our approach in handling arbitrary scaling factors while preserving visual fidelity in stereo image restoration."
  },
  {
    "date": "2026-2-17",
    "title": "Enabling “see-and-Point” Communication Between Robots",
    "authors": "Huangwei Wu, Weiguo Wang, Meng Jin, Zhuxuan He, Qi Cao, Xinbing Wang, Chenghu Zhou",
    "publish": "IEEE Transactions on Mobile Computing",
    "url": "https://doi.org/10.1109/tmc.2026.3665613",
    "source": "IEEE",
    "abstract": "This paper proposes a novel address mapping mechanism for multi-robot communication and collaboration systems, named SPing. SPing addresses each robot with a dynamic <italic xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">physical-world address</i> - an encoding of the robot's physical location - rather than a pre-assigned digital-world ID (e.g., the IP address). This enables a “see-and-point” communication mode for robots: a robot can establish an immediate connection pointing to any other robot it intends to collaborate with in its visual field, without relying on a pre-existing multi-robot network. This on one hand improves the robustness and usefulness of multi-robot systems in uncertain and unstructured environments where network infrastructures are unavailable. On the other hand, it makes the robots' communication behavior tightly coupled with and more supportive of the collaboration tasks in the physical world. We build an end-to-end prototype of SPing and evaluate its performance in both static and mobile scenarios. The results show that SPing can always establish a connection precisely pointing to the target receiver with an average matching rate of 99.58%, and a spatial resolution of 0.3 m<inline-formula xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\"><tex-math notation=\"LaTeX\">$\\sim$</tex-math></inline-formula> 0.5m."
  },
  {
    "date": "2026-2-17",
    "title": "Enhancing UAV Intrusion Detection Against Adversarial Samples Based on AdvGAN and Decision Boundary Reconstruction",
    "authors": "Mengyang Li, Yongze Jin, Wenjiang Ji, Junqi Liu, Jing Xin, Yichuan Wang, Xinhong Hei",
    "publish": "IEEE Internet of Things Journal",
    "url": "https://doi.org/10.1109/jiot.2026.3665688",
    "source": "IEEE",
    "abstract": "With the widespread application of unmanned aerial vehicles (UAVs), intrusion detection based on wireless communication traffic has become increasingly critical. While deep learning (DL) models have significantly enhanced anomaly detection accuracy, recent research indicates that they remain vulnerable to adversarial sample attacks, which poses severe threats to the open communication networks used by UAV systems. To address this challenge, an enhanced UAV intrusion detection framework is proposed for defending against adversarial samples, integrating generating adversarial samples with adversarial networks (AdvGAN) and decision boundary reconstruction. Specifically, a convolutional neural network (CNN) is first developed as the baseline intrusion detection model to detect anomalous traffic in UAV wireless communication. Subsequently, to overcome the gradient-dependent perturbation limitations of traditional adversarial attack methods, AdvGAN is employed to analyze real monitored traffic data and generate semantically consistent adversarial samples that retain the intrinsic characteristics of authentic network flow. Finally, a hybrid adversarial-real data training strategy is proposed to dynamically reconstruct the model’s intrusion decision boundaries. This strategy augments the training dataset with AdvGAN-generated adversarial samples, enabling the model to adaptively adjust decision thresholds through iterative backpropagation. On a real-world dataset, the superior performance of proposed method is verified: it maintains high detection accuracy for legitimate traffic while substantially reducing the success rate of adversarial attacks. Experimental results confirm the stealthiness of generated adversarial samples and the robustness of the enhanced detection model, validating the effectiveness of the proposed framework."
  },
  {
    "date": "2026-2-17",
    "title": "CAMAv2: A Vision-Centric Approach for Static Map Element Annotation_supp1-3662336.mp4",
    "authors": "Cong Yang",
    "publish": "N/A",
    "url": "https://doi.org/10.1109/tits.2026.3662336/mm1",
    "source": "IEEE",
    "abstract": "The recent advancement of Bird’s Eye View (BEV) perception algorithms requires extensive, high-quality annotated map data for effective training and deployment in real-world scenarios. However, existing HD map-based auto-labeling methods, like those found in public datasets, face significant issues related to efficiency and accuracy. For instance, the nuScenes dataset reveals considerable misalignment and inconsistency between images and their annotations, with an average reprojection error of approximately 8.03 pixels. Additionally, the dependence on HD maps limits the applicability of these methods for large-scale, real-world auto-labeling. To tackle these challenges, we introduce CAMAv2: a vision-centric approach for Consistent and Accurate Map Annotation. This pipeline primarily utilizes camera inputs to generate precise 3D annotations of static map elements, achieving high reprojection accuracy across all surrounding cameras and maintaining spatiotemporal consistency throughout the entire sequence. Importantly, CAMAv2 annotations show lower reprojection errors compared to the original nuScenes map elements, with errors of 4.96 pixels versus 8.03 pixels. Comprehensive evaluations across various public datasets confirm the feasibility and generalizability of our pipeline in diverse environments, as well as under different weather and lighting conditions."
  },
  {
    "date": "2026-2-17",
    "title": "Physics-Guided Deep Learning for Battery Future Capacity and Remaining Useful Life Predictions",
    "authors": "Tianjing Wang, Jiangong Zhu, Weihan Li, Yan Xu, Zhao Yang Dong",
    "publish": "IEEE Transactions on Transportation Electrification",
    "url": "https://doi.org/10.1109/tte.2026.3665605",
    "source": "IEEE",
    "abstract": "Accurate predictions of future capacity and remaining useful life (RUL) are critical for ensuring battery safety and prolonging lifespan. However, existing studies struggle to achieve high-accuracy long-term predictions from early cycles of battery operation. To address this limitation, this study proposes a physics-informed deep learning framework called physics-controlled differential equation (CDE) for forecasting battery capacity and RUL. The proposed approach integrates a Query-Key-Value neural CDE structure to extract attention-weighted features, effectively capturing essential battery dynamics. Furthermore, a long short-term memory-embedded neural CDE models differential relationships over time, while an empirical model periodically updates physical constraints to refine degradation trends. Experimental validation across multiple datasets demonstrates that the proposed method outperforms existing approaches by accurately reconstructing the entire capacity degradation curve from only a small number of early-cycle measurements, without requiring full-lifecycle capacity labels, while also providing reliable RUL predictions from early cycles. Even when forecasting capacity degradation over the full lifecycle on various datasets, the prediction error remains below 0.04, confirming the method’s robustness and precision."
  }
]