[
  {
    "date": "2026-02-04",
    "title": "Bayesian PINNs for uncertainty-aware inverse problems (BPINN-IP)",
    "authors": "Ali Mohammad-Djafari",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.04459v1",
    "source": "arXiv",
    "abstract": "The main contribution of this paper is to develop a hierarchical Bayesian formulation of PINNs for linear inverse problems, which is called BPINN-IP. The proposed methodology extends PINN to account for prior knowledge on the nature of the expected NN output, as well as its weights. Also, as we can have access to the posterior probability distributions, naturally uncertainties can be quantified. Also, variational inference and Monte Carlo dropout are employed to provide predictive means and variances for reconstructed images. Un example of applications to deconvolution and super-resolution is considered, details of the different steps of implementations are given, and some preliminary results are presented."
  },
  {
    "date": "2026-02-04",
    "title": "Heavy-quark production in deep-inelastic scattering -- Mellin moments of structure functions",
    "authors": "Marco Klann, Sven-Olaf Moch, Kay Schönwald",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.04455v1",
    "source": "arXiv",
    "abstract": "We compute Mellin moments of the heavy-quark structure functions in deep-inelastic scattering at next-to-leading order in quantum chromodynamics, retaining their full dependence on the heavy-quark mass. Using the optical theorem and the operator product expansion, we derive analytic results for fixed Mellin moments $N = 2$ to $22$ of the structure functions $F_2$ and $F_L$. Our results reproduce the known expressions in the relevant asymptotic limits, in particular for virtualities of the exchanged photon $Q^2$ much larger than the heavy-quark mass squared $m^2$, and are in agreement with existing parametrisations of the next-to-leading-order coefficient functions. The computational set-up developed in this work also provides a direct pathway toward extending these calculations to next-to-next-to-leading order."
  },
  {
    "date": "2026-02-04",
    "title": "Can Theory-Informed Message Framing Drive Honest and Motivated Performance with Better Assessment Experiences in a Remote Assessment?",
    "authors": "Suvadeep Mukherjee, Björn Rohles, Gabriele Lenzini, Pedro Cardoso-Leite",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.04450v1",
    "source": "arXiv",
    "abstract": "Remote unproctored assessments increasingly use messaging interventions to reduce cheating, but existing approaches lack theoretical grounding, focus narrowly on cheating suppression while overlooking performance and experience, and treat cheating as binary rather than continuous. This study examines whether messages based on 15 psychological concepts from self-determination, cognitive dissonance, social norms, and self-efficacy theories can reduce cheating while preserving performance and experience. Through an expert workshop (N=5), we developed 45 theory-informed messages and tested them with online participants (N=1232) who completed an incentivized anagram task. Participants were classified as non-cheaters (0% items cheated), partial-cheaters (1-99% cheated), or full-cheaters (100% cheated). Results show that concept-based messages reduced full-cheating occurrence by 42% (33% to 19%), increased non-cheating by 19% (53% to 63%), with no negative effects on performance or experience across integrity groups. Surprisingly, messages grounded in different theoretical concepts produced virtually identical effects. Analyses of self-rated psychological mechanisms revealed that messages influenced multiple mechanisms simultaneously rather than their intended targets, though these mechanisms predicted behavior, performance, and experience. These findings show that causal pathways are more complex than current theories predict. Practically, integrity interventions using supportive motivation rather than rule enforcement can reduce cheating without impairing performance or experience."
  },
  {
    "date": "2026-02-04",
    "title": "What's in a Benchmark? The Case of SWE-Bench in Automated Program Repair",
    "authors": "Matias Martinez, Xavier Franch",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.04449v1",
    "source": "arXiv",
    "abstract": "The rapid progress in Automated Program Repair (APR) has been fueled by advances in AI, particularly large language models (LLMs) and agent-based systems. SWE-Bench is a benchmark designed to evaluate repair systems using real issues mined from popular open-source Python repositories. Its public leaderboards-SWE-Bench Lite and Verified-have become central platforms for tracking progress and comparing solutions. In this paper, we present the first comprehensive study of these two leaderboards, examining who is submitting solutions, the products behind the submissions, the LLMs employed, and the openness of the approaches. We analyze 79 entries submitted to Lite leaderboard and 133 to Verified. Our results show that most entries on both leaderboards originate from industry, particularly small companies and large publicly traded companies. These submissions often achieve top results, although academic contributions-typically open source-also remain competitive. We also find a clear dominance of proprietary LLMs, especially Claude family, with state-of-the-art results on both leaderboards currently achieved by Claude 4 Sonnet. These findings offer insights into the SWE-Bench ecosystem that can guide greater transparency and diversity in future benchmark-driven research."
  },
  {
    "date": "2026-02-04",
    "title": "Basis Criteria for Extending Generalized Splines",
    "authors": "Gökçen Dilaver, Selma Altınok",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.04440v1",
    "source": "arXiv",
    "abstract": "Let $R$ be a commutative ring with identity and $G$ a graph. Extending generalized splines are a further extension of generalized splines by allowing vertex labels of $G$ to lie in varying modules rather than in a fixed ring $R$. Geometrically, this corresponds to the construction of equivariant cohomology by Braden and MacPherson (see [5]). Therefore, characterizing such splines has immediate implications in geometry, particularly in the computation of equivariant cohomology. In this paper, we study extending generalized splines as a $R$- module in which each vertex $v$ is labeled by $M_v = m_v R$ and each edge $e$ is labeled by $M_e = R/r_e R$ together with quotient $R$-module homomorphisms $M_v\\to M_e$ for each vertex $v$ incident to the edge $e$, where $R$ is a greatest common divisor domain (GCD). We characterize module bases of such splines in terms of determinants so that it provides a criterion for freeness of spline modules."
  },
  {
    "date": "2026-02-04",
    "title": "Hand Gesture Recognition from Doppler Radar Signals Using Echo State Networks",
    "authors": "Towa Sano, Gouhei Tanaka",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.04436v1",
    "source": "arXiv",
    "abstract": "Hand gesture recognition (HGR) is a fundamental technology in human computer interaction (HCI).In particular, HGR based on Doppler radar signals is suited for in-vehicle interfaces and robotic systems, necessitating lightweight and computationally efficient recognition techniques. However, conventional deep learning-based methods still suffer from high computational costs. To address this issue, we propose an Echo State Network (ESN) approach for radar-based HGR, using frequency-modulated-continuous-wave (FMCW) radar signals. Raw radar data is first converted into feature maps, such as range-time and Doppler-time maps, which are then fed into one or more recurrent neural network-based reservoirs. The obtained reservoir states are processed by readout classifiers, including ridge regression, support vector machines, and random forests. Comparative experiments demonstrate that our method outperforms existing approaches on an 11-class HGR task using the Soli dataset and surpasses existing deep learning models on a 4-class HGR task using the Dop-NET dataset. The results indicate that parallel processing using multi-reservoir ESNs are effective for recognizing temporal patterns from the multiple different feature maps in the time-space and time-frequency domains. Our ESN approaches achieve high recognition performance with low computational cost in HGR, showing great potential for more advanced HCI technologies, especially in resource-constrained environments."
  },
  {
    "date": "2026-02-04",
    "title": "Machine Learning-Driven Crystal System Prediction for Perovskites Using Augmented X-ray Diffraction Data",
    "authors": "Ansu Mathew, Ahmer A. B. Baloch, Alamin Yakasai, Hemant Mittal, Vivian Alberts, Jayakumar V. Karunamurthy",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.04435v1",
    "source": "arXiv",
    "abstract": "Prediction of crystal system from X-ray diffraction (XRD) spectra is a critical task in materials science, particularly for perovskite materials which are known for their diverse applications in photovoltaics, optoelectronics, and catalysis. In this study, we present a machine learning (ML)-driven framework that leverages advanced models, including Time Series Forest (TSF), Random Forest (RF), Extreme Gradient Boosting (XGBoost), Recurrent Neural Network (RNN), Long Short-Term Memory (LSTM), Gated Recurrent Unit (GRU), and a simple feedforward neural network (NN), to classify crystal systems, point groups, and space groups from XRD data of perovskite materials. To address class imbalance and enhance model robustness, we integrated feature augmentation strategies such as Synthetic Minority Over-sampling Technique (SMOTE), class weighting, jittering, and spectrum shifting, along with efficient data preprocessing pipelines. The TSF model with SMOTE augmentation achieved strong performance for crystal system prediction, with a Matthews correlation coefficient (MCC) of 0.9, an F1 score of 0.92, and an accuracy of 97.76%. For point and space group prediction, balanced accuracies above 95% were obtained. The model demonstrated high performance for symmetry-distinct classes, including cubic crystal systems, point groups 3m and m-3m, and space groups Pnma and Pnnn. This work highlights the potential of ML for XRD-based structural characterization and accelerated discovery of perovskite materials"
  },
  {
    "date": "2026-02-04",
    "title": "Normalizing Speed-accuracy Biases in 2D Pointing Tasks with Better Calculation of Effective Target Widths",
    "authors": "Shota Yamanaka, I. Scott MacKenzie",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.04432v1",
    "source": "arXiv",
    "abstract": "For evaluations of 2D target selection using Fitts' law, ISO 9241-411 recommends using the effective target width (W_e) calculated using the univariate standard deviation of selection coordinates. Related research proposed using a bivariate standard deviation; however, the proposal was only tested using a single speed-accuracy bias condition, thus the assessment was limited. We compared the univariate and bivariate techniques in a 2D Fitts' law experiment using three speed-accuracy biases and 346 crowdworkers. Calculating W_e using the univariate standard deviation yielded higher model correlations across all bias conditions and produced more stable throughput among the biases. The findings were also consistent in cases using randomly sampled subsets of the participant data. We recommend that future research should calculate W_e using the univariate standard deviation for fair performance evaluations. Also, we found trivial effects when using nominal or effective amplitude and using different perspectives of the task axis."
  },
  {
    "date": "2026-02-04",
    "title": "Disordered systems and (subcritical) polynomial chaos with heavy-tail disorder",
    "authors": "Gaspard Gomez",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.04429v1",
    "source": "arXiv",
    "abstract": "We study discrete statistical mechanics systems perturbed by a random environment without a finite second moment. Specifically, we consider a random environment whose tail distribution satisfies $P[ω> x] \\sim x^{-γ}$ as $x \\to +\\infty$ for some $γ\\in (1,2)$. Inspired by the seminal work of Caravenna, Sun and Zygouras \\cite{csz_2016}, we adopt a general framework that encompasses as key examples both the disordered pinning model and the long-range directed polymer model. We provide some subcriticality condition under which we prove that the discrete disordered system possesses a non-trivial scaling limit. We also interpret the subcriticality condition in terms of a generalized Harris criterion without second moment, which gives a prediction for disorder relevance depending on the parameters of the system. Our analysis relies on the study of multilinear polynomials of independent heavy-tailed random variables known as polynomial chaos and their continuous analogue, given by multiple integrals with respect to a $γ$-stable Lévy white noise. We develop precise and flexible moments estimates adapted to the heavy-tailed setting."
  },
  {
    "date": "2026-02-04",
    "title": "Fine-Grained Activation Steering: Steering Less, Achieving More",
    "authors": "Zijian Feng, Tianjiao Li, Zixiao Zhu, Hanzhang Zhou, Junlang Qian, Li Zhang, Jia Jim Deryl Chua, Lee Onn Mak, Gee Wah Ng, Kezhi Mao",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.04428v1",
    "source": "arXiv",
    "abstract": "Activation steering has emerged as a cost-effective paradigm for modifying large language model (LLM) behaviors. Existing methods typically intervene at the block level, steering the bundled activations of selected attention heads, feedforward networks, or residual streams. However, we reveal that block-level activations are inherently heterogeneous, entangling beneficial, irrelevant, and harmful features, thereby rendering block-level steering coarse, inefficient, and intrusive. To investigate the root cause, we decompose block activations into fine-grained atomic unit (AU)-level activations, where each AU-level activation corresponds to a single dimension of the block activation, and each AU denotes a slice of the block weight matrix. Steering an AU-level activation is thus equivalent to steering its associated AU. Our theoretical and empirical analysis show that heterogeneity arises because different AUs or dimensions control distinct token distributions in LLM outputs. Hence, block-level steering inevitably moves helpful and harmful token directions together, which reduces efficiency. Restricting intervention to beneficial AUs yields more precise and effective steering. Building on this insight, we propose AUSteer, a simple and efficient method that operates at a finer granularity of the AU level. AUSteer first identifies discriminative AUs globally by computing activation momenta on contrastive samples. It then assigns adaptive steering strengths tailored to diverse inputs and selected AU activations. Comprehensive experiments on multiple LLMs and tasks show that AUSteer consistently surpasses advanced baselines while steering considerably fewer activations, demonstrating that steering less achieves more."
  },
  {
    "date": "2026-02-04",
    "title": "From Main Sequence Binary to Blast: MESA Modeling of the Double-Detonation Progenitor PTF1~J2238+7430",
    "authors": "Mercedes S. Hernandez, Thomas Kupfer, Diogo Belloni, Matthias R. Schreiber",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.04421v1",
    "source": "arXiv",
    "abstract": "Hot subdwarf B (sdB) stars in close binaries with white dwarf (WD) companions are potential progenitors of double-detonation thermonuclear supernovae. The recently discovered system PTF1 J2238+7430 is a candidate for this evolutionary channel, hosting a low-mass sdB and a comparatively massive WD in a compact orbit. We aim to reproduce the evolutionary history of PTF1 J2238+7430, in which the sdB forms first via stable mass transfer, followed by the formation of the WD through a subsequent common-envelope (CE) phase. Additionally, we seek to constrain the range of initial binary parameters that can lead to such double-detonation progenitors. Using the Modules for Experiments in Stellar Astrophysics (MESA), we performed detailed binary evolution simulations from the zero-age main sequence to the present-day configuration. We explored initial stellar masses, orbital periods, and mass-loss fractions, including the effects of angular momentum transfer, tidal synchronization, and gravitational-wave-driven orbital evolution. The post-CE binary properties were derived using the standard energy formalism. Our models successfully reproduce the observed properties of PTF1 J2238+7430, consisting of a 0.406 solar-mass sdB and a 0.72 solar-mass WD in a 76.34-minute orbit. Stable Roche-lobe overflow of an approximately 2.7 solar-mass donor produces the sdB, while the WD forms from the initially less massive companion during an episode of CE evolution. We find that the CE ejection efficiency must be high to match the observed orbit, exceeding canonical values for similar systems. We further delineate the allowed parameter space for initial binaries that can evolve into sdB+WD systems consistent with double-detonation progenitors. These limits are preliminary; a systematic exploration of all parameters is needed for robust constraints, but our results provide a useful starting point for future work."
  },
  {
    "date": "2026-02-04",
    "title": "Integrated Exploration and Sequential Manipulation on Scene Graph with LLM-based Situated Replanning",
    "authors": "Heqing Yang, Ziyuan Jiao, Shu Wang, Yida Niu, Si Liu, Hangxin Liu",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.04419v1",
    "source": "arXiv",
    "abstract": "In partially known environments, robots must combine exploration to gather information with task planning for efficient execution. To address this challenge, we propose EPoG, an Exploration-based sequential manipulation Planning framework on Scene Graphs. EPoG integrates a graph-based global planner with a Large Language Model (LLM)-based situated local planner, continuously updating a belief graph using observations and LLM predictions to represent known and unknown objects. Action sequences are generated by computing graph edit operations between the goal and belief graphs, ordered by temporal dependencies and movement costs. This approach seamlessly combines exploration and sequential manipulation planning. In ablation studies across 46 realistic household scenes and 5 long-horizon daily object transportation tasks, EPoG achieved a success rate of 91.3%, reducing travel distance by 36.1% on average. Furthermore, a physical mobile manipulator successfully executed complex tasks in unknown and dynamic environments, demonstrating EPoG's potential for real-world applications."
  },
  {
    "date": "2026-02-04",
    "title": "SPEAR: An Engineering Case Study of Multi-Agent Coordination for Smart Contract Auditing",
    "authors": "Arnab Mallick, Indraveni Chebolu, Harmesh Rana",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.04418v1",
    "source": "arXiv",
    "abstract": "We present SPEAR, a multi-agent coordination framework for smart contract auditing that applies established MAS patterns in a realistic security analysis workflow. SPEAR models auditing as a coordinated mission carried out by specialized agents: a Planning Agent prioritizes contracts using risk-aware heuristics, an Execution Agent allocates tasks via the Contract Net protocol, and a Repair Agent autonomously recovers from brittle generated artifacts using a programmatic-first repair policy. Agents maintain local beliefs updated through AGM-compliant revision, coordinate via negotiation and auction protocols, and revise plans as new information becomes available. An empirical study compares the multi-agent design with centralized and pipeline-based alternatives under controlled failure scenarios, focusing on coordination, recovery behavior, and resource use."
  },
  {
    "date": "2026-02-04",
    "title": "Med-MMFL: A Multimodal Federated Learning Benchmark in Healthcare",
    "authors": "Aavash Chhetri, Bibek Niroula, Pratik Shrestha, Yash Raj Shrestha, Lesley A Anderson, Prashnna K Gyawali, Loris Bazzani, Binod Bhattarai",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.04416v1",
    "source": "arXiv",
    "abstract": "Federated learning (FL) enables collaborative model training across decentralized medical institutions while preserving data privacy. However, medical FL benchmarks remain scarce, with existing efforts focusing mainly on unimodal or bimodal modalities and a limited range of medical tasks. This gap underscores the need for standardized evaluation to advance systematic understanding in medical MultiModal FL (MMFL). To this end, we introduce Med-MMFL, the first comprehensive MMFL benchmark for the medical domain, encompassing diverse modalities, tasks, and federation scenarios. Our benchmark evaluates six representative state-of-the-art FL algorithms, covering different aggregation strategies, loss formulations, and regularization techniques. It spans datasets with 2 to 4 modalities, comprising a total of 10 unique medical modalities, including text, pathology images, ECG, X-ray, radiology reports, and multiple MRI sequences. Experiments are conducted across naturally federated, synthetic IID, and synthetic non-IID settings to simulate real-world heterogeneity. We assess segmentation, classification, modality alignment (retrieval), and VQA tasks. To support reproducibility and fair comparison of future multimodal federated learning (MMFL) methods under realistic medical settings, we release the complete benchmark implementation, including data processing and partitioning pipelines, at https://github.com/bhattarailab/Med-MMFL-Benchmark ."
  },
  {
    "date": "2026-02-04",
    "title": "Theory of Speciation Transitions in Diffusion Models with General Class Structure",
    "authors": "Beatrice Achilli, Marco Benedetti, Giulio Biroli, Marc Mézard",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.04404v1",
    "source": "arXiv",
    "abstract": "Diffusion Models generate data by reversing a stochastic diffusion process, progressively transforming noise into structured samples drawn from a target distribution. Recent theoretical work has shown that this backward dynamics can undergo sharp qualitative transitions, known as speciation transitions, during which trajectories become dynamically committed to data classes. Existing theoretical analyses, however, are limited to settings where classes are identifiable through first moments, such as mixtures of Gaussians with well-separated means. In this work, we develop a general theory of speciation in diffusion models that applies to arbitrary target distributions admitting well-defined classes. We formalize the notion of class structure through Bayes classification and characterize speciation times in terms of free-entropy difference between classes. This criterion recovers known results in previously studied Gaussian-mixture models, while extending to situations in which classes are not distinguishable by first moments and may instead differ through higher-order or collective features. Our framework also accommodates multiple classes and predicts the existence of successive speciation times associated with increasingly fine-grained class commitment. We illustrate the theory on two analytically tractable examples: mixtures of one-dimensional Ising models at different temperatures and mixtures of zero-mean Gaussians with distinct covariance structures. In the Ising case, we obtain explicit expressions for speciation times by mapping the problem onto a random-field Ising model and solving it via the replica method. Our results provide a unified and broadly applicable description of speciation transitions in diffusion-based generative models."
  },
  {
    "date": "2026-02-04",
    "title": "Performative Learning Theory",
    "authors": "Julian Rodemann, Unai Fischer-Abaigar, James Bailie, Krikamol Muandet",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.04402v1",
    "source": "arXiv",
    "abstract": "Performative predictions influence the very outcomes they aim to forecast. We study performative predictions that affect a sample (e.g., only existing users of an app) and/or the whole population (e.g., all potential app users). This raises the question of how well models generalize under performativity. For example, how well can we draw insights about new app users based on existing users when both of them react to the app's predictions? We address this question by embedding performative predictions into statistical learning theory. We prove generalization bounds under performative effects on the sample, on the population, and on both. A key intuition behind our proofs is that in the worst case, the population negates predictions, while the sample deceptively fulfills them. We cast such self-negating and self-fulfilling predictions as min-max and min-min risk functionals in Wasserstein space, respectively. Our analysis reveals a fundamental trade-off between performatively changing the world and learning from it: the more a model affects data, the less it can learn from it. Moreover, our analysis results in a surprising insight on how to improve generalization guarantees by retraining on performatively distorted samples. We illustrate our bounds in a case study on prediction-informed assignments of unemployed German residents to job trainings, drawing upon administrative labor market records from 1975 to 2017 in Germany."
  },
  {
    "date": "2026-02-04",
    "title": "Unit Shiha Distribution and its Applications to Engineering and Medical Data",
    "authors": "F. A. Shiha",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.04400v1",
    "source": "arXiv",
    "abstract": "There is a growing need for flexible statistical distributions that can accurately model data defined on the unit interval. This paper introduces a new unit distribution, termed the unit Shiha (USh) distribution, which is derived from the original Shiha (Sh) distribution through an inverse exponential transformation. The probability density function of the USh distribution is sufficiently flexible to model both left- and right-skewed data, while its hazard rate function is capable of capturing various failure-rate patterns, including increasing, bathtub-shaped, and J-shaped forms. Several statistical properties of the proposed distribution are investigated, including moments and related measures, the quantile function, entropy, and stress-strength reliability. Parameter estimation is carried out using the maximum likelihood method, and its performance is evaluated through a simulation study. The practical usefulness of the USh distribution is demonstrated using four real-life data sets, and its performance is compared with several well-known competing unit distributions. The comparative results indicate that the proposed model fits the data better than the competitive models applied in this study."
  },
  {
    "date": "2026-02-04",
    "title": "Convivial Fabrication: Towards Relational Computational Tools For and From Craft Practices",
    "authors": "Ritik Batra, Roy Zunder, Amy Cheatle, Amritansh Kwatra, Ilan Mandel, Thijs Roumen, Steven J. Jackson",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.04393v1",
    "source": "arXiv",
    "abstract": "Computational tools for fabrication often treat materials as passive rather than active participants in design, abstracting away relationships between craftspeople and materials. For craft communities that value relational practices, abstractions limit the adoption and creative uptake of computational tools which might otherwise be beneficial. To understand how better tool design could support richer relations between individuals, tools, and materials, we interviewed expert woodworkers, fiber artists, and metalworkers. We identify three orders of convivial relations central to craft: immediate relations between individuals, tools, and materials; mid-range relations between communities, platforms, and shared materials; and extended relations between institutions, infrastructures, and ecologies. Our analysis shows how craftspeople engage and struggle with convivial relations across all three orders, creating workflows that learn from materials while supporting autonomy. We conclude with design principles for computational tools and infrastructures to better support material dialogue, collective knowledge, and accountability, along with richer and more convivial relations between craftspeople, tools, and the material worlds around them."
  },
  {
    "date": "2026-02-04",
    "title": "Blockchain Federated Learning for Sustainable Retail: Reducing Waste through Collaborative Demand Forecasting",
    "authors": "Fabio Turazza, Alessandro Neri, Marcello Pietri, Maria Angela Butturi, Marco Picone, Marco Mamei",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.04384v1",
    "source": "arXiv",
    "abstract": "Effective demand forecasting is crucial for reducing food waste. However, data privacy concerns often hinder collaboration among retailers, limiting the potential for improved predictive accuracy. In this study, we explore the application of Federated Learning (FL) in Sustainable Supply Chain Management (SSCM), with a focus on the grocery retail sector dealing with perishable goods. We develop a baseline predictive model for demand forecasting and waste assessment in an isolated retailer scenario. Subsequently, we introduce a Blockchain-based FL model, trained collaboratively across multiple retailers without direct data sharing. Our preliminary results show that FL models have performance almost equivalent to the ideal setting in which parties share data with each other, and are notably superior to models built by individual parties without sharing data, cutting waste and boosting efficiency."
  },
  {
    "date": "2026-02-04",
    "title": "On the local nature of the de Almeida-Thouless line for mixed \\(p\\)-spin glasses",
    "authors": "Jean-Christophe Mourrat, Adrien Schertzer",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.04383v1",
    "source": "arXiv",
    "abstract": "Jagannath and Tobasco~\\cite{JagTob} proposed a generalized de Almeida-Thouless (AT) criterion aimed at characterizing the replica symmetric (RS) regime for a broad class of mixed \\(p\\)-spin glass models with Ising spins. In this paper, we show that this generalized AT condition does not characterize the RS regime in general. Using the Hopf-Lax representation of the Parisi formula, we construct explicit counterexamples within the class of mixed \\(p\\)-spin models. In particular, we exhibit a model in which the classical AT perturbation is performed around the unique minimizer of the RS free energy, and prove that even in this setting, the AT criterion fails to characterize the RS phase. By contrast, the validity of the classical AT condition for the Sherrington-Kirkpatrick model remains open."
  },
  {
    "date": "2026-02-04",
    "title": "Light deflection in the gravimagnetic dipole spacetime",
    "authors": "Clémentine Dassy, Jan Govaerts",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.04376v1",
    "source": "arXiv",
    "abstract": "The gravimagnetic dipole is an asymptotically flat, stationary, axisymmetric vacuum solution to Einstein's General Relativity describing two non-extreme black holes with equal masses and opposite NUT charges connected by a Misner string. The string tension's can be set to zero by choosing the black hole separation accordingly, yielding a stable system of oppositely rotating black holes at a fixed distance. Numerical simulations of massless particle geodesics reveal gravitational lensing effects for extended sources at infinity on the equatorial plane or on the vertical axis."
  },
  {
    "date": "2026-02-04",
    "title": "Revealing the interfacial kinetic mechanisms in high-entropy doped Na$_3$V$_2$(PO$_4$)$_3$ through electrochemical investigation and distribution of relaxation times",
    "authors": "Manish Kr. Singh, Rajendra S. Dhaka",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.04372v1",
    "source": "arXiv",
    "abstract": "We designed a high-entropy doped NASICON cathode, Na$_3$V$_{1.9}$(CrMoAlZrNi)$_{0.1}$(PO$_4$)$_3$ and investigate its electrochemical performance for sodium-ion batteries (SIBs) to understand the diffusion mechanism including distribution of relaxation times analysis of interfacial kinetics. This trace doping induces high-entropy mixing at the vanadium site, tuning the lattice and enhancing specific capacity, activating V$^{4+}$/V$^{5+}$ redox couple 3.95~V. Interestingly, it delivers a reversible capacity of 119~mAh~g$^{-1}$ at 0.1~C, and demonstrate excellent stability of 68\\% after 1000 cycles at 10~C. The calculated diffusion coefficient values are found within the range of \\(10^{-11}\\)--\\(10^{-13}~\\mathrm{cm^2\\,s^{-1}}\\). The systematic investigation of temperature and voltage-dependent impedance data using the distribution of relaxation times provides deeper insights into the underlying charge-transfer and transport processes. The full cells with hard carbon delivers 326~Wh~kg$^{-1}$ (with respect to cathode mass) at $\\approx$3.2~V and retained $\\sim$79\\% capacity after 100 cycles at 2~C. Our study opens new avenues for developing high-entropy doped cathodes for enhanced structural stability, extended redox activity, and optimized electrochemical kinetics for practical implementation of SIBs."
  },
  {
    "date": "2026-02-04",
    "title": "Flexocurrent-induced magnetization: Strain gradient-induced magnetization in time-reversal symmetric systems",
    "authors": "Shinnosuke Koyama, Takashi Koretsune, Kazumasa Hattori",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.04362v1",
    "source": "arXiv",
    "abstract": "Symmetry constraints determine which physical responses are allowed in a given system. Magnetization induced by strain fields, such as in piezomagnetic and flexomagnetic effects, has typically been considered in materials that break time-reversal symmetry. Here, we propose that nonuniform strain can induce magnetization even in nonmagnetic metals and semiconductors that preserve time-reversal symmetry. This mechanism differs from the conventional flexomagnetic effect: the strain gradient acts as a driving force on the electrons, generating magnetization in a manner closely analogous to current-induced magnetization. Treating the strain field as an external field, we derive a general expression for the magnetization induced by a strain gradient and demonstrate that this response is symmetry-allowed even in time-reversal symmetric systems. We apply our formulation to nonmagnetic systems that lack spatial inversion symmetry while preserving time-reversal symmetry, using a decorated square lattice, monolayer MoS$_2$, and monolayer Janus MoSSe as representative examples. We find a finite magnetization response to strain gradients, which is consistent with symmetry arguments, supporting the validity of our theoretical framework. These results offer a pathway for controlling magnetization in nonmagnetic materials using strain fields."
  },
  {
    "date": "2026-02-04",
    "title": "On the pure traction problem of linear elasticity: a regularized formulation and its robust approximation",
    "authors": "Ahsan Kaleem, Cristian Gebhardt, Ignacio Romero",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.04359v1",
    "source": "arXiv",
    "abstract": "The pure traction problem of elasticity appears frequently in engineering applications, and its complexity stems from the fact that its solution is unique only up to (infinitesimal) rigid body motions. When finite elements are employed to approximate this problem, one solution is typically singled out by applying carefully selected boundary conditions on the discrete model or by imposing global constraints on the deformation. However, neither of these strategies is both simple and computationally efficient. In this work, we propose a new approach to solving the pure traction problem that overcomes existing limitations. Our method builds on a regularized form of the problem whose solution is shown to be unique, converges to the original solution of minimal norm, and can be approximated with finite elements in a straightforward way, without additional degrees of freedom. Additionally, we analyze the situation in which the approximation of the solution domain renders the loading of the discretized problem non-equilibrated, making the problem ill-posed. In this case, we propose a regularized predictor--corrector finite element formulation that handles the incompatibilities of the loading, providing a solution that converges to that of the original Neumann problem as the mesh size and the regularizing parameter tend to zero. Numerical examples illustrate the effectiveness of the proposed approach for representative problems in mechanics where pure traction boundary conditions appear."
  },
  {
    "date": "2026-02-04",
    "title": "Quantum-Assisted Design of Space-Terrestrial Integrated Networks",
    "authors": "Chiara Vercellino, Giacomo Vitali, Paolo Viviani, Alberto Scionti, Olivier Terzo, Bartolomeo Montrucchio, Pascal Jahan Elahi, Ugo Varetto",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.04350v1",
    "source": "arXiv",
    "abstract": "Achieving ubiquitous global connectivity requires integrating satellite and terrestrial networks, particularly to serve remote and underserved regions. In this work, we investigate the design and optimization of Space-Terrestrial Integrated Networks (STINs) using a hybrid quantum-classical approach. We formalize three key combinatorial optimization problems: the Satellite Selection Problem (SSP), the Gateway Selection Problem (GSP), and the Spectrum Assignment Problem (SAP), each capturing critical aspects of network deployment and operation. Leveraging neutral-atom quantum processors, we map the SSP onto a Maximum Weight Independent Set problem, embedding it onto the Aquila platform and solving it via the Quantum Adiabatic Algorithm (QAA). Postprocessing ensures feasible solutions that guide downstream GSP and SAP optimization. Benchmarking across 165 realistic remote regions shows that QAA solutions closely match classical exact solvers and outperform greedy heuristics, while subsequent GSP and SAP outcomes remain largely robust to differences in initial satellite selection. These results demonstrate that quantum optimization achieves performance broadly comparable to classical approaches for end-to-end STIN design, with rare instances where it can even surpass state-of-the-art solvers. This suggests that, while not yet consistently superior, quantum methods may offer competitive advantages for larger or more complex instances of the underlying combinatorial subproblems."
  },
  {
    "date": "2026-02-04",
    "title": "Improved Fluid Modeling of Space Debris Generated Ion-Acoustic Precursor Solitons",
    "authors": "Ajaz Mir, Abhijit Sen, Pintu Bandyopadhyay, Sanat Tiwari, Chris Crabtree, Gurudas Ganguli",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.04338v1",
    "source": "arXiv",
    "abstract": "This study reexamines the excitation of ion-acoustic precursor solitons by a supersonically moving charged debris object, incorporating two previously overlooked physical factors: the dynamic charging of the debris and the impermeable nature of its surface. The influence of charging dynamics is explored using an enhanced one-dimensional fluid-Poisson model, where the source charge is treated as a dynamical variable and solved self-consistently alongside the core plasma equations. By comparing these results with prior fixed-charge models, we evaluate the effects on soliton onset and propagation, finding that charging dynamics does not hinder soliton generation or evolution. To assess the impact of the impermeability of debris surface, a two-dimensional fluid model simulates the interaction between an electrostatically biased, impenetrable object and a flowing plasma. Modeling the object as an infinite wall disconnects the upstream and downstream plasma regions, forming a sheath without solitons -- consistent with earlier fluid and particle-in-cell simulations. However, replacing the wall with a finite object enables plasma flow around it, restoring upstream-downstream connectivity and naturally generating precursor solitons."
  },
  {
    "date": "2026-02-04",
    "title": "They Call Her 'Miss' and Him 'Professor': Lived Experiences of Women Teaching Support Staff in IT/SE Education",
    "authors": "Vasudha Malhotra, Rhea D'silva, Rashina Hoda",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.04332v1",
    "source": "arXiv",
    "abstract": "Despite their critical role in shaping student learning in computing education, the contributions of women teaching-support staff (TSS) often go unrecognised and undervalued. In this experience report, we synthesise lived experiences of 15 women TSS in IT/SE higher education to illuminate how authority is earned, resisted, and maintained in everyday teaching. Participants shared both their positive and negative lived experiences associated with finding and losing voice with teaching team colleagues on the one hand, and rewarding connections and gendered friction with students on the other. We map these dynamics onto an intersectional \"wheel of privilege and power\" tailored to TSS roles. The farther a TSS profile sits from the wheel's center (e.g., non-native English, non-white, younger-seeming, non-permanent, early-career), the more relational, emotional, and disciplinary labour is needed to reach parity. We provide actionable insights and recommendations for creating more inclusive education environments in technology dominant fields that are particularly timely as universities worldwide grapple with post-pandemic teaching models and seek to build more inclusive and resilient academic communities."
  },
  {
    "date": "2026-02-04",
    "title": "Safe and Stylized Trajectory Planning for Autonomous Driving via Diffusion Model",
    "authors": "Shuo Pei, Yong Wang, Yuanchen Zhu, Chen Sun, Qin Li, Yanan Zhao, Huachun Tan",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.04329v1",
    "source": "arXiv",
    "abstract": "Achieving safe and stylized trajectory planning in complex real-world scenarios remains a critical challenge for autonomous driving systems. This paper proposes the SDD Planner, a diffusion-based framework designed to effectively reconcile safety constraints with driving styles in real time. The framework integrates two core modules: a Multi-Source Style-Aware Encoder, which employs distance-sensitive attention to fuse dynamic agent data and environmental contexts for heterogeneous safety-style perception; and a Style-Guided Dynamic Trajectory Generator, which adaptively modulates priority weights within the diffusion denoising process to generate user-preferred yet safe trajectories. Extensive experiments demonstrate that SDD Planner achieves state-of-the-art performance. On the StyleDrive benchmark, it improves the SM-PDMS metric by 3.9% over WoTE, the strongest baseline. Furthermore, on the NuPlan Test14 and Test14-hard benchmarks, SDD Planner ranks first with overall scores of 91.76 and 80.32, respectively, outperforming leading methods such as PLUTO. Real-vehicle closed-loop tests further confirm that SDD Planner maintains high safety standards while aligning with preset driving styles, validating its practical applicability for real-world deployment."
  },
  {
    "date": "2026-02-04",
    "title": "Multiview Self-Representation Learning across Heterogeneous Views",
    "authors": "Jie Chen, Zhu Wang, Chuanbin Liu, Xi Peng",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.04328v1",
    "source": "arXiv",
    "abstract": "Features of the same sample generated by different pretrained models often exhibit inherently distinct feature distributions because of discrepancies in the model pretraining objectives or architectures. Learning invariant representations from large-scale unlabeled visual data with various pretrained models in a fully unsupervised transfer manner remains a significant challenge. In this paper, we propose a multiview self-representation learning (MSRL) method in which invariant representations are learned by exploiting the self-representation property of features across heterogeneous views. The features are derived from large-scale unlabeled visual data through transfer learning with various pretrained models and are referred to as heterogeneous multiview data. An individual linear model is stacked on top of its corresponding frozen pretrained backbone. We introduce an information-passing mechanism that relies on self-representation learning to support feature aggregation over the outputs of the linear model. Moreover, an assignment probability distribution consistency scheme is presented to guide multiview self-representation learning by exploiting complementary information across different views. Consequently, representation invariance across different linear models is enforced through this scheme. In addition, we provide a theoretical analysis of the information-passing mechanism, the assignment probability distribution consistency and the incremental views. Extensive experiments with multiple benchmark visual datasets demonstrate that the proposed MSRL method consistently outperforms several state-of-the-art approaches."
  },
  {
    "date": "2026-02-04",
    "title": "Lattices with congruence densities larger than $3/32$",
    "authors": "Gábor Czédli",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.04321v1",
    "source": "arXiv",
    "abstract": "By a 1997 result of R. Freese, an $n$-element lattice has at most $2^{n-1}$ congruences. This motivates us to define the congruence density cd$(L)$ of a finite $n$-element lattice as $|$Con$(L)|/2^{n-1}$, where $|$Con$(L)|$ is the number of elements of the congruence lattice Con$(L)$ of $L$. We prove that whenever $L$ is a finite lattice with cd$(L)>3/32$, then $L$ has the same number of join-irreducible and meet-irreducible elements. This result is sharp, since there exists a six-element lattice $R_6$ with cd$(R_6)=3/32$ but fewer join-irreducible than meet-irreducible elements. By R. Freese, C. Mureşan, J. Kulin, and the present author's results, lattices with congruence densities larger than $1/8$ have already been described. Here we decrease the lower threshold from $1/8$ to $3/32$. That is, we describe all finite lattices $L$ such that cd$(L)>3/32$. As a corollary, we give the $k$th largest number of congruences of $n$-element lattices for $n>8$ and $k\\in\\{n+1, n+2, n+3,n+4\\}$."
  },
  {
    "date": "2026-02-04",
    "title": "Identifying knowledge gaps in biodiversity data and their determinants at the regional level",
    "authors": "Didier Alard, Anaïs Guéry",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.04314v1",
    "source": "arXiv",
    "abstract": "Biodiversity open-access databases are valuable resources in the structuring and accessibility of species occurrence data. By compiling different data sources, they reveal the uneven spatial distribution of knowledge, with areas or taxonomic groups better prospected than others. Understanding the determinants of spatial and taxonomic knowledge gaps helps in informing the use of open-access data. Here, we identified knowledge gaps' determinants within a French regional biodiversity database, in the largest administrative region in France. Knowledge gaps were assessed using two metrics, completeness and ignorance scores, for 8 taxonomic groups covering five vertebrates and three invertebrates groups. The data was analyzed for the entire region, but also at the level of the three former sub-regions, to identify the potential drivers that may account for knowledge gaps' determinants. Our findings show that invertebrates were characterized by higher knowledge gaps than vertebrates. Overall, knowledge gaps are influenced by variables related to sites' accessibility rather than ecological appeal across both metrics. All groups shared similar determinants of gaps, except for the impact of agricultural pressure which is found to be more significant for invertebrates than vertebrates. Ultimately, our study emphasizes the impact of biodiversity governance, through local funding and regional political decisions, on knowledge distribution in open-access databases. We recommend limiting these biases by redirecting biodiversity funding towards under-sampled taxonomic groups and under-prospected areas. When not possible, users of data extracted from these databases should correct for spatial-sampling biases (SSP) using knowledge gaps' maps in order to get a more accurate understanding of species occurrence."
  },
  {
    "date": "2026-02-04",
    "title": "A Multimodal fNIRS-EEG Dataset for Unilateral Limb Motor Imagery",
    "authors": "Lufeng Feng, Baomin Xu, Haoran Zhang, Bihai Lin, Zuxuan Deng, Sidi Tao, Chenyu Liu, Shifan Jia, Li Duan, Ziyu Jia",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.04299v1",
    "source": "arXiv",
    "abstract": "Unilateral limb motor imagery (MI) plays an important role in upper-limb motor rehabilitation and precise control of external devices, and places higher demands on spatial resolution. However, most existing public datasets focus on binary- or four-class left-right limb paradigms that mainly exploit coarse hemispheric lateralization, and there is still a lack of multimodal datasets that simultaneously record EEG and fNIRS for unilateral multi-directional MI. To address this gap, we constructed MIND, a public motor imagery fNIRS-EEG dataset based on a four-class directional MI paradigm of the right upper limb. The dataset includes 64-channel EEG recordings (1000 Hz) and 51-channel fNIRS recordings (47.62 Hz) from 30 participants (12 females, 18 males; aged 19.0-25.0 years). We analyse the spatiotemporal characteristics of EEG spectral power and hemodynamic responses, and validate the potential advantages of hybrid fNIRS-EEG BCIs in terms of classification accuracy. We expect that this dataset will facilitate the evaluation and comparison of neuroimaging analysis and decoding methods."
  },
  {
    "date": "2026-02-04",
    "title": "ProxyWar: Dynamic Assessment of LLM Code Generation in Game Arenas",
    "authors": "Wenjun Peng, Xinyu Wang, Qi Wu",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.04296v1",
    "source": "arXiv",
    "abstract": "Large language models (LLMs) have revolutionized automated code generation, yet the evaluation of their real-world effectiveness remains limited by static benchmarks and simplistic metrics. We present ProxyWar, a novel framework that systematically assesses code generation quality by embedding LLM-generated agents within diverse, competitive game environments. Unlike existing approaches, ProxyWar evaluates not only functional correctness but also the operational characteristics of generated programs, combining automated testing, iterative code repair, and multi-agent tournaments to provide a holistic view of program behavior. Applied to a range of state-of-the-art coders and games, our approach uncovers notable discrepancies between benchmark scores and actual performance in dynamic settings, revealing overlooked limitations and opportunities for improvement. These findings highlight the need for richer, competition-based evaluation of code generation. Looking forward, ProxyWar lays a foundation for research into LLM-driven algorithm discovery, adaptive problem solving, and the study of practical efficiency and robustness, including the potential for models to outperform hand-crafted agents. The project is available at https://github.com/xinke-wang/ProxyWar."
  },
  {
    "date": "2026-02-04",
    "title": "Event-T2M: Event-level Conditioning for Complex Text-to-Motion Synthesis",
    "authors": "Seong-Eun Hong, JaeYoung Seon, JuYeong Hwang, JongHwan Shin, HyeongYeop Kang",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.04292v1",
    "source": "arXiv",
    "abstract": "Text-to-motion generation has advanced with diffusion models, yet existing systems often collapse complex multi-action prompts into a single embedding, leading to omissions, reordering, or unnatural transitions. In this work, we shift perspective by introducing a principled definition of an event as the smallest semantically self-contained action or state change in a text prompt that can be temporally aligned with a motion segment. Building on this definition, we propose Event-T2M, a diffusion-based framework that decomposes prompts into events, encodes each with a motion-aware retrieval model, and integrates them through event-based cross-attention in Conformer blocks. Existing benchmarks mix simple and multi-event prompts, making it unclear whether models that succeed on single actions generalize to multi-action cases. To address this, we construct HumanML3D-E, the first benchmark stratified by event count. Experiments on HumanML3D, KIT-ML, and HumanML3D-E show that Event-T2M matches state-of-the-art baselines on standard tests while outperforming them as event complexity increases. Human studies validate the plausibility of our event definition, the reliability of HumanML3D-E, and the superiority of Event-T2M in generating multi-event motions that preserve order and naturalness close to ground-truth. These results establish event-level conditioning as a generalizable principle for advancing text-to-motion generation beyond single-action prompts."
  },
  {
    "date": "2026-02-04",
    "title": "Robust, High-Contrast, Recyclable Zinc-Based Dynamic Windows via Synergistic Electrolyte and Interfacial Engineering",
    "authors": "Fei Peng, Zhichao Liang, Zhoutao Yang, Yijia Chen, Wenjie Mai, Chuanxi Zhao",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.04280v1",
    "source": "arXiv",
    "abstract": "Zinc-based electrochromic devices offer a sustainable route for dynamic optical management but are plagued by poor cycling stability due to irreversible zinc plating/stripping and side reactions. Herein, we report a robust, high-contrast, and recyclable zinc-based dynamic window enabled by a synergistic electrolyte and interfacial engineering strategy. Molecular dynamics simulations and electrochemical analyses reveal a dual-ion cooperative mechanism that governs the reversibility: anions with the strongest binding affinity guide uniform Zn deposition by stabilizing the inner solvation shell, while formate anions co-enriched at the interface facilitate smooth stripping via protonation during the oxidation process. This orchestrated interplay effectively eliminates \"dead Zn\" accumulation and dendrite growth. Consequently, the device demonstrates a record-high lifespan of 15,000 cycles with negligible degradation and maintains a large optical modulation of >50%, along with multiple optical states (transparent, gray, black, and mirror). Furthermore, it achieves a large reflectance modulation (>50%) stable for over 2,000 cycles. This work establishes the recyclable zinc-based dynamic window as a scalable, high-performance alternative to conventional electrochromic systems, advancing the feasibility of solution-processed energy-saving windows in sustainable buildings."
  },
  {
    "date": "2026-02-04",
    "title": "Aortic Valve Disease Detection from PPG via Physiology-Informed Self-Supervised Learning",
    "authors": "Jiaze Wang, Qinghao Zhao, Zizheng Chen, Zhejun Sun, Deyun Zhang, Yuxi Zhou, Shenda Hong",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.04266v1",
    "source": "arXiv",
    "abstract": "Traditional diagnosis of aortic valve disease relies on echocardiography, but its cost and required expertise limit its use in large-scale early screening. Photoplethysmography (PPG) has emerged as a promising screening modality due to its widespread availability in wearable devices and its ability to reflect underlying hemodynamic dynamics. However, the extreme scarcity of gold-standard labeled PPG data severely constrains the effectiveness of data-driven approaches. To address this challenge, we propose and validate a new paradigm, Physiology-Guided Self-Supervised Learning (PG-SSL), aimed at unlocking the value of large-scale unlabeled PPG data for efficient screening of Aortic Stenosis (AS) and Aortic Regurgitation (AR). Using over 170,000 unlabeled PPG samples from the UK Biobank, we formalize clinical knowledge into a set of PPG morphological phenotypes and construct a pulse pattern recognition proxy task for self-supervised pre-training. A dual-branch, gated-fusion architecture is then employed for efficient fine-tuning on a small labeled subset. The proposed PG-SSL framework achieves AUCs of 0.765 and 0.776 for AS and AR screening, respectively, significantly outperforming supervised baselines trained on limited labeled data. Multivariable analysis further validates the model output as an independent digital biomarker with sustained prognostic value after adjustment for standard clinical risk factors. This study demonstrates that PG-SSL provides an effective, domain knowledge-driven solution to label scarcity in medical artificial intelligence and shows strong potential for enabling low-cost, large-scale early screening of aortic valve disease."
  },
  {
    "date": "2026-02-04",
    "title": "Thickening-to-Thinning: Reward Shaping via Human-Inspired Learning Dynamics for LLM Reasoning",
    "authors": "Wenze Lin, Zhen Yang, Xitai Jiang, Pony Ma, Gao Huang",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.04265v1",
    "source": "arXiv",
    "abstract": "Reinforcement Learning with Verifiable Rewards (RLVR) has emerged as a promising paradigm for enhancing reasoning in Large Language Models (LLMs). However, it frequently encounters challenges such as entropy collapse, excessive verbosity, and insufficient exploration for hard problems. Crucially, existing reward schemes fail to distinguish between the need for extensive search during problem-solving and the efficiency required for mastered knowledge. In this work, we introduce T2T(Thickening-to-Thinning), a dynamic reward framework inspired by human learning processes. Specifically, it implements a dual-phase mechanism: (1) On incorrect attempts, T2T incentivizes \"thickening\" (longer trajectories) to broaden the search space and explore novel solution paths; (2) Upon achieving correctness, it shifts to \"thinning\", imposing length penalties to discourage redundancy, thereby fostering model confidence and crystallizing reasoning capabilities. Extensive experiments on mathematical benchmarks (MATH-500, AIME, AMC) across Qwen-series and Deepseek models demonstrate that T2T significantly outperforms standard GRPO and recent baselines, achieving superior performance."
  },
  {
    "date": "2026-02-04",
    "title": "Massive coherent equipartition of light by the geometric phase of null space",
    "authors": "Xiangrui Hou, Dongyi Wang, Fangyu Wang, Congwei Lu, Zhaoju Yang, Guancong Ma",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.04259v1",
    "source": "arXiv",
    "abstract": "Light source is a foundational to photonic science and technology. However, a significant challenge remains in generating and distributing coherent light from a single on-chip source with high phase stability across multiple channels. Integrated lasers typically operate independently, and conventional splitters (e.g., multi-mode interferometers) do not guarantee the phase coherence required for advanced applications. Here, we report a purely geometric scheme for achieving massive equipartition of coherent light on a photonic chip by leveraging the geometric phases of a null space spanned by degenerate states with zero eigenvalue. The evolution of the null space maps to real-space rotation described by the special orthogonal group SO(N), thus enabling precise and scalable control over light distribution by engineering the system parameters. We experimentally realize up to one-to-nine equipartition of light on a waveguide array fabricated on a glass-based photonic chip. The framework can be upscaled for one-to-N light distribution. This work establishes a versatile and scalable platform for integrated coherent light sources, paving the way for integrated photonic applications such as quantum photonics and optical computing."
  },
  {
    "date": "2026-02-04",
    "title": "From Ambiguity to Action: A POMDP Perspective on Partial Multi-Label Ambiguity and Its Horizon-One Resolution",
    "authors": "Hanlin Pan, Yuhao Tang, Wanfu Gao",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.04255v1",
    "source": "arXiv",
    "abstract": "In partial multi-label learning (PML), the true labels are unobserved, which makes label disambiguation important but difficult. A key challenge is that ambiguous candidate labels can propagate errors into downstream tasks such as feature engineering. To solve this issue, we jointly model the disambiguation and feature selection tasks as Partially Observable Markov Decision Processes (POMDP) to turn PML risk minimization into expected-return maximization. Stage 1 trains a transformer policy via reinforcement learning to produce high-quality hard pseudo-labels; Stage 2 describes feature selection as a sequential reinforcement learning problem, selecting features step by step and outputting an interpretable global ranking. We further provide the theoretical analysis of PML-POMDP correspondence and the excess-risk bound that decompose the error into pseudo label quality term and sample size. Experiments in multiple metrics and data sets verify the advantages of the framework."
  },
  {
    "date": "2026-02-04",
    "title": "Tokenization and Morphological Fidelity in Uralic NLP: A Cross-Lingual Evaluation",
    "authors": "Nuo Xu, Ahrii Kim",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.04241v1",
    "source": "arXiv",
    "abstract": "Subword tokenization critically affects Natural Language Processing (NLP) performance, yet its behavior in morphologically rich and low-resource language families remains under-explored. This study systematically compares three subword paradigms -- Byte Pair Encoding (BPE), Overlap BPE (OBPE), and Unigram Language Model -- across six Uralic languages with varying resource availability and typological diversity. Using part-of-speech (POS) tagging as a controlled downstream task, we show that OBPE consistently achieves stronger morphological alignment and higher tagging accuracy than conventional methods, particularly within the Latin-script group. These gains arise from reduced fragmentation in open-class categories and a better balance across the frequency spectrum. Transfer efficacy further depends on the downstream tagging architecture, interacting with both training volume and genealogical proximity. Taken together, these findings highlight that morphology-sensitive tokenization is not merely a preprocessing choice but a decisive factor in enabling effective cross-lingual transfer for agglutinative, low-resource languages."
  },
  {
    "date": "2026-02-04",
    "title": "Post-Quantum Identity-Based TLS for 5G Service-Based Architecture and Cloud-Native Infrastructure",
    "authors": "Vipin Kumar Rathi, Lakshya Chopra, Nikhil Kumar Rajput",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.04238v1",
    "source": "arXiv",
    "abstract": "Cloud-native application platforms and latency-sensitive systems such as 5G Core networks rely heavily on certificate-based Public Key Infrastructure (PKI) and mutual TLS to secure service-to-service communication. While effective, this model introduces significant operational and performance overhead, which is further amplified in the post-quantum setting due to large certificates and expensive signature verification. In this paper, we present a certificate-free authentication framework for private distributed systems based on post-quantum Identity-Based Encryption(IBE). Our design replaces certificate and signature based authentication with identity-derived keys and identity-based key encapsulation, enabling mutually authenticated TLS connections without certificate transmission or validation. We describe an IBE-based replacement for private PKI, including identity lifecycle management, and show how it can be instantiated using a threshold Private Key Generator (T-PKG). We apply this framework to cloud-native application deployments and latency-sensitive 5G Core networks. In particular, we demonstrate how identity-based TLS integrates with the 5G Service-Based Architecture while preserving security semantics and 3GPP requirements, and we show how the same architecture can replace private PKI in Kubernetes, including its control plane, without disrupting existing trust domains or deployment models."
  },
  {
    "date": "2026-02-04",
    "title": "GeoLanG: Geometry-Aware Language-Guided Grasping with Unified RGB-D Multimodal Learning",
    "authors": "Rui Tang, Guankun Wang, Long Bai, Huxin Gao, Jiewen Lai, Chi Kit Ng, Jiazheng Wang, Fan Zhang, Hongliang Ren",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.04231v1",
    "source": "arXiv",
    "abstract": "Language-guided grasping has emerged as a promising paradigm for enabling robots to identify and manipulate target objects through natural language instructions, yet it remains highly challenging in cluttered or occluded scenes. Existing methods often rely on multi-stage pipelines that separate object perception and grasping, which leads to limited cross-modal fusion, redundant computation, and poor generalization in cluttered, occluded, or low-texture scenes. To address these limitations, we propose GeoLanG, an end-to-end multi-task framework built upon the CLIP architecture that unifies visual and linguistic inputs into a shared representation space for robust semantic alignment and improved generalization. To enhance target discrimination under occlusion and low-texture conditions, we explore a more effective use of depth information through the Depth-guided Geometric Module (DGGM), which converts depth into explicit geometric priors and injects them into the attention mechanism without additional computational overhead. In addition, we propose Adaptive Dense Channel Integration, which adaptively balances the contributions of multi-layer features to produce more discriminative and generalizable visual representations. Extensive experiments on the OCID-VLG dataset, as well as in both simulation and real-world hardware, demonstrate that GeoLanG enables precise and robust language-guided grasping in complex, cluttered environments, paving the way toward more reliable multimodal robotic manipulation in real-world human-centric settings."
  },
  {
    "date": "2026-02-04",
    "title": "Validating Causal Message Passing Against Network-Aware Methods on Real Experiments",
    "authors": "Albert Tan, Sadegh Shirani, James Nordlund, Mohsen Bayati",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.04230v1",
    "source": "arXiv",
    "abstract": "Estimating total treatment effects in the presence of network interference typically requires knowledge of the underlying interaction structure. However, in many practical settings, network data is either unavailable, incomplete, or measured with substantial error. We demonstrate that causal message passing, a methodology that leverages temporal structure in outcome data rather than network topology, can recover total treatment effects comparable to network-aware approaches. We apply causal message passing to two large-scale field experiments where a recently developed bipartite graph methodology, which requires network knowledge, serves as a benchmark. Despite having no access to the interaction network, causal message passing produces effect estimates that match the network-aware approach in direction across all metrics and in statistical significance for the primary decision metric. Our findings validate the premise of causal message passing: that temporal variation in outcomes can serve as an effective substitute for network observation when estimating spillover effects. This has important practical implications: practitioners facing settings where network data is costly to collect, proprietary, or unreliable can instead exploit the temporal dynamics of their experimental data."
  },
  {
    "date": "2026-02-04",
    "title": "Quantum fields from real-time ensemble dynamics",
    "authors": "Yong Zhang",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.04229v1",
    "source": "arXiv",
    "abstract": "Relativistic quantum field theory (QFT) is commonly formulated in terms of operators, asymptotic states, and covariant amplitudes, a perspective that tends to obscure the real-time origin of field dynamics and correlations. Here we formulate quantum fields in a real-time Schrödinger-picture framework, in which fields evolve as probability ensembles on the space of field configurations. Within this formulation, the wavefunctional $Ψ[φ,t]$ encodes a first-order, causal ensemble dynamics on configuration space. Interactions appear as couplings between configuration-space directions, while propagators arise as derived correlation structures rather than as fundamental postulates. Entanglement, scattering amplitudes, and conformal field theory correlators emerge as distinct projections of the same underlying ensemble evolution, corresponding to equal-time, asymptotic, and symmetry-organized observables. Standard operator, diagrammatic, and path-integral formulations are recovered as computational representations of this single real-time dynamics. This organization makes explicit the distinction between fundamental dynamical structure and representational tools in QFT, and clarifies the scope within which ensemble-averaged correlators account for quantum fluctuations, while also delineating the level at which questions associated with individual realizations and randomness would arise beyond the correlator-based field-theoretic description."
  },
  {
    "date": "2026-02-04",
    "title": "Sampled-Data Wasserstein Distributionally Robust Control of Multiplicative Systems: A Convex Relaxation with Performance Guarantees",
    "authors": "Chung-Han Hsieh",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.04219v1",
    "source": "arXiv",
    "abstract": "This paper investigates the robust optimal control of sampled-data stochastic systems with multiplicative noise and distributional ambiguity. We consider a class of discrete-time optimal control problems where the controller \\emph{jointly} selects a feedback policy and a sampling period to maximize the worst-case expected concave utility of the inter-sample growth factor. Modeling uncertainty via a Wasserstein ambiguity set, we confront the structural obstacle of~``concave-max'' geometry arising from maximizing a concave utility against an adversarial distribution. Unlike standard convex loss minimization, the dual reformulation here requires a minimax interchange within the semi-infinite constraints, where the utility's concavity precludes exact strong duality. To address this, we utilize a general minimax inequality to derive a tractable convex relaxation. Our approach yields a rigorous lower bound that functions as a probabilistic performance guarantee. We establish an explicit, non-asymptotic bound on the resulting duality gap, proving that the approximation error is uniformly controlled by the Lipschitz-smoothness of the stage reward and the diameter of the disturbance support. Furthermore, we introduce necessary and sufficient conditions for \\emph{robust viability}, ensuring state positivity invariance across the entire ambiguity set. Finally, we bridge the gap between static optimization and dynamic performance, proving that the optimal value of the relaxation serves as a rigorous deterministic floor for the asymptotic average utility rate almost surely. The framework is illustrated on a log-optimal portfolio control problem, which serves as a canonical instance of multiplicative stochastic control."
  },
  {
    "date": "2026-02-04",
    "title": "Fine-Grained Frame Modeling in Multi-head Self-Attention for Speech Deepfake Detection",
    "authors": "Tuan Dat Phuong, Duc-Tuan Truong, Long-Vu Hoang, Trang Nguyen Thi Thu",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.04702v1",
    "source": "arXiv",
    "abstract": "Transformer-based models have shown strong performance in speech deepfake detection, largely due to the effectiveness of the multi-head self-attention (MHSA) mechanism. MHSA provides frame-level attention scores, which are particularly valuable because deepfake artifacts often occur in small, localized regions along the temporal dimension of speech. This makes fine-grained frame modeling essential for accurately detecting subtle spoofing cues. In this work, we propose fine-grained frame modeling (FGFM) for MHSA-based speech deepfake detection, where the most informative frames are first selected through a multi-head voting (MHV) module. These selected frames are then refined via a cross-layer refinement (CLR) module to enhance the model's ability to learn subtle spoofing cues. Experimental results demonstrate that our method outperforms the baseline model and achieves Equal Error Rate (EER) of 0.90%, 1.88%, and 6.64% on the LA21, DF21, and ITW datasets, respectively. These consistent improvements across multiple benchmarks highlight the effectiveness of our fine-grained modeling for robust speech deepfake detection."
  },
  {
    "date": "2026-02-04",
    "title": "Unclustered tracers remain unclustered: the lack of primordial non-Gaussianity response of bias-zero tracers",
    "authors": "Celia Merino, Santiago Avila, A. G. Adame, A. Anguren, V. Gonzalez-Perez, J. Meneses-Rizo",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.04698v1",
    "source": "arXiv",
    "abstract": "Constraining primordial non-Gaussianities (PNG) is one of the main goals of new-generation large-scale galaxy surveys. It had been proposed that unclustered tracers (with bias $b_1=0$) could be optimal for PNG studies, and that these could be found by selecting galaxies in bins of their local density. Here, we test this hypothesis in state-of-the-art simulations from the PNG-UNITsim suite with local $f_{\\rm NL}=100$ and $f_{\\rm NL}=-20$. We consider different parent tracer catalogues: all halos together, halos in large mass bins, and HOD models for LRGs and QSO. We then classify these tracers by their local density ($δ_{t,R}$) and measure the linear bias ($b_1$) and PNG-response ($b_φ$). Most $δ_{t,R}$ bins show a PNG-response compatible with $b_φ=0$ for all halos or the low-mass bin (log$M<11$). For high-mass halos (log$M>$12), QSO or LRG, we recover a trend closer to the universality relation ($b_φ= 2 δ_{\\rm crit}(b_1-1)$) for $b_1>1$, but the $b_φ(b_1)$ curve flattens to 0 below $\\vert b_1\\lvert<1$. Hence, we find $b_φ\\approx0$ for all bias-zero tracers considered. The complex $δ_{t,R}$-based selection causes their clustering to strongly deviate from simple assumptions, namely the universality relation and Poisson shot noise, hindering their capability to constrain PNG."
  },
  {
    "date": "2026-02-04",
    "title": "LinGO: A Linguistic Graph Optimization Framework with LLMs for Interpreting Intents of Online Uncivil Discourse",
    "authors": "Yuan Zhang, Thales Bertaglia",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.04693v1",
    "source": "arXiv",
    "abstract": "Detecting uncivil language is crucial for maintaining safe, inclusive, and democratic online spaces. Yet existing classifiers often misinterpret posts containing uncivil cues but expressing civil intents, leading to inflated estimates of harmful incivility online. We introduce LinGO, a linguistic graph optimization framework for large language models (LLMs) that leverages linguistic structures and optimization techniques to classify multi-class intents of incivility that use various direct and indirect expressions. LinGO decomposes language into multi-step linguistic components, identifies targeted steps that cause the most errors, and iteratively optimizes prompt and/or example components for targeted steps. We evaluate it using a dataset collected during the 2022 Brazilian presidential election, encompassing four forms of political incivility: Impoliteness (IMP), Hate Speech and Stereotyping (HSST), Physical Harm and Violent Political Rhetoric (PHAVPR), and Threats to Democratic Institutions and Values (THREAT). Each instance is annotated with six types of civil/uncivil intent. We benchmark LinGO using three cost-efficient LLMs: GPT-5-mini, Gemini 2.5 Flash-Lite, and Claude 3 Haiku, and four optimization techniques: TextGrad, AdalFlow, DSPy, and Retrieval-Augmented Generation (RAG). The results show that, across all models, LinGO consistently improves accuracy and weighted F1 compared with zero-shot, chain-of-thought, direct optimization, and fine-tuning baselines. RAG is the strongest optimization technique and, when paired with Gemini model, achieves the best overall performance. These findings demonstrate that incorporating multi-step linguistic components into LLM instructions and optimize targeted components can help the models explain complex semantic meanings, which can be extended to other complex semantic explanation tasks in the future."
  },
  {
    "date": "2026-02-04",
    "title": "HFMCA: Orthonormal Feature Learning for EEG-based Brain Decoding",
    "authors": "Yinghao Wang, Lintao Xu, Shujian Yu, Enzo Tartaglione, Van-Tam Nguyen",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.04681v1",
    "source": "arXiv",
    "abstract": "Electroencephalography (EEG) analysis is critical for brain-computer interfaces and neuroscience, but the intrinsic noise and high dimensionality of EEG signals hinder effective feature learning. We propose a self-supervised framework based on the Hierarchical Functional Maximal Correlation Algorithm (HFMCA), which learns orthonormal EEG representations by enforcing feature decorrelation and reducing redundancy. This design enables robust capture of essential brain dynamics for various EEG recognition tasks. We validate HFMCA on two benchmark datasets, SEED and BCIC-2A, where pretraining with HFMCA consistently outperforms competitive self-supervised baselines, achieving notable gains in classification accuracy. Across diverse EEG tasks, our method demonstrates superior cross-subject generalization under leave-one-subject-out validation, advancing state-of-the-art by 2.71\\% on SEED emotion recognition and 2.57\\% on BCIC-2A motor imagery classification."
  },
  {
    "date": "2026-02-04",
    "title": "LID Framework: A new method for geospatial and exploratory data analysis of potential innovation deter-minants at the neighborhood level",
    "authors": "Eleni Oikonomaki, Belivanis Dimitris, Kakderi Christina",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.04679v1",
    "source": "arXiv",
    "abstract": "The geography of innovation offers a framework to understand how territorial characteristics shape innovation, often via spatial and cognitive proximity. Empirical research has focused largely on national and regional scales, while urban and sub-regional geographies receive less attention. Local studies typically rely on limited indicators (e.g., firm-level data, patents, basic socioeconomic measures), with few offering a systematic framework integrating urban form, mobility, amenities, and human-capital proxies at the neighborhood scale. Our study investigates innovation at a finer spatial resolution, going beyond proprietary or static indicators. We develop the Local Innovation Determinants (LID) database and framework to identify key enabling factors across regions, combining traditional government data with publicly available data via APIs for a more granular understanding of spatial dynamics shaping innovation capacity. Using exploratory big and geospatial data analytics and random forest models, we examine neighborhoods in New York and Massachusetts across four dimensions: social factors, economic characteristics, land use and mobility, morphology, and environment. Results show that alternative data sources offer significant yet underexplored potential to enhance insights into innovation dynamics. City policymakers should consider neighborhood-specific determinants and characteristics when designing and implementing local innovation strategies."
  },
  {
    "date": "2026-02-04",
    "title": "Pre-optimization of quantum circuits, barren plateaus and classical simulability: tensor networks to unlock the variational quantum eigensolver",
    "authors": "Baptiste Anselme Martin, Thomas Ayral",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.04676v1",
    "source": "arXiv",
    "abstract": "Variational quantum algorithms are practical approaches to prepare ground states, but their potential for quantum advantage remains unclear. Here, we use differentiable 2D tensor networks (TN) to optimize parameterized quantum circuits that prepare the ground state of the transverse field Ising model (TFIM). Our method enables the preparation of states with high energy accuracy, even for large systems beyond 1D. We show that TN pre-optimization can mitigate the barren plateau issue by giving access to enhanced gradient zones that do not shrink exponentially with system size. We evaluate the classical simulation cost evaluating energies at these warm-starts, and identify regimes where quantum hardware offers better scaling than TN simulations."
  },
  {
    "date": "2026-02-04",
    "title": "A Parameterized Physics Informed Neural Network Solver for the Navier Stokes Equations Across Reynolds Numbers",
    "authors": "A. Jangir, R. Clements, R. Goyal, G. Tabor",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.04670v1",
    "source": "arXiv",
    "abstract": "Physics informed neural networks provide a meshfree framework for solving partial differential equations by embedding governing physical laws directly into the training process. However, most PINNs developed for fluid dynamics remain restricted to fixed flow parameters, requiring retraining for each new condition and limiting their usefulness as general purpose solvers. In this work, we develop a parameterized PINNs formulation for the incompressible Navier Stokes equations in which the Reynolds number (Re) is treated as an explicit network input, enabling a single trained model to represent a continuous family of flow solutions. The approach is demonstrated using the 2D lid driven cavity flow as a canonical benchmark. For low Re, where the flow is laminar and diffusion dominated, pure PINNs trained solely using the governing equations and boundary conditions accurately reproduce velocity and pressure fields across a wide range of Re, including cases not explicitly sampled during training. As the Re increases and the flow becomes increasingly convection dominated, the predictive accuracy of pure PINNs deteriorates due to stiffness and optimization imbalance. To address this limitation, a hybrid framework is introduced that combines transfer learning with sparse supervision from high fidelity CFD data. The resulting parameterized PINNs model accurately captures the Re dependence of the flow over both interpolation and limited extrapolation regimes while requiring CFD data only over a narrow subset of the parameter space. Detailed comparisons with OpenFOAM simulations demonstrate strong agreement in velocity profiles, and pressure fields. The results show that incorporating governing parameters directly into PINNs enables the construction of parametric Navier Stokes solvers, offering a promising route toward efficient reduced order modeling and data assisted simulation of fluid flows."
  },
  {
    "date": "2026-02-04",
    "title": "Estimation of reliability and accuracy of models of $\\varphi$-sub-Gaussian process using generating functions of polynomial expansions",
    "authors": "Oleksandr Mokliachuk",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.04668v1",
    "source": "arXiv",
    "abstract": "Stochastic processes are often represented through orthonormal series expansions, a framework originating in the classical works of Loève and Karhunen and widely used for simulation and numerical approximation. While truncation error in such expansions has been extensively studied, practical models frequently involve an additional source of error arising from the approximation of coefficient functions when closed-form expressions are unavailable. The combined effect of these two errors remains insufficiently addressed in the literature. Building on the author's earlier work on reliability and accuracy estimates for $\\varphi$-sub-Gaussian processes, this paper extends the methodology to orthonormal polynomial systems that do not possess normalized generating functions in analytical form, including the Legendre, generalized Laguerre, and Gegenbauer families. New bounds are derived for models in $L_p(T)$ and $C([0,T])$ that simultaneously account for truncation and coefficient approximation. The resulting criteria provide practical guidance for selecting the number of series terms required to achieve prescribed levels of reliability and accuracy across a broader class of polynomial-based stochastic process models."
  },
  {
    "date": "2026-02-04",
    "title": "Polygons and multi-product of eigenfunctions",
    "authors": "Emmett L. Wyman, Yakun Xi, Yi Zhang",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.04664v1",
    "source": "arXiv",
    "abstract": "Let $M$ be a compact Riemannian manifold without boundary, with $L^2$-normalized Laplace-Beltrami eigenfunctions $\\{e_j\\}_j$, which satisfy $Δ_g e_j = -λ_j^2 e_j$. We study the following inner product of eigenfunctions \\[ \\langle e_{i_1} e_{i_2} \\ldots e_{i_k}, e_{i_{k+1}} \\rangle = \\int e_{i_1} e_{i_2}\\ldots e_{i_k} \\overline{e_{i_{k+1}}} \\, dV. \\] We show that, after a mild averaging in the frequency variables, the main $\\ell^2$-concentration of this inner product is determined by the measure of a set of configurations of $(k+1)$-gons whose side lengths are the frequencies $λ_{i_1}, λ_{i_2}, \\dots, λ_{i_{k+1}}$. We prove that a rapidly vanishing proportion of this mass lies in the regime where $λ_{i_1}, λ_{i_2}, \\dots, λ_{i_{k+1}}$ cannot occur as the side lengths of any $(k+1)$-gon."
  },
  {
    "date": "2026-02-04",
    "title": "Rethinking the Design Space of Reinforcement Learning for Diffusion Models: On the Importance of Likelihood Estimation Beyond Loss Design",
    "authors": "Jaemoo Choi, Yuchen Zhu, Wei Guo, Petr Molodyk, Bo Yuan, Jinbin Bai, Yi Xin, Molei Tao, Yongxin Chen",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.04663v1",
    "source": "arXiv",
    "abstract": "Reinforcement learning has been widely applied to diffusion and flow models for visual tasks such as text-to-image generation. However, these tasks remain challenging because diffusion models have intractable likelihoods, which creates a barrier for directly applying popular policy-gradient type methods. Existing approaches primarily focus on crafting new objectives built on already heavily engineered LLM objectives, using ad hoc estimators for likelihood, without a thorough investigation into how such estimation affects overall algorithmic performance. In this work, we provide a systematic analysis of the RL design space by disentangling three factors: i) policy-gradient objectives, ii) likelihood estimators, and iii) rollout sampling schemes. We show that adopting an evidence lower bound (ELBO) based model likelihood estimator, computed only from the final generated sample, is the dominant factor enabling effective, efficient, and stable RL optimization, outweighing the impact of the specific policy-gradient loss functional. We validate our findings across multiple reward benchmarks using SD 3.5 Medium, and observe consistent trends across all tasks. Our method improves the GenEval score from 0.24 to 0.95 in 90 GPU hours, which is $4.6\\times$ more efficient than FlowGRPO and $2\\times$ more efficient than the SOTA method DiffusionNFT without reward hacking."
  },
  {
    "date": "2026-02-04",
    "title": "Wide binaries without viable bound Newtonian orbits",
    "authors": "L. Pasquini, R. Saglia, F. Patat, L. Berni, D. Bossini, L. Magrini, H. Ludwig, M. T. Murphy, J. R. de Medeiros, J. Chanamé",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.04661v1",
    "source": "arXiv",
    "abstract": "Context. Wide binaries offer a unique opportunity to test gravity in the low acceleration regime, where deviations from Newtonian dynamics may appear. Aims. We use high-resolution VLT-ESPRESSO archival spectra to study 26 wide binaries with projected separations larger than 13,000 AU. By combining precise radial velocities with Gaia proper motions and parallaxes, we aim to test whether these systems are consistent with Newtonian gravity in the low acceleration regime. Methods. We use multiple radial velocity measurements and stellar parameters to remove systems affected by unresolved triples, chance alignments, or young systems. For the remaining binaries, we combine radial velocities (corrected for convective shift and gravitational redshift) with Gaia proper motions, parallaxes, and positions to attempt bound Newtonian orbital solutions Results. Fourteen of the 26 initial systems were discarded: 12 due to radial velocity variability indicating unresolved close binaries, one hosting a faint Gaia companion, and one too young. Of the remaining 12, nine can be fitted with bound orbital solution, while three show velocity differences too large to be reconciled with any bound Newtonian orbit. Conclusions. For the three systems that cannot be fitted with a bound orbit, repeated radial velocity observations allow us to confidently exclude, with one possible exception, unresolved triple stellar companions or massive close-in planets as causes. Given their likely large 3-dimensional separations, these binaries may have been dynamically perturbed or disrupted by stellar encounters or Galactic tides, and may no longer be gravitationally bound. This highlights how utmost caution must be applied when studying wide binaries as isolated systems."
  },
  {
    "date": "2026-02-04",
    "title": "Approaches to Semantic Textual Similarity in Slovak Language: From Algorithms to Transformers",
    "authors": "Lukas Radosky, Miroslav Blstak, Matej Krajcovic, Ivan Polasek",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.04659v1",
    "source": "arXiv",
    "abstract": "Semantic textual similarity (STS) plays a crucial role in many natural language processing tasks. While extensively studied in high-resource languages, STS remains challenging for under-resourced languages such as Slovak. This paper presents a comparative evaluation of sentence-level STS methods applied to Slovak, including traditional algorithms, supervised machine learning models, and third-party deep learning tools. We trained several machine learning models using outputs from traditional algorithms as features, with feature selection and hyperparameter tuning jointly guided by artificial bee colony optimization. Finally, we evaluated several third-party tools, including fine-tuned model by CloudNLP, OpenAI's embedding models, GPT-4 model, and pretrained SlovakBERT model. Our findings highlight the trade-offs between different approaches."
  },
  {
    "date": "2026-02-04",
    "title": "PIO-FVLM: Rethinking Training-Free Visual Token Reduction for VLM Acceleration from an Inference-Objective Perspective",
    "authors": "Haokui Zhang, Congyang Ou, Dawei Yan, Peng Wang, Qingsen Yan, Ying Li, Rong Xiao, Chunhua Shen",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.04657v1",
    "source": "arXiv",
    "abstract": "Recently, reducing redundant visual tokens in vision-language models (VLMs) to accelerate VLM inference has emerged as a hot topic. However, most existing methods rely on heuristics constructed based on inter-visual-token similarity or cross-modal visual-text similarity, which gives rise to certain limitations in compression performance and practical deployment. In contrast, we propose PIO-FVLM from the perspective of inference objectives, which transforms visual token compression into preserving output result invariance and selects tokens primarily by their importance to this goal. Specially, vision tokens are reordered with the guidance of token-level gradient saliency generated by our designed layer-local proxy loss, a coarse constraint from the current layer to the final result. Then the most valuable vision tokens are selected following the non-maximum suppression (NMS) principle. The proposed PIO-FVLM is training-free and compatible with FlashAttention, friendly to practical application and deployment. It can be deployed independently as an encoder-free method, or combined with encoder compression approaches like VisionZip for use as an encoder-involved method. On LLaVA-Next-7B, PIO-FVLM retains just 11.1% of visual tokens but maintains 97.2% of the original performance, with a 2.67$\\times$ prefill speedup, 2.11$\\times$ inference speedup, 6.22$\\times$ lower FLOPs, and 6.05$\\times$ reduced KV Cache overhead. Our code is available at https://github.com/ocy1/PIO-FVLM."
  },
  {
    "date": "2026-02-04",
    "title": "L^2-Betti numbers in prime characteristic and a conjecture of Wise",
    "authors": "Grigori Avarmidi, Wolfgang Lueck",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.04655v1",
    "source": "arXiv",
    "abstract": "We systematically study L^2-Betti numbers in zero and prime characteristic and apply them to a conjecture of Wise stating that all towers of a finite 2-complex are non-positive if and only if the second L^2-Betti number vanishes."
  },
  {
    "date": "2026-02-04",
    "title": "On the density of rational lines on diagonal cubic hypersurfaces",
    "authors": "Kiseok Yeon",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.04654v1",
    "source": "arXiv",
    "abstract": "In this paper, we establish the asymptotic estimates for the rational lines on diagonal cubic hypersurfaces defined by $\\sum_{i=1}^sc_ix^3_i=0$ with $c_i\\in\\mathbb{Z}\\setminus \\{0\\},$ provided that $s\\geq 19.$ This improves the previously known bound $s\\geq 21$ required to obtain such asymptotic estimates. Our approach develops a multidimensional shifting variables argument together with a pruning argument, and exploits the recent progress on the Parsell-Vinogradov system."
  },
  {
    "date": "2026-02-04",
    "title": "The Most Dispersed Subset of Random Points in $\\mathbb{R}^d$",
    "authors": "Fabio Deelan Cunden, Noemi Cuppone, Giovanni Gramegna, Pierpaolo Vivo",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.04626v1",
    "source": "arXiv",
    "abstract": "Consider a population of $N$ individuals, each having $d\\geq 1$ different traits, and an additive measure, called dispersion, which rewards large pairwise separations between traits. The goal is to select $M\\leq N$ individuals such that their traits are as dispersed as possible. We compute analytically the full statistics (including large deviation tails) of the maximally achievable dispersion among sub-populations of size $M$ when the traits are independent and identically distributed. Two complementary approaches are developed, one based on a mean-field theory for order statistics, and the other on the replica method from the field of disordered systems. In all dimensions $d$, and for rotationally symmetric distributions, the optimal subset for large populations consists of all points lying outside a $d$-dimensional ball whose radius is determined self-consistently. For a single trait ($d=1$), the statistics of the maximal dispersion can be tackled for finite $N,M$ as well. The formulae we obtained are corroborated by numerical simulations on small instances and by heuristic algorithms that find near-optimal solutions."
  },
  {
    "date": "2026-02-04",
    "title": "A labeled dataset of simulated phlebotomy procedures for medical AI: polygon annotations for object detection and human-object interaction",
    "authors": "Raúl Jiménez Cruz, César Torres-Huitzil, Marco Franceschetti, Ronny Seiger, Luciano García-Bañuelos, Barbara Weber",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.04624v1",
    "source": "arXiv",
    "abstract": "This data article presents a dataset of 11,884 labeled images documenting a simulated blood extraction (phlebotomy) procedure performed on a training arm. Images were extracted from high-definition videos recorded under controlled conditions and curated to reduce redundancy using Structural Similarity Index Measure (SSIM) filtering. An automated face-anonymization step was applied to all videos prior to frame selection. Each image contains polygon annotations for five medically relevant classes: syringe, rubber band, disinfectant wipe, gloves, and training arm. The annotations were exported in a segmentation format compatible with modern object detection frameworks (e.g., YOLOv8), ensuring broad usability. This dataset is partitioned into training (70%), validation (15%), and test (15%) subsets and is designed to advance research in medical training automation and human-object interaction. It enables multiple applications, including phlebotomy tool detection, procedural step recognition, workflow analysis, conformance checking, and the development of educational systems that provide structured feedback to medical trainees. The data and accompanying label files are publicly available on Zenodo."
  },
  {
    "date": "2026-02-04",
    "title": "Total Variation Sparse Bayesian Learning for Block Sparsity via Majorization-Minimization",
    "authors": "Yanbin He, Geethu Joseph",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.04623v1",
    "source": "arXiv",
    "abstract": "Block sparsity is a widely exploited structure in sparse recovery, offering significant gains when signal blocks are known. Yet, practical signals often exhibit unknown block boundaries and isolated non-zero entries, which challenge traditional approaches. A promising method to handle such complex sparsity patterns is the difference-of-logs total variation (DoL-TV) regularized sparse Bayesian learning (SBL). However, due to the complex form of DoL-TV term, the resulting optimization problem is hard to solve. This paper develops a new optimization framework for the DoL-TV SBL cost function. By introducing an exponential reparameterization of the SBL hyperparameters, we reveal a novel structure that admits a majorization-minimization formulation and naturally extends to unknown noise variance estimation. Sparse recovery results on both synthetic data and extended source direction-of-arrival estimation demonstrate improved accuracy and runtime performance compared to benchmark methods."
  },
  {
    "date": "2026-02-04",
    "title": "Resilient Load Forecasting under Climate Change: Adaptive Conditional Neural Processes for Few-Shot Extreme Load Forecasting",
    "authors": "Chenxi Hu, Yue Ma, Yifan Wu, Yunhe Hou",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.04609v1",
    "source": "arXiv",
    "abstract": "Extreme weather can substantially change electricity consumption behavior, causing load curves to exhibit sharp spikes and pronounced volatility. If forecasts are inaccurate during those periods, power systems are more likely to face supply shortfalls or localized overloads, forcing emergency actions such as load shedding and increasing the risk of service disruptions and public-safety impacts. This problem is inherently difficult because extreme events can trigger abrupt regime shifts in load patterns, while relevant extreme samples are rare and irregular, making reliable learning and calibration challenging. We propose AdaCNP, a probabilistic forecasting model for data-scarce condition. AdaCNP learns similarity in a shared embedding space. For each target data, it evaluates how relevant each historical context segment is to the current condition and reweights the context information accordingly. This design highlights the most informative historical evidence even when extreme samples are rare. It enables few-shot adaptation to previously unseen extreme patterns. AdaCNP also produces predictive distributions for risk-aware decision-making without expensive fine-tuning on the target domain. We evaluate AdaCNP on real-world power-system load data and compare it against a range of representative baselines. The results show that AdaCNP is more robust during extreme periods, reducing the mean squared error by 22\\% relative to the strongest baseline while achieving the lowest negative log-likelihood, indicating more reliable probabilistic outputs. These findings suggest that AdaCNP can effectively mitigate the combined impact of abrupt distribution shifts and scarce extreme samples, providing a more trustworthy forecasting for resilient power system operation under extreme events."
  },
  {
    "date": "2026-02-04",
    "title": "RexBERT: Context Specialized Bidirectional Encoders for E-commerce",
    "authors": "Rahul Bajaj, Anuj Garg",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.04605v1",
    "source": "arXiv",
    "abstract": "Encoder-only transformers remain indispensable in retrieval, classification, and ranking systems where latency, stability, and cost are paramount. Most general purpose encoders, however, are trained on generic corpora with limited coverage of specialized domains. We introduce RexBERT, a family of BERT-style encoders designed specifically for e-commerce semantics. We make three contributions. First, we release Ecom-niverse, a 350 billion token corpus curated from diverse retail and shopping sources. We describe a modular pipeline that isolates and extracts e-commerce content from FineFineWeb and other open web resources, and characterize the resulting domain distribution. Second, we present a reproducible pretraining recipe building on ModernBERT's architectural advances. The recipe consists of three phases: general pre-training, context extension, and annealed domain specialization. Third, we train RexBERT models ranging from 17M to 400M parameters and evaluate them on token classification, semantic similarity, and general natural language understanding tasks using e-commerce datasets. Despite having 2-3x fewer parameters, RexBERT outperforms larger general-purpose encoders and matches or surpasses modern long-context models on domain-specific benchmarks. Our results demonstrate that high quality in-domain data combined with a principled training approach provides a stronger foundation for e-commerce applications than indiscriminate scaling alone."
  },
  {
    "date": "2026-02-04",
    "title": "AI in Education Beyond Learning Outcomes: Cognition, Agency, Emotion, and Ethics",
    "authors": "Lucile Favero, Juan Antonio Pérez-Ortiz, Tanja Käser, Nuria Oliver",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.04598v1",
    "source": "arXiv",
    "abstract": "Artificial intelligence (AI) is rapidly being integrated into educational contexts, promising personalized support and increased efficiency. However, growing evidence suggests that the uncritical adoption of AI may produce unintended harms that extend beyond individual learning outcomes to affect broader societal goals. This paper examines the societal implications of AI in education through an integrative framework with four interrelated dimensions: cognition, agency, emotional well-being, and ethics. Drawing on research from education, cognitive science, psychology, and ethics, we synthesize existing evidence to show how AI-driven cognitive offloading, diminished learner agency, emotional disengagement, and surveillance-oriented practices can mutually reinforce one another. We argue that these dynamics risk undermining critical thinking, intellectual autonomy, emotional resilience, and trust, capacities that are foundational both for effective learning and also for democratic participation and informed civic engagement. Moreover, AI's impact is contingent on design and governance: pedagogically aligned, ethically grounded, and human-centered AI systems can scaffold effortful reasoning, support learner agency, and preserve meaningful social interaction. By integrating fragmented strands of prior research into a unified framework, this paper advances the discourse on responsible AI in education and offers actionable implications for educators, designers, and institutions. Ultimately, the paper contends that the central challenge is not whether AI should be used in education, but how it can be designed and governed to support learning while safeguarding the social and civic purposes of education."
  },
  {
    "date": "2026-02-04",
    "title": "A principled framework for uncertainty decomposition in TabPFN",
    "authors": "Sandra Fortini, Kenyon Ng, Sonia Petrone, Judith Rousseau, Susan Wei",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.04596v1",
    "source": "arXiv",
    "abstract": "TabPFN is a transformer that achieves state-of-the-art performance on supervised tabular tasks by amortizing Bayesian prediction into a single forward pass. However, there is currently no method for uncertainty decomposition in TabPFN. Because it behaves, in an idealised limit, as a Bayesian in-context learner, we cast the decomposition challenge as a Bayesian predictive inference (BPI) problem. The main computational tool in BPI, predictive Monte Carlo, is challenging to apply here as it requires simulating unmodeled covariates. We therefore pursue the asymptotic alternative, filling a gap in the theory for supervised settings by proving a predictive CLT under quasi-martingale conditions. We derive variance estimators determined by the volatility of predictive updates along the context. The resulting credible bands are fast to compute, target epistemic uncertainty, and achieve near-nominal frequentist coverage. For classification, we further obtain an entropy-based uncertainty decomposition."
  },
  {
    "date": "2026-02-04",
    "title": "Nonreciprocal topological kink-wave propagation in mechanical metamaterials",
    "authors": "Brahim Lemkalli, Qingxiang Ji, Jingyi Zhang, Richard Craster, Johan Christensen, Muamer Kadic",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.04591v1",
    "source": "arXiv",
    "abstract": "Nonlinear mechanical metamaterials can exhibit emergent transport phenomena that mimic topological protection without relying on linear band topology. Here, we realize a bifurcation-induced nonreciprocal lattice that supports robust propagation of elastic kink waves. Each unit is a prestrained, hinged-beam circulator that develops angular momentum bias during snap-through transitions between buckling states, producing an effective breaking of time reversal symmetry. Coupling such units into a hexagonal array yields a mechanically chiral network where localized soliton-like excitations propagate unidirectionally along interfaces and edges, immune to sharp bends. We demonstrate non-dispersive kink transport governed by a SineGordon type field whose effective bias encodes mechanical chirality. This framework bridges bifurcation dynamics and nonreciprocal transport, establishing a nonlinear route toward topological like mechanical functionality without magnetic or gyroscopic bias."
  },
  {
    "date": "2026-02-04",
    "title": "Entanglement improves coordination in distributed systems",
    "authors": "Francisco Ferreira da Silva, Stephanie Wehner",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.04588v1",
    "source": "arXiv",
    "abstract": "Coordination in distributed systems is often hampered by communication latency, which degrades performance. Quantum entanglement offers fundamentally stronger correlations than classically achievable without communication. Crucially, these correlations manifest instantaneously upon measurement, irrespective of the physical distance separating the systems. We investigate the application of shared entanglement to a dual-work optimization problem in a distributed system comprising two servers. The system must process both a continuously available, preemptible baseline task and incoming customer requests arriving in pairs. System performance is characterized by the trade-off between baseline task throughput and customer waiting time. We present a rigorous analytical model demonstrating that when the baseline task throughput function is strictly convex, rewarding longer uninterrupted processing periods, entanglement-assisted routing strategies achieve Pareto-superior performance compared to optimal communication-free classical strategies. We prove this advantage through queueing-theoretic analysis, non-local game formulation, and computational certification of classical bounds. Our results identify distributed scheduling and coordination as a novel application domain for near-term entanglement-based quantum networks."
  },
  {
    "date": "2026-02-04",
    "title": "Real-time processing of analog signals on accelerated neuromorphic hardware",
    "authors": "Yannik Stradmann, Johannes Schemmel, Mihai A. Petrovici, Laura Kriener",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.04582v1",
    "source": "arXiv",
    "abstract": "Sensory processing with neuromorphic systems is typically done by using either event-based sensors or translating input signals to spikes before presenting them to the neuromorphic processor. Here, we offer an alternative approach: direct analog signal injection eliminates superfluous and power-intensive analog-to-digital and digital-to-analog conversions, making it particularly suitable for efficient near-sensor processing. We demonstrate this by using the accelerated BrainScaleS-2 mixed-signal neuromorphic research platform and interfacing it directly to microphones and a servo-motor-driven actuator. Utilizing BrainScaleS-2's 1000-fold acceleration factor, we employ a spiking neural network to transform interaural time differences into a spatial code and thereby predict the location of sound sources. Our primary contributions are the first demonstrations of direct, continuous-valued sensor data injection into the analog compute units of the BrainScaleS-2 ASIC, and actuator control using its embedded microprocessors. This enables a fully on-chip processing pipeline$\\unicode{x2014}$from sensory input handling, via spiking neural network processing to physical action. We showcase this by programming the system to localize and align a servo motor with the spatial direction of transient noise peaks in real-time."
  },
  {
    "date": "2026-02-04",
    "title": "AIANO: Enhancing Information Retrieval with AI-Augmented Annotation",
    "authors": "Sameh Khattab, Marie Bauer, Lukas Heine, Till Rostalski, Jens Kleesiek, Julian Friedrich",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.04579v1",
    "source": "arXiv",
    "abstract": "The rise of Large Language Models (LLMs) and Retrieval-Augmented Generation (RAG) has rapidly increased the need for high-quality, curated information retrieval datasets. These datasets, however, are currently created with off-the-shelf annotation tools that make the annotation process complex and inefficient. To streamline this process, we developed a specialized annotation tool - AIANO. By adopting an AI-augmented annotation workflow that tightly integrates human expertise with LLM assistance, AIANO enables annotators to leverage AI suggestions while retaining full control over annotation decisions. In a within-subject user study ($n = 15$), participants created question-answering datasets using both a baseline tool and AIANO. AIANO nearly doubled annotation speed compared to the baseline while being easier to use and improving retrieval accuracy. These results demonstrate that AIANO's AI-augmented approach accelerates and enhances dataset creation for information retrieval tasks, advancing annotation capabilities in retrieval-intensive domains."
  },
  {
    "date": "2026-02-04",
    "title": "Optical signatures of -1/3 fractional quantum anomalous Hall state in twisted MoTe2",
    "authors": "Haiyang Pan, Shunshun Yang, Yuzhu Wang, Xiangbin Cai, Wei Wang, Yan Zhao, Kenji Watanabe, Takashi Taniguchi, Linlong Zhang, Youwen Liu, Bo Yang, Weibo Gao",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.04561v1",
    "source": "arXiv",
    "abstract": "The discovery of fractional charge excitations in new platforms offers crucial insights into strongly correlated quantum phases. While a range of fractional quantum anomalous Hall (FQAH) states have recently been observed in two-dimensional twisted moire systems, the theoretically anticipated filling factor v = -1/3 FQAH state has remained elusive, with debates centering on its nature of charge density wave or a topological Chern insulator. Here, we report the optical detection of a v = -1/3 FQAH state in twisted MoTe2 bilayers. Using photoluminescence (PL) and reflective magnetic circular dichroism (RMCD) techniques, we identify ferromagnetic states at filling factors v = -1, -2/3, and -1/3, all tunable by a vertical electric field. The corresponding Curie temperatures are approximately 11 K, 3.5 K, and 2.4 K, respectively. The -1/3 state emerges over a narrower electric field range and a lower temperature compared to the integer and other fractional states, indicating its fragile nature that may lead to its absence in previous reports. Notably, the PL spectra at v = -1/3 disperse as the out-of-plane magnetic field increases, consistent with a nontrivial topological origin. Theoretical calculations based on the exact diagonalization method further support the interpretation of this topologically non-trivial state."
  },
  {
    "date": "2026-02-04",
    "title": "Fermi surface geometry and momentum dependent electron-phonon coupling drive the charge density wave in quasi-1D ZrTe$3$",
    "authors": "Josu Diego, Matteo Calandra",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.04534v1",
    "source": "arXiv",
    "abstract": "ZrTe$_3$ is a prototypical quasi-one-dimensional compound undergoing a charge density wave transition via a very sharp Kohn anomaly in phonon momentum space. While Fermi surface geometry has long been considered the primary driver of the instability, a full understanding of the lattice dynamics and electron-phonon role has remained elusive. Our first principles calculations in the high-symmetry phase show that the Fermi surface is correctly reproduced only when the Hubbard interaction on the Te $5p$ orbitals is included, which in turn is essential for the appearance of a soft harmonic phonon mode at the CDW wavevector. Analyzing the mode and momentum dependence of the electron-phonon coupling, we find that its variations with phonon momentum dominate over electronic effects. These results identify unambiguously the CDW origin in ZrTe$_3$ as a cooperative effect of Fermi surface geometry and momentum-dependent electron-phonon coupling, with the latter playing the leading role. The mechanisms revealed in our work are directly relevant to other quasi-1D systems, including trichalcogenides and compounds hosting Peierls-like chains."
  },
  {
    "date": "2026-02-04",
    "title": "Landscape-aware Automated Algorithm Design: An Efficient Framework for Real-world Optimization",
    "authors": "Haoran Yin, Shuaiqun Pan, Zhao Wei, Jian Cheng Wong, Yew-Soon Ong, Anna V. Kononova, Thomas Bäck, Niki van Stein",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.04529v1",
    "source": "arXiv",
    "abstract": "The advent of Large Language Models (LLMs) has opened new frontiers in automated algorithm design, giving rise to numerous powerful methods. However, these approaches retain critical limitations: they require extensive evaluation of the target problem to guide the search process, making them impractical for real-world optimization tasks, where each evaluation consumes substantial computational resources. This research proposes an innovative and efficient framework that decouples algorithm discovery from high-cost evaluation. Our core innovation lies in combining a Genetic Programming (GP) function generator with an LLM-driven evolutionary algorithm designer. The evolutionary direction of the GP-based function generator is guided by the similarity between the landscape characteristics of generated proxy functions and those of real-world problems, ensuring that algorithms discovered via proxy functions exhibit comparable performance on real-world problems. Our method enables deep exploration of the algorithmic space before final validation while avoiding costly real-world evaluations. We validated the framework's efficacy across multiple real-world problems, demonstrating its ability to discover high-performance algorithms while substantially reducing expensive evaluations. This approach shows a path to apply LLM-based automated algorithm design to computationally intensive real-world optimization challenges."
  },
  {
    "date": "2026-02-04",
    "title": "A simple means for deriving quantum mechanics",
    "authors": "Eric Tesse",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.04524v1",
    "source": "arXiv",
    "abstract": "A type of mechanics will be presented that possesses some distinctive properties. On the one hand, its physical description & rules of operation are readily comprehensible & intuitively clear. On the other, it fully satisfies all observable predictions of non-relativistic quantum mechanics. Within it, particles exist at points in space, follow continuous, piecewise differentiable paths, and their linear momentum is equal to their mass times their velocity along their path. Yet the probabilities for position and momentum, conditioned on the state of the particle's environment, follow the rules of quantum theory. Indeed, all observable consequences of quantum theory are satisfied; particles can be entangled, have intrinsic spin, this spin is not local to the particle, particle identity can effect probabilities, and so forth. All the rules of quantum mechanics are obeyed, and all arise in a straightforward fashion. After this is established, connections will be drawn out between this type of mechanics and other types of quantum worlds; those that obey Bohmian mechanics, stochastic mechanics, the many worlds interpretation, and physical collapse. In the final section, a relativistic version of the mechanics will be presented."
  },
  {
    "date": "2026-02-04",
    "title": "TACO: Temporal Consensus Optimization for Continual Neural Mapping",
    "authors": "Xunlan Zhou, Hongrui Zhao, Negar Mehr",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.04516v1",
    "source": "arXiv",
    "abstract": "Neural implicit mapping has emerged as a powerful paradigm for robotic navigation and scene understanding. However, real-world robotic deployment requires continual adaptation to changing environments under strict memory and computation constraints, which existing mapping systems fail to support. Most prior methods rely on replaying historical observations to preserve consistency and assume static scenes. As a result, they cannot adapt to continual learning in dynamic robotic settings. To address these challenges, we propose TACO (TemporAl Consensus Optimization), a replay-free framework for continual neural mapping. We reformulate mapping as a temporal consensus optimization problem, where we treat past model snapshots as temporal neighbors. Intuitively, our approach resembles a model consulting its own past knowledge. We update the current map by enforcing weighted consensus with historical representations. Our method allows reliable past geometry to constrain optimization while permitting unreliable or outdated regions to be revised in response to new observations. TACO achieves a balance between memory efficiency and adaptability without storing or replaying previous data. Through extensive simulated and real-world experiments, we show that TACO robustly adapts to scene changes, and consistently outperforms other continual learning baselines."
  },
  {
    "date": "2026-02-04",
    "title": "BrainVista: Modeling Naturalistic Brain Dynamics as Multimodal Next-Token Prediction",
    "authors": "Xuanhua Yin, Runkai Zhao, Lina Yao, Weidong Cai",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.04512v1",
    "source": "arXiv",
    "abstract": "Naturalistic fMRI characterizes the brain as a dynamic predictive engine driven by continuous sensory streams. However, modeling the causal forward evolution in realistic neural simulation is impeded by the timescale mismatch between multimodal inputs and the complex topology of cortical networks. To address these challenges, we introduce BrainVista, a multimodal autoregressive framework designed to model the causal evolution of brain states. BrainVista incorporates Network-wise Tokenizers to disentangle system-specific dynamics and a Spatial Mixer Head that captures inter-network information flow without compromising functional boundaries. Furthermore, we propose a novel Stimulus-to-Brain (S2B) masking mechanism to synchronize high-frequency sensory stimuli with hemodynamically filtered signals, enabling strict, history-only causal conditioning. We validate our framework on Algonauts 2025, CineBrain, and HAD, achieving state-of-the-art fMRI encoding performance. In long-horizon rollout settings, our model yields substantial improvements over baselines, increasing pattern correlation by 36.0\\% and 33.3\\% on relative to the strongest baseline Algonauts 2025 and CineBrain, respectively."
  },
  {
    "date": "2026-02-04",
    "title": "Searches for Extra Higgs Bosons using $t\\bar{t}+$Higgs{$(\\to b\\bar b)$} Events within 2HDMs: Direct versus Indirect Probes",
    "authors": "Esteban Chalbaud, Stefania De Curtis, Luigi Delle Rose, Atri Dey, Stefano Moretti, Antonio Onofre",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.04511v1",
    "source": "arXiv",
    "abstract": "We study the possibility of establishing the production of additional Higgs states in the process $gg,q\\bar q\\to t\\bar t Φ$, where $Φ$ = $H_{2,3}$, with $H_2$ being CP-even and $H_3$ being CP-odd, at the Large Hadron Collider (LHC), by solely exploiting the kinematic features of the reconstructed $t\\bar t$ system. We adopt as reference theoretical framework a generic CP-Conserving 2-Higgs Doublet Model (2HDM), which also accommodate a Standard Model (SM)-like Higgs state $H_1$. We show that the masses $m_{H_{2,3}}$ exhibit clear correlations with the $t\\bar{t}$ system properties and could, in principle, be extracted from these. Moreover, the CP properties of the $H_{2,3}$ states can be determined, even when both states are produced simultaneously. We then compare the results produced using this method with those obtained from a full kinematic reconstruction of the $H_{2,3}$ decays in the most studied $b\\bar b$ channel (we take $m_{H_{2,3}}< 2m_t$), thus proving the superiority of the approach here proposed. This paves the way to both the discovery and characterization of additional Higgs states produced {\\sl inclusively} in association with top-antitop quark pairs, thereby dispensing of the complications intrinsic to the {\\sl exclusive} reconstruction of such states from their decay products. We test this by establishing the sensitivity of our approach in the case of a Composite 2HDM (C2HDM), describing the Higges as pseudo-Nambu Goldstone Bosons (pNGBs) and naturally predicting Higgs mass spectra in the range of sensitivity of the described analysis."
  },
  {
    "date": "2026-02-04",
    "title": "Fine-grained Classification of A Million Life Trajectories from Wikipedia",
    "authors": "Zhaoyang Liu, Xiaocong Du, Yixi Zhou, Ye Shi, Haipeng Zhang",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.04503v1",
    "source": "arXiv",
    "abstract": "Life trajectories of notable people convey essential messages for human dynamics research. These trajectories consist of (\\textit{person, time, location, activity type}) tuples recording when and where a person was born, went to school, started a job, or fought in a war. However, current studies only cover limited activity types such as births and deaths, lacking large-scale fine-grained trajectories. Using a tool that extracts (\\textit{person, time, location}) triples from Wikipedia, we formulate the problem of classifying these triples into 24 carefully-defined types using textual context as complementary information. The challenge is that triple entities are often scattered in noisy contexts. We use syntactic graphs to bring triple entities and relevant information closer, fusing them with text embeddings to classify life trajectory activities. Since Wikipedia text quality varies, we use LLMs to refine the text for more standardized syntactic graphs. Our framework achieves 84.5\\% accuracy, surpassing baselines. We construct the largest fine-grained life trajectory dataset with 3.8 million labeled activities for 589,193 individuals spanning 3 centuries. In the end, we showcase how these trajectories can support grand narratives of human dynamics across time and space. Code/data are publicly available."
  },
  {
    "date": "2026-02-04",
    "title": "Nef Cones of the Hilbert Schemes of Points on Generalized Cayley K3 Surfaces",
    "authors": "Chiwon Yoon",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.04499v1",
    "source": "arXiv",
    "abstract": "We study the nef cones and fundamental domains of Hilbert schemes of points on the Cayley K3 surface $S$ and its generalizations $S_a$. For the Hilbert square $S^{[2]}$, we explicitly compute the nef cone and describe a fundamental domain using the automorphisms of $S^{[2]}$ and lattice-theoretic methods. For higher Hilbert schemes $S_a^{[n]}$, we determine the nef cones using Bridgeland stability methods that identify the contracted curves defining walls and the divisors generating the extremal rays."
  },
  {
    "date": "2026-02-04",
    "title": "A model-independent measurement of the Hubble constant from gravitational-wave standard sirens and electromagnetic observations",
    "authors": "Gaurav N. Gadbail, Kazuharu Bamba",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.04497v1",
    "source": "arXiv",
    "abstract": "The Hubble tension is one of the most significant challenges in modern cosmology. Developing new approaches to estimate the Hubble constant is therefore crucial, and in this work, we employ a Gaussian process, a fully model-independent method that relies solely on observational data. To determine the Hubble constant, we use not only electromagnetic observations but also include gravitational-wave standard siren data from GWTC3. Our measurements of the Hubble constant are strongly consistent with the SH0ES result, with tensions less than $2σ$, indicating no statistically significant discrepancy. This approach quantifies the impact of gravitational-wave data on the determination of the Hubble constant, examines its consistency with electromagnetic measurements, and explores its potential role in addressing the Hubble tension."
  },
  {
    "date": "2026-02-04",
    "title": "Randomized Projection Operators onto Piecewise Polynomial Spaces",
    "authors": "Johannes Storn",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.04490v1",
    "source": "arXiv",
    "abstract": "We introduce computable projection operators onto piecewise polynomial spaces, defined via sampling and discrete least-squares polynomial approximations. The resulting mappings exhibit (almost) optimal approximation properties in $L^2$ and $H^{-1}$. As smoothers for incomplete or rough data, they yield computable finite element discretizations with optimal convergence rates."
  },
  {
    "date": "2026-02-04",
    "title": "Deconstructing sentence disambiguation by joint latent modeling of reading paradigms: LLM surprisal is not enough",
    "authors": "Dario Paape, Tal Linzen, Shravan Vasishth",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.04489v1",
    "source": "arXiv",
    "abstract": "Using temporarily ambiguous garden-path sentences (\"While the team trained the striker wondered ...\") as a test case, we present a latent-process mixture model of human reading behavior across four different reading paradigms (eye tracking, uni- and bidirectional self-paced reading, Maze). The model distinguishes between garden-path probability, garden-path cost, and reanalysis cost, and yields more realistic processing cost estimates by taking into account trials with inattentive reading. We show that the model is able to reproduce empirical patterns with regard to rereading behavior, comprehension question responses, and grammaticality judgments. Cross-validation reveals that the mixture model also has better predictive fit to human reading patterns and end-of-trial task data than a mixture-free model based on GPT-2-derived surprisal values. We discuss implications for future work."
  },
  {
    "date": "2026-02-04",
    "title": "Proactive Agents, Long-term User Context, VLM Annotation, Privacy Protection, Human-Computer Interaction",
    "authors": "Yuanbo Tang, Huaze Tang, Tingyu Cao, Lam Nguyen, Anping Zhang, Xinwen Cao, Chunkang Liu, Wenbo Ding, Yang Li",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.04482v1",
    "source": "arXiv",
    "abstract": "Proactive agents that anticipate user intentions without explicit prompts represent a significant evolution in human-AI interaction, promising to reduce cognitive load and streamline workflows. However, existing datasets suffer from two critical deficiencies: (1) reliance on LLM-synthesized data that fails to capture authentic human decision-making patterns, and (2) focus on isolated tasks rather than continuous workflows, missing the pre-assistance behavioral context essential for learning proactive intervention signals. To address these gaps, we introduce ProAgentBench, a rigorous benchmark for proactive agents in working scenarios. Our contributions include: (1) a hierarchical task framework that decomposes proactive assistance into timing prediction and assist content generation; (2) a privacy-compliant dataset with 28,000+ events from 500+ hours of real user sessions, preserving bursty interaction patterns (burstiness B=0.787) absent in synthetic data; and (3) extensive experiments that evaluates LLM- and VLM-based baselines. Numerically, we showed that long-term memory and historical context significantly enhance prediction accuracy, while real-world training data substantially outperforms synthetic alternatives. We release our dataset and code at https://anonymous.4open.science/r/ProAgentBench-6BC0."
  },
  {
    "date": "2026-02-04",
    "title": "Vision-aligned Latent Reasoning for Multi-modal Large Language Model",
    "authors": "Byungwoo Jeon, Yoonwoo Jeong, Hyunseok Lee, Minsu Cho, Jinwoo Shin",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.04476v1",
    "source": "arXiv",
    "abstract": "Despite recent advancements in Multi-modal Large Language Models (MLLMs) on diverse understanding tasks, these models struggle to solve problems which require extensive multi-step reasoning. This is primarily due to the progressive dilution of visual information during long-context generation, which hinders their ability to fully exploit test-time scaling. To address this issue, we introduce Vision-aligned Latent Reasoning (VaLR), a simple, yet effective reasoning framework that dynamically generates vision-aligned latent tokens before each Chain of Thought reasoning step, guiding the model to reason based on perceptual cues in the latent space. Specifically, VaLR is trained to preserve visual knowledge during reasoning by aligning intermediate embeddings of MLLM with those from vision encoders. Empirical results demonstrate that VaLR consistently outperforms existing approaches across a wide range of benchmarks requiring long-context understanding or precise visual perception, while exhibiting test-time scaling behavior not observed in prior MLLMs. In particular, VaLR improves the performance significantly from 33.0% to 52.9% on VSI-Bench, achieving a 19.9%p gain over Qwen2.5-VL."
  },
  {
    "date": "2026-02-04",
    "title": "Is Micro Domain-Adaptive Pre-Training Effective for Real-World Operations? Multi-Step Evaluation Reveals Potential and Bottlenecks",
    "authors": "Masaya Tsunokake, Yuta Koreeda, Terufumi Morishita, Koichi Nagatsuka, Hikaru Tomonari, Yasuhiro Sogawa",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.04466v1",
    "source": "arXiv",
    "abstract": "When applying LLMs to real-world enterprise operations, LLMs need to handle proprietary knowledge in small domains of specific operations ($\\textbf{micro domains}$). A previous study shows micro domain-adaptive pre-training ($\\textbf{mDAPT}$) with fewer documents is effective, similarly to DAPT in larger domains. However, it evaluates mDAPT only on multiple-choice questions; thus, its effectiveness for generative tasks in real-world operations remains unknown. We aim to reveal the potential and bottlenecks of mDAPT for generative tasks. To this end, we disentangle the answering process into three subtasks and evaluate the performance of each subtask: (1) $\\textbf{eliciting}$ facts relevant to questions from an LLM's own knowledge, (2) $\\textbf{reasoning}$ over the facts to obtain conclusions, and (3) $\\textbf{composing}$ long-form answers based on the conclusions. We verified mDAPT on proprietary IT product knowledge for real-world questions in IT technical support operations. As a result, mDAPT resolved the elicitation task that the base model struggled with but did not resolve other subtasks. This clarifies mDAPT's effectiveness in the knowledge aspect and its bottlenecks in other aspects. Further analysis empirically shows that resolving the elicitation and reasoning tasks ensures sufficient performance (over 90%), emphasizing the need to enhance reasoning capability."
  },
  {
    "date": "2026-02-04",
    "title": "Simple 2-approximations for bad triangle transversals and some hardness results for related problems",
    "authors": "Florian Adriaens, Nikolaj tatti",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.04463v1",
    "source": "arXiv",
    "abstract": "Given a signed graph, the bad triangle transversal (BTT) problem asks to find the smallest number of edges that need to be removed such that the remaining graph does not have a triangle with exactly one negative edge (a bad triangle). We propose novel 2-approximations for this problem, which are much simpler and faster than a folklore adaptation of the 2-approximation by Krivelevich for finding a minimum triangle transversal in unsigned graphs. One of our algorithms also works for weighted BTT and for approximately optimal feasible solutions to the bad triangle cover LP. Using a recent result on approximating the bad triangle cover LP, we obtain a $(2+ε)$ approximation in time almost equal to the time needed to find a maximal set of edge-disjoint bad triangles (which would give a standard 3-approximation). Additionally, several inapproximability results are provided. For complete signed graphs, we show that BTT is NP-hard to approximate with factor better than $\\frac{2137}{2136}$. Our reduction also implies the same hardness result for related problems such as correlation clustering (cluster editing), cluster deletion and the min. strong triadic closure problem. On complete signed graphs, BTT is closely related to correlation clustering. We show that the correlation clustering optimum is at most $3/2$ times the BTT optimum, by describing a pivot procedure that transforms BTT solutions into clusters. This improves a result by Veldt, which states that their ratio is at most two."
  },
  {
    "date": "2026-02-04",
    "title": "A frequency-domain method to inverse moving source problem with unknown radiating moment",
    "authors": "Guanqiu Ma, Hongxia Guo, Guanghui Hu",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.04207v1",
    "source": "arXiv",
    "abstract": "This paper introduces a multi-frequency factorization method for imaging a time-dependent source, specifically to recover its spatial support and the associated excitation instants. Using far-field data from two opposite directions, we establish a computational criterion that characterizes both the unknown pulse moments and the narrowest strip (perpendicular to the direction) enclosing the source support. Central to our inversion scheme is the construction of indicator functions, defined pointwise over the spatial and temporal sampling variables. The proposed inversion scheme permits the recovery of the $Θ$-convex support domain from far-field data at sparse observation directions. Uniqueness in determining the convex hull of the support and the excitation instants-using all observation directions-is also established as a direct consequence of the factorization method. The effectiveness and feasibility of the approach are examined through comprehensive numerical simulations in two and three dimensions."
  },
  {
    "date": "2026-02-04",
    "title": "LORE: Jointly Learning the Intrinsic Dimensionality and Relative Similarity Structure From Ordinal Data",
    "authors": "Vivek Anand, Alec Helbling, Mark Davenport, Gordon Berman, Sankar Alagapan, Christopher Rozell",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.04192v1",
    "source": "arXiv",
    "abstract": "Learning the intrinsic dimensionality of subjective perceptual spaces such as taste, smell, or aesthetics from ordinal data is a challenging problem. We introduce LORE (Low Rank Ordinal Embedding), a scalable framework that jointly learns both the intrinsic dimensionality and an ordinal embedding from noisy triplet comparisons of the form, \"Is A more similar to B than C?\". Unlike existing methods that require the embedding dimension to be set apriori, LORE regularizes the solution using the nonconvex Schatten-$p$ quasi norm, enabling automatic joint recovery of both the ordinal embedding and its dimensionality. We optimize this joint objective via an iteratively reweighted algorithm and establish convergence guarantees. Extensive experiments on synthetic datasets, simulated perceptual spaces, and real world crowdsourced ordinal judgements show that LORE learns compact, interpretable and highly accurate low dimensional embeddings that recover the latent geometry of subjective percepts. By simultaneously inferring both the intrinsic dimensionality and ordinal embeddings, LORE enables more interpretable and data efficient perceptual modeling in psychophysics and opens new directions for scalable discovery of low dimensional structure from ordinal data in machine learning."
  },
  {
    "date": "2026-02-04",
    "title": "GASV: A New VLBI analysis software for Geodesy and Astrometry",
    "authors": "Dang Yao, Yuan-wei Wu, Xu-hai Yang",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.04183v1",
    "source": "arXiv",
    "abstract": "We present GASV, a novel Python-based software package specifically designed for the analysis of Very Long Baseline Interferometry (VLBI) data. Developed with ease of installation and user friendliness in mind, GASV supports both pipeline and interactive processing modes. The software processes VLBI baseline delays and rates in standard formats such as HOPS outputs and NGS card files to estimate key geodetic and astrometric parameters, including station coordinates, Earth Orientation Parameters, source coordinates, clock parameters, and atmospheric models. We evaluate the capabilities and performance of GASV, demonstrating that its parameter estimation accuracy for IVS INT, Regular, and CONT sessions is comparable to that achieved by the VLBI analysis centers at BKG and USNO. As a state-of-the-art tool, GASV not only enables high-quality single-session data processing but also but also supports global analyses of long-term SINEX files, generating Celestial Reference Frame and Terrestrial Reference Frame solutions with reliable accuracy."
  },
  {
    "date": "2026-02-04",
    "title": "Spatial Angular Pseudo-Derivative Searching: A Single Snapshot Super-resolution Sparse DOA Scheme with Potential for Practical Application",
    "authors": "Longxin Bai, Jingchao Zhang, Liyan Qiao",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.04169v1",
    "source": "arXiv",
    "abstract": "Accurate, high-resolution, and real-time DOA estimation is a cornerstone of environmental perception in automotive radar systems. While sparse signal recovery techniques offer super-resolution and high-precision estimation, their prohibitive computational complexity remains a primary bottleneck for practical deployment. This paper proposes a sparse DOA estimation scheme specifically tailored for the stringent requirements of automotive radar such as limited computational resources, restricted array apertures, and a single snapshot. By introducing the concept of the spatial angular pseudo-derivative and incorporating this property as a constraint into a standard L0-norm minimization problem, we formulate an objective function that more faithfully characterizes the physical properties of the DOA problem. The associated solver, designated as the SAPD search algorithm, naturally transforms the high-dimensional optimization task into an efficient grid-search scheme. The SAPD algorithm circumvents high-order matrix inversions and computationally intensive iterations. We provide an analysis of the computational complexity and convergence properties of the proposed algorithm. Extensive numerical simulations demonstrate that the SAPD method achieves a superior balance of real-time efficiency, high precision, and super-resolution, making it highly suitable for next-generation automotive radar applications."
  },
  {
    "date": "2026-02-04",
    "title": "Improving 2D Diffusion Models for 3D Medical Imaging with Inter-Slice Consistent Stochasticity",
    "authors": "Chenhe Du, Qing Wu, Xuanyu Tian, Jingyi Yu, Hongjiang Wei, Yuyao Zhang",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.04162v1",
    "source": "arXiv",
    "abstract": "3D medical imaging is in high demand and essential for clinical diagnosis and scientific research. Currently, diffusion models (DMs) have become an effective tool for medical imaging reconstruction thanks to their ability to learn rich, high-quality data priors. However, learning the 3D data distribution with DMs in medical imaging is challenging, not only due to the difficulties in data collection but also because of the significant computational burden during model training. A common compromise is to train the DMs on 2D data priors and reconstruct stacked 2D slices to address 3D medical inverse problems. However, the intrinsic randomness of diffusion sampling causes severe inter-slice discontinuities of reconstructed 3D volumes. Existing methods often enforce continuity regularizations along the z-axis, which introduces sensitive hyper-parameters and may lead to over-smoothing results. In this work, we revisit the origin of stochasticity in diffusion sampling and introduce Inter-Slice Consistent Stochasticity (ISCS), a simple yet effective strategy that encourages interslice consistency during diffusion sampling. Our key idea is to control the consistency of stochastic noise components during diffusion sampling, thereby aligning their sampling trajectories without adding any new loss terms or optimization steps. Importantly, the proposed ISCS is plug-and-play and can be dropped into any 2D trained diffusion based 3D reconstruction pipeline without additional computational cost. Experiments on several medical imaging problems show that our method can effectively improve the performance of medical 3D imaging problems based on 2D diffusion models. Our findings suggest that controlling inter-slice stochasticity is a principled and practically attractive route toward high-fidelity 3D medical imaging with 2D diffusion priors. The code is available at: https://github.com/duchenhe/ISCS"
  },
  {
    "date": "2026-02-04",
    "title": "A brief review of evolutionary game dynamics in the reinforcement learning paradigm",
    "authors": "Guozhong Zheng, Xin Ou, Shengfeng Deng, Jiqiang Zhang, Li Chen",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.04150v1",
    "source": "arXiv",
    "abstract": "Cooperation, fairness, trust, and resource coordination are cornerstones of modern civilization, yet their emergence remains inadequately explained by the persistent discrepancies between theoretical predictions and behavioral experiments. Part of this gap may arise from the imitation learning paradigm commonly used in prior theoretical models, which assumes individuals merely copy successful neighbors according to predetermined, fixed rules. This review examines recent advances in evolutionary game dynamics that employ reinforcement learning (RL) as an alternative paradigm. In RL, individuals learn through trial and error and introspectively refine their strategies based on environmental feedback. We begin by introducing key concepts in evolutionary game theory and the two learning paradigms, then synthesize progress in applying RL to elucidate cooperation, trust, fairness, optimal resource coordination, and ecological dynamics. Collectively, these studies indicate that RL offers a promising unified framework for understanding the diverse social and ecological phenomena observed in human and natural systems."
  },
  {
    "date": "2026-02-04",
    "title": "Bayes, E-values and Testing",
    "authors": "Nick Polson, Vadim Sokolov, Daniel Zantedeschi",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.04146v1",
    "source": "arXiv",
    "abstract": "This paper studies relationships between Kolmogorov complexity, Shannon entropy, Bayes factors, E-values, and exchangeability testing. The focus is on negative log marginal or predictive probabilities -- what I.J.~Good termed the ``weight of evidence'' -- as a common evidence statistic linking coding, prediction, and sequential testing. The paper reviews the relevant information-theoretic and martingale tools, and discusses exchangeability testing via conformal e-prediction."
  },
  {
    "date": "2026-02-04",
    "title": "Dynamics of string breaking and revival in a Rydberg atomic chain",
    "authors": "Xin Liu, Han-Chao Chen, Zheng-Yuan Zhang",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.04141v1",
    "source": "arXiv",
    "abstract": "String breaking is one of the most representative nonperturbative dynamics processes in confinement theory, typically associated with the creation of particle-antiparticle pairs. In this paper, we take a one-dimensional Rydberg atomic chain to theoretically study the dynamical of finite-length string state. Under different string tension conditions, we find that the string dynamics exhibits two clearly distinguishable evolution characteristics: one is that the string breaks and the system enters a superposition state space containing multiple meson state configurations; the other is localized string dynamics, in which the string undergoes local breaking but can then recombine and return to a state close to the initial structure, with the breaking and recombination processes recurring over a long time scale. Through the analysis of the evolution of different meson state configurations, we visually depict the redistribution of configuration weights during the string breaking process, and reveal the observable recovery characteristics of the string after breaking. Further analysis shows that the enhancement of quantum fluctuations can increase the weight of the double-meson state configurations in the system wave function without changing the dominant dynamical behavior. The above results present a rich picture of string breaking dynamics in a one-dimensional Rydberg atomic chain and provide insights for studying confinement physics and related gauge field theory phenomena on quantum simulation platforms."
  },
  {
    "date": "2026-02-04",
    "title": "Three vignettes on hypergeometric normal functions",
    "authors": "Matt Kerr",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.04128v1",
    "source": "arXiv",
    "abstract": "We use Hodge-theoretic methods to (i) explain number-theoretic identities of a type recently considered by Guillera and Zudilin, (ii) describe the Frobenius dual of Abel-Jacobi period functions, and (iii) offer a new proof of Golyshev's conjecture on algebraic hypergeometrics aided by an argument in the spirit of Lefschetz's (1,1) theorem."
  },
  {
    "date": "2026-02-04",
    "title": "Toward Effective Multimodal Graph Foundation Model: A Divide-and-Conquer Based Approach",
    "authors": "Sicheng Liu, Xunkai Li, Daohan Su, Ru Zhang, Hongchao Qin, Ronghua Li, Guoren Wang",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.04116v1",
    "source": "arXiv",
    "abstract": "Graph Foundation Models (GFMs) have achieved remarkable success in generalizing across diverse domains. However, they mainly focus on Text-Attributed Graphs (TAGs), leaving Multimodal-Attributed Graphs (MAGs) largely untapped. Developing Multimodal Graph Foundation Models (MGFMs) allows for leveraging the rich multimodal information in MAGs, and extends applicability to broader types of downstream tasks. While recent MGFMs integrate diverse modality information, our empirical investigation reveals two fundamental limitations of existing MGFMs: (1)they fail to explicitly model modality interaction, essential for capturing intricate cross-modal semantics beyond simple aggregation, and (2)they exhibit sub-optimal modality alignment, which is critical for bridging the significant semantic disparity between distinct modal spaces. To address these challenges, we propose PLANET (graPh topoLogy-aware modAlity iNteraction and alignmEnT), a novel framework employing a Divide-and-Conquer strategy to decouple modality interaction and alignment across distinct granularities. At the embedding granularity, (1)Embedding-wise Domain Gating (EDG) performs local semantic enrichment by adaptively infusing topology-aware cross-modal context, achieving modality interaction. At the node granularity, (2)Node-wise Discretization Retrieval (NDR) ensures global modality alignment by constructing a Discretized Semantic Representation Space (DSRS) to bridge modality gaps. Extensive experiments demonstrate that PLANET significantly outperforms state-of-the-art baselines across diverse graph-centric and multimodal generative tasks."
  },
  {
    "date": "2026-02-04",
    "title": "Robustness of Stable Matchings When Attributes and Salience Determine Preferences",
    "authors": "Amit Ronen, S. S. Ravi, Sarit Kraus",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.04115v1",
    "source": "arXiv",
    "abstract": "In many matching markets--such as athlete recruitment or academic admissions--participants on one side are evaluated by attribute vectors known to the other side, which in turn applies individual \\emph{salience vectors} to assign relative importance to these attributes. Since saliences are known to change in practice, a central question arises: how robust is a stable matching to such perturbations? We address several fundamental questions in this context. First, we formalize robustness as a radius within which a stable matching remains immune to blocking pairs under any admissible perturbation of salience vectors (which are assumed to be normalized). Given a stable matching and a radius, we present a polynomial-time algorithm to verify whether the matching is stable within the specified radius. We also give a polynomial-time algorithm for computing the maximum robustness radius of a given stable matching. Further, we design an anytime search algorithm that uses certified lower and upper bounds to approximate the most robust stable matching, and we characterize the robustness-cost relationship through efficiently computable bounds that delineate the achievable tradeoff between robustness and cost. Finally, we show that for each stable matching, the set of salience profiles that preserve its stability factors is a product of low-dimensional polytopes within the simplex. This geometric structure precisely characterizes the polyhedral shape of each robustness region; its volume can then be computed efficiently, with approximate methods available as the dimension grows, thereby linking robustness analysis in matching markets with classical tools from convex geometry."
  },
  {
    "date": "2026-02-04",
    "title": "Turning mechanistic models into forecasters by using machine learning",
    "authors": "Amit K. Chakraborty, Hao Wang, Pouria Ramazi",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.04114v1",
    "source": "arXiv",
    "abstract": "The equations of complex dynamical systems may not be identified by expert knowledge, especially if the underlying mechanisms are unknown. Data-driven discovery methods address this challenge by inferring governing equations from time-series data using a library of functions constructed from the measured variables. However, these methods typically assume time-invariant coefficients, which limits their ability to capture evolving system dynamics. To overcome this limitation, we allow some of the parameters to vary over time, learn their temporal evolution directly from data, and infer a system of equations that incorporates both constant and time-varying parameters. We then transform this framework into a forecasting model by predicting the time-varying parameters and substituting these predictions into the learned equations. The model is validated using datasets for Susceptible-Infected-Recovered, Consumer--Resource, greenhouse gas concentration, and Cyanobacteria cell count. By dynamically adapting to temporal shifts, our proposed model achieved a mean absolute error below 3\\% for learning a time series and below 6\\% for forecasting up to a month ahead. We additionally compare forecasting performance against CNN-LSTM and Gradient Boosting Machine (GBM), and show that our model outperforms these methods across most datasets. Our findings demonstrate that integrating time-varying parameters into data-driven discovery of differential equations improves both modeling accuracy and forecasting performance."
  },
  {
    "date": "2026-02-04",
    "title": "ZKBoost: Zero-Knowledge Verifiable Training for XGBoost",
    "authors": "Nikolas Melissaris, Jiayi Xu, Antigoni Polychroniadou, Akira Takahashi, Chenkai Weng",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.04113v1",
    "source": "arXiv",
    "abstract": "Gradient boosted decision trees, particularly XGBoost, are among the most effective methods for tabular data. As deployment in sensitive settings increases, cryptographic guarantees of model integrity become essential. We present ZKBoost, the first zero-knowledge proof of training (zkPoT) protocol for XGBoost, enabling model owners to prove correct training on a committed dataset without revealing data or parameters. We make three key contributions: (1) a fixed-point XGBoost implementation compatible with arithmetic circuits, enabling instantiation of efficient zkPoT, (2) a generic template of zkPoT for XGBoost, which can be instantiated with any general-purpose ZKP backend, and (3) vector oblivious linear evaluation (VOLE)-based instantiation resolving challenges in proving nonlinear fixed-point operations. Our fixed-point implementation matches standard XGBoost accuracy within 1\\% while enabling practical zkPoT on real-world datasets."
  },
  {
    "date": "2026-2-4",
    "title": "Proceedings of the 2025 International Conference on Artificial Intelligence and Sustainable Development",
    "authors": "N/A",
    "publish": "N/A",
    "url": "https://doi.org/10.1145/3786484",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-4",
    "title": "Towards Knowledge-Guided Multimodal Agents for Interpretable Plant Health Diagnostics",
    "authors": "Chengcheng Cai, Xudong Xia, Yonglin Tan, Yuhe Wu, Jie Xiang, Lingcui Sun, Mengjun Wang, Shiyu Zhu",
    "publish": "Proceedings of the 2025 International Conference on Artificial Intelligence and Sustainable Development",
    "url": "https://doi.org/10.1145/3786484.3786486",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-4",
    "title": "The perception of teachers' acceptance of AI technology towards school reform policies: a machine learning explanation based on TALIS",
    "authors": "Zonghe Wang, Qiang Wan, Zongzhe Wang, Hengpeng Xiang",
    "publish": "Proceedings of the 2025 International Conference on Artificial Intelligence and Sustainable Development",
    "url": "https://doi.org/10.1145/3786484.3786534",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-4",
    "title": "Evolutionary Game Theory and Simulation Analysis of Collaborative Governance of Rural Water Environment",
    "authors": "Ruizhe Ning",
    "publish": "Proceedings of the 2025 International Conference on Artificial Intelligence and Sustainable Development",
    "url": "https://doi.org/10.1145/3786484.3786502",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-4",
    "title": "Under-sampling framework incorporating denoising, optimized fuzzy C-means clustering, and representative sample selection for imbalanced data classification",
    "authors": "Min Li, Weihu Zhu, Kaixin Cheng",
    "publish": "Proceedings of the 2025 International Conference on Artificial Intelligence and Sustainable Development",
    "url": "https://doi.org/10.1145/3786484.3786547",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-4",
    "title": "Actionable Framework for Understanding and Improving Social and Human Factors that Influence the Requirements Management in Software Ecosystems",
    "authors": "Rodrigo Feitosa, Paulo Malcher, Cassiano Medeiros Vieira Junior, Pablo Oliveira Antonino, Rodrigo Pereira Dos Santos",
    "publish": "ACM Transactions on Software Engineering and Methodology",
    "url": "https://doi.org/10.1145/3795773",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-4",
    "title": "Toward Efficient Quantum Circuit Simulation with Memory and I/O Reduction through Gate Block Search Algorithm",
    "authors": "Chuan-Chi Wang, Chia-Heng Tu, Shih-Hao Hung",
    "publish": "Proceedings of the International Conference on Research in Adaptive and Convergent Systems",
    "url": "https://doi.org/10.1145/3769002.3769982",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-4",
    "title": "Constructing a Companion Animal Disease Knowledge Graph by Utilizing LLMs in Data Preprocessing and Pseudo Annotation",
    "authors": "Thien Thi Thu Nguyen, Eun-Soon You, Hyun Woo Kim, Van Thuy Hoang, Luong Vuong Nguyen, O-Joun Lee",
    "publish": "Proceedings of the International Conference on Research in Adaptive and Convergent Systems",
    "url": "https://doi.org/10.1145/3769002.3769990",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-4",
    "title": "Operational Icing Forecast for Power Grids Based on WRF-ICE and Machine Learning Correction",
    "authors": "Yujie Li, Yang Yang, Meng Li, Mingguan Zhao, Xiaojing Yang",
    "publish": "Proceedings of the 2025 International Conference on Artificial Intelligence and Sustainable Development",
    "url": "https://doi.org/10.1145/3786484.3786505",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-4",
    "title": "Proceedings of the 2025 10th International Conference on Cloud Computing and Internet of Things",
    "authors": "N/A",
    "publish": "N/A",
    "url": "https://doi.org/10.1145/3785520",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-4",
    "title": "A Privacy-Preserving Edge-AI Framework for EEG-based Emotion Recognition using Lightweight Authenticated Encryption over BLE",
    "authors": "Xuan-Bach Nguyen-Duy, Anh-Vu Dinh-Duc",
    "publish": "Proceedings of the 2025 10th International Conference on Cloud Computing and Internet of Things",
    "url": "https://doi.org/10.1145/3785520.3785521",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-4",
    "title": "Smart Solutions: IoT and Robotics to Enhance Delivery Service Efficiency",
    "authors": "Hieu V Dang, Anh V H Nguyen, Lap T Nguyen, Khanh C Nguyen, Tung T Nguyen",
    "publish": "Proceedings of the 2025 10th International Conference on Cloud Computing and Internet of Things",
    "url": "https://doi.org/10.1145/3785520.3785536",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-4",
    "title": "The Analysis and Prospect of CNPC's EV Charging Business Based on Machine Learning",
    "authors": "Xi Deng, Yun Peng, Feng Gao",
    "publish": "Proceedings of the 2025 International Conference on Artificial Intelligence and Sustainable Development",
    "url": "https://doi.org/10.1145/3786484.3786506",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-4",
    "title": "Towards Human-Like Sarcasm Recognition: A Context-Enriched Transformer Based Framework",
    "authors": "Muhammad Iqbal Abu Latiffi, Mohd Ridzwan Yaakub, Azuraliza Abu Bakar",
    "publish": "Proceedings of the 2025 6th International Artificial Intelligence and Blockchain Conference",
    "url": "https://doi.org/10.1145/3775043.3775048",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-4",
    "title": "Proceedings of the 2025 6th International Artificial Intelligence and Blockchain Conference",
    "authors": "N/A",
    "publish": "N/A",
    "url": "https://doi.org/10.1145/3775043",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-4",
    "title": "Frame-based Synchronization for Multi-view Multi-sensor Fusion in Embedded Systems",
    "authors": "Hsiu-Yi Ouyang, Jia-Wei Wu, Ya-Shu Chen",
    "publish": "Proceedings of the International Conference on Research in Adaptive and Convergent Systems",
    "url": "https://doi.org/10.1145/3769002.3769955",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-4",
    "title": "Interface Alignment Between O-RAN and 3GPP for V2X Communications",
    "authors": "Deepak Singh, Muhammad Ashar Tariq, Youngjoon Yang, Mahnoor Ajmal, Chaehyeon Kim, Joohwan Park, Dongkyun Kim",
    "publish": "Proceedings of the International Conference on Research in Adaptive and Convergent Systems",
    "url": "https://doi.org/10.1145/3769002.3769983",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-4",
    "title": "User-Centric Adaptive SDS: Data Compression and Erasure Coding for Efficient Ceph Storage",
    "authors": "Shu-Ping Lu, Hung-Ming Chen, Chin-Fu Kuo, Yung-Feng Lu, Yen-Ming Chen",
    "publish": "Proceedings of the International Conference on Research in Adaptive and Convergent Systems",
    "url": "https://doi.org/10.1145/3769002.3769965",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-4",
    "title": "Data Analysis and Optimization of Enterprise Contract Execution Compliance Management Based on Internal and External Data Linkage",
    "authors": "Min Tan, Xin Yuan, Saixiao Huang",
    "publish": "Proceedings of the 2025 International Conference on Artificial Intelligence and Sustainable Development",
    "url": "https://doi.org/10.1145/3786484.3786529",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-4",
    "title": "Research on the Application Mechanism of Artificial Intelligence Technology in Online Learning Platforms",
    "authors": "Zhirong Hou",
    "publish": "Proceedings of the 2025 International Conference on Artificial Intelligence and Sustainable Development",
    "url": "https://doi.org/10.1145/3786484.3786513",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-4",
    "title": "Research on Multi-Agent Task Path Optimization and Collaborative Execution Driven by Knowledge Graphs",
    "authors": "Yun Zheng, Xiya Li, Wei Wang",
    "publish": "Proceedings of the 2025 International Conference on Artificial Intelligence and Sustainable Development",
    "url": "https://doi.org/10.1145/3786484.3786537",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-4",
    "title": "Smart Home Device Control Solution",
    "authors": "Duong V. Nguyen, Hieu V. Dang, Hai D. Nguyen, Khang T. Ngo",
    "publish": "Proceedings of the 2025 10th International Conference on Cloud Computing and Internet of Things",
    "url": "https://doi.org/10.1145/3785520.3785535",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-4",
    "title": "AI Application in Anti-Money Laundering for Sustainable and Transparent Financial Systems",
    "authors": "Chuanhao Nie, Yunbo Liu, Chao Wang",
    "publish": "Proceedings of the 2025 International Conference on Artificial Intelligence and Sustainable Development",
    "url": "https://doi.org/10.1145/3786484.3786522",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-4",
    "title": "Metadata-aware RAG for Enforcing Access Control and Metadata-based Filtering: Proof of Concept and Evaluation",
    "authors": "Bingxiang Chen, Toni Taipalus",
    "publish": "Proceedings of the International Conference on Research in Adaptive and Convergent Systems",
    "url": "https://doi.org/10.1145/3769002.3769952",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-4",
    "title": "Reinforcement Learning-Based Energy-Aware Coverage Path Planning for Precision Agriculture",
    "authors": "Jun Huang, Beining Wu, Zihao Ding, Leo Ostigaard",
    "publish": "Proceedings of the International Conference on Research in Adaptive and Convergent Systems",
    "url": "https://doi.org/10.1145/3769002.3769971",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-4",
    "title": "Low-Latency Multimedia Delivery via Collaborative Cloud–Edge Caching in Edge Computing Networks",
    "authors": "Guoyi Tang, Chunlin Li, Zihao Zhang, Kun Jiang, Bingxin Wang, Wu Wenhao, Xu Yang, Shaohua Wan",
    "publish": "ACM Transactions on Multimedia Computing, Communications, and Applications",
    "url": "https://doi.org/10.1145/3787976",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-4",
    "title": "Research on the international intelligent operation model of “digitalization + greening” dual-track collaboration of industrial electrical enterprises under intelligent drive",
    "authors": "Wusheng Gao",
    "publish": "Proceedings of the 2025 International Conference on Artificial Intelligence and Sustainable Development",
    "url": "https://doi.org/10.1145/3786484.3786509",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-4",
    "title": "A Depression Detection Method Based on Emotion-Topic Guided In-Context Learning",
    "authors": "Yuntao Shi, Tian Gan, Jie Li, Shuqin Li",
    "publish": "Proceedings of the 2025 International Conference on Artificial Intelligence and Sustainable Development",
    "url": "https://doi.org/10.1145/3786484.3786524",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-4",
    "title": "Open Source Innovation—— A Research Review and Prospects",
    "authors": "Yu Ren, Zhongying Yang",
    "publish": "Proceedings of the 2025 International Conference on Artificial Intelligence and Sustainable Development",
    "url": "https://doi.org/10.1145/3786484.3786545",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-4",
    "title": "CART: Color-Aided Registration Transformer for Point Cloud Density Enhancement",
    "authors": "Yu-Hsin Lin, Chi-Sheng Daniel Shih, Xiaodong Liu",
    "publish": "Proceedings of the International Conference on Research in Adaptive and Convergent Systems",
    "url": "https://doi.org/10.1145/3769002.3769987",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-4",
    "title": "The Impact of Digital Intelligence Systems on Workplace Loneliness Based on K-Means Machine Learning",
    "authors": "Beibei Gui",
    "publish": "Proceedings of the 2025 International Conference on Artificial Intelligence and Sustainable Development",
    "url": "https://doi.org/10.1145/3786484.3786530",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-4",
    "title": "Fusing Headline and Content with Dual-BERT and Weighted Fusion for Fake News Detection",
    "authors": "Son Thanh Nguyen, Trong Thua Huynh, Tuan Anh Le",
    "publish": "Proceedings of the 2025 10th International Conference on Cloud Computing and Internet of Things",
    "url": "https://doi.org/10.1145/3785520.3785529",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-4",
    "title": "The Multi-Institutional Configurational Pathways for Enhancing Rural Water Conservancy Governance Performance in China",
    "authors": "Shuqing Li",
    "publish": "Proceedings of the 2025 International Conference on Artificial Intelligence and Sustainable Development",
    "url": "https://doi.org/10.1145/3786484.3786501",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-4",
    "title": "FedKLEntropy: Enhancing Federated Learning via Model Entropy and Kullback-Leibler Divergence",
    "authors": "Duy-Dong Le, Tuong-Nguyen Huynh, Nhat Tung Le",
    "publish": "Proceedings of the International Conference on Research in Adaptive and Convergent Systems",
    "url": "https://doi.org/10.1145/3769002.3769973",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-4",
    "title": "Leveraging PyTorch for Hardware-Aware Optimization in Efficient Mixture-of-Experts Large Language Model Inference",
    "authors": "Mu-Chi Chen, Po-Hsuan Huang, Yanwen Gai, Shao-Chun Ho, Cheng Liang, Yu-Hung Kao, Yu-Kai Hung, Chia-Heng Tu, Shih-Hao Hung",
    "publish": "Proceedings of the International Conference on Research in Adaptive and Convergent Systems",
    "url": "https://doi.org/10.1145/3769002.3769979",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-4",
    "title": "Construction and Application of an Enterprise Performance Evaluation System from the ESG Perspective: An Empirical Study Based on Hang Lung Group",
    "authors": "Wanli Wang, Xirui Ou, Zhenxing Han",
    "publish": "Proceedings of the 2025 International Conference on Artificial Intelligence and Sustainable Development",
    "url": "https://doi.org/10.1145/3786484.3786487",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-4",
    "title": "Adaptive Grid Merging Density-Biased Sampling Algorithm",
    "authors": "Chunyan Pan, Renchong Zhang",
    "publish": "Proceedings of the 2025 International Conference on Artificial Intelligence and Sustainable Development",
    "url": "https://doi.org/10.1145/3786484.3786548",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-4",
    "title": "The development of geographic information technology in the era of intelligence",
    "authors": "Weiwei Qiu, Zhen Liu, Yu Gao, Jianfei Wu, Zhenwei Liu, Jiayi Zheng",
    "publish": "Proceedings of the 2025 International Conference on Artificial Intelligence and Sustainable Development",
    "url": "https://doi.org/10.1145/3786484.3786500",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-4",
    "title": "Generalizable IoT Device Detection via Flow-Based Network Traffic Analysis and Random Forest",
    "authors": "Alessandro Penna, Christiancarmine Esposito, Valerio Massimi",
    "publish": "Proceedings of the International Conference on Research in Adaptive and Convergent Systems",
    "url": "https://doi.org/10.1145/3769002.3769991",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-4",
    "title": "Reliability Architectures for High-Performance Processors: A Survey and Outlook",
    "authors": "Mingsong Lv, Weichen Liu, Nan Guan",
    "publish": "Proceedings of the International Conference on Research in Adaptive and Convergent Systems",
    "url": "https://doi.org/10.1145/3769002.3769974",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-4",
    "title": "On the Necessity of Stablecoins and the Legal Mechanisms for Their Regulation",
    "authors": "Jiahuan Yan",
    "publish": "Proceedings of the 2025 6th International Artificial Intelligence and Blockchain Conference",
    "url": "https://doi.org/10.1145/3775043.3775045",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-4",
    "title": "Introduction to the Special Issue on ACM Multimedia Systems 2024 and Co-Located Workshops",
    "authors": "Christian Timmerer, Maria Martini, Ali C. Begen, Luca De Cicco",
    "publish": "ACM Transactions on Multimedia Computing, Communications, and Applications",
    "url": "https://doi.org/10.1145/3795767",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-4",
    "title": "Mitigating the Write-amplification effect of large-scale semi-external graphs on SMR drives",
    "authors": "Yi-Syuan Lin, Qi-Cheng Wu, Chih-Xuan Shen, Yu-Pei Liang, Wei-Kuan Shih, Yuan-Hao Chang",
    "publish": "Proceedings of the International Conference on Research in Adaptive and Convergent Systems",
    "url": "https://doi.org/10.1145/3769002.3769972",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-4",
    "title": "Design and Implementation of an AI Learning Companion",
    "authors": "Di Wu, Zhiwu Gong",
    "publish": "Proceedings of the 2025 International Conference on Artificial Intelligence and Sustainable Development",
    "url": "https://doi.org/10.1145/3786484.3786523",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-4",
    "title": "Big Data AI and Customer Relationship Performance: The Impact of Supply Chain Capabilities and Technological Turbulence",
    "authors": "Syed Zamin Shah, Aijun Liu, Ayesha Nusrat, Lei Chen, Xiaodong Li",
    "publish": "Proceedings of the 2025 International Conference on Artificial Intelligence and Sustainable Development",
    "url": "https://doi.org/10.1145/3786484.3786540",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-4",
    "title": "Leveraging NVRAM to Improve Read Performance of LSM-tree in Hybrid Storage Systems",
    "authors": "Yi-Hua Chen, Yu-Pei Liang, Shuo-Han Chen, Tse-Wei Lee, Wei-Kuan Shih, Yuan-Hao Chang",
    "publish": "Proceedings of the International Conference on Research in Adaptive and Convergent Systems",
    "url": "https://doi.org/10.1145/3769002.3769968",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-4",
    "title": "Temperature Wear Leveling: Mitigating Peak Temperature on NAND Flash Memory",
    "authors": "Jun Rui Chen, Chin-Hsien Wu, Pi-Cheng Hsiu, Chi Lu",
    "publish": "Proceedings of the International Conference on Research in Adaptive and Convergent Systems",
    "url": "https://doi.org/10.1145/3769002.3769967",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-4",
    "title": "Efficient Approaches for Permutation-Constrained Common String Partitions",
    "authors": "Trong Thua Huynh",
    "publish": "Proceedings of the 2025 10th International Conference on Cloud Computing and Internet of Things",
    "url": "https://doi.org/10.1145/3785520.3785531",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-4",
    "title": "Inversion analysis of thermodynamic parameters of concrete dam based on intelligent algorithm",
    "authors": "Yue Yue, Shifa Xia, Qiaorong Sun",
    "publish": "Proceedings of the 2025 International Conference on Artificial Intelligence and Sustainable Development",
    "url": "https://doi.org/10.1145/3786484.3786546",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-4",
    "title": "Discovering Spatial Correlations of Earth Observations for Weather Forecasting by using Graph Structure Learning",
    "authors": "Hyeon-Ju Jeon, Jeon-Ho Kang, In-Hyuk Kwon, O-Joun Lee",
    "publish": "Proceedings of the International Conference on Research in Adaptive and Convergent Systems",
    "url": "https://doi.org/10.1145/3769002.3769956",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-4",
    "title": "Cloud-Native Architecture for Municipal Government Digital and Intelligent Transformation: Design and Implementation",
    "authors": "Haijun Sun",
    "publish": "Proceedings of the 2025 International Conference on Artificial Intelligence and Sustainable Development",
    "url": "https://doi.org/10.1145/3786484.3786535",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-4",
    "title": "Optimizing Class-Level Code Generation: Enhancing In-Context Learning in Large Language Models with Pruning Techniques",
    "authors": "Mingyang Geng, Zizhao Zhang, Ping Du, Xiangyuan Yin, Hongyang Chen, Bo Liu, Zhenshun Shi",
    "publish": "Proceedings of the 2025 International Conference on Artificial Intelligence and Sustainable Development",
    "url": "https://doi.org/10.1145/3786484.3786551",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-4",
    "title": "A Fault Localization Method for Cloud-based Runtime Systems based on Multi-layer Events",
    "authors": "Rijin Jin, Jin Huang",
    "publish": "Proceedings of the 2025 10th International Conference on Cloud Computing and Internet of Things",
    "url": "https://doi.org/10.1145/3785520.3785527",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-4",
    "title": "Adaptive Block Size Selection for Translating Triton Kernels to RVV",
    "authors": "Liu Yuhao, William Kevin, Feige Zhou, Yeh-Ching Chung, Wei-Chung Hsu",
    "publish": "Proceedings of the International Conference on Research in Adaptive and Convergent Systems",
    "url": "https://doi.org/10.1145/3769002.3769969",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-4",
    "title": "Structure- and Semantic-based Rationale Distillation: Table and Chart Question Answering in Scientific Documents",
    "authors": "Dongyoun Kim, Wonseok Heo, Jee-Hyong Lee, Kwanghee Won",
    "publish": "Proceedings of the International Conference on Research in Adaptive and Convergent Systems",
    "url": "https://doi.org/10.1145/3769002.3769953",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-4",
    "title": "Spatio-temporal Evolution and Coupling Coordination Mechanism between Air Pollution Governance and Sports Venue Development",
    "authors": "Jianding Xu, Shaocong Zhao, Jiaxun Xu",
    "publish": "Proceedings of the 2025 International Conference on Artificial Intelligence and Sustainable Development",
    "url": "https://doi.org/10.1145/3786484.3786498",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-4",
    "title": "Digital Art Design and Intelligent Re-creation of Intangible Cultural Heritage Patterns Based on Diffusion Generation Model",
    "authors": "Zhiye Zhang, Junjun Hu",
    "publish": "Proceedings of the 2025 International Conference on Artificial Intelligence and Sustainable Development",
    "url": "https://doi.org/10.1145/3786484.3786527",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-4",
    "title": "Regeneration Based on Spatial Reconstruction: A case Study of Industrial Heritage Transformation and Protection in Yunnan Smelting",
    "authors": "Dejia Huang",
    "publish": "Proceedings of the 2025 International Conference on Artificial Intelligence and Sustainable Development",
    "url": "https://doi.org/10.1145/3786484.3786517",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-4",
    "title": "Artificial Intelligence in Healthcare: Strategic Value, Constraints, and a Governance-First Integration Framework",
    "authors": "Shiqi Zheng, Mingtao Liu",
    "publish": "Proceedings of the 2025 International Conference on Artificial Intelligence and Sustainable Development",
    "url": "https://doi.org/10.1145/3786484.3786512",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-4",
    "title": "A Comparative Study of China's National Image Before and After the COVID-19 Pandemic Based on Twitter Text Mining",
    "authors": "Yisheng Liu, Leran Wang, Zhan Tang, Chong Zhang",
    "publish": "Proceedings of the 2025 International Conference on Artificial Intelligence and Sustainable Development",
    "url": "https://doi.org/10.1145/3786484.3786526",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-4",
    "title": "Evaluating Small Language Models for Intrusion Detection on Automotive Embedded Platforms",
    "authors": "Islam Salah, Junggab Son, Stefan Robila, Daeyoung Kim",
    "publish": "Proceedings of the International Conference on Research in Adaptive and Convergent Systems",
    "url": "https://doi.org/10.1145/3769002.3769959",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-4",
    "title": "Priority-Aware Multilink Downlink Scheduling with Dynamic MRU Optimization for IEEE 802.11be",
    "authors": "Ting-Ting Yang, Hsueh-Wen Tseng, Guan-Lin Chen",
    "publish": "Proceedings of the International Conference on Research in Adaptive and Convergent Systems",
    "url": "https://doi.org/10.1145/3769002.3769977",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-4",
    "title": "FormalGym: Deep Reinforcement Learning Agent Based Formal Compiler Optimization Framework",
    "authors": "Abhilash Majumder",
    "publish": "Proceedings of the International Conference on Research in Adaptive and Convergent Systems",
    "url": "https://doi.org/10.1145/3769002.3769975",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-4",
    "title": "Lime Peel Freshness Classification Using Machine Learning and Blockchain based upon the Thai Agricultural Standard No. TAS 27-2017",
    "authors": "Athakorn Kengpol, Alongkorn Klaiklueng",
    "publish": "Proceedings of the 2025 6th International Artificial Intelligence and Blockchain Conference",
    "url": "https://doi.org/10.1145/3775043.3775044",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-4",
    "title": "Calibrated and Explainable Flight Delay Prediction with Tree-Based Models in Machine Learning",
    "authors": "Zhenglin Wang",
    "publish": "Proceedings of the 2025 International Conference on Artificial Intelligence and Sustainable Development",
    "url": "https://doi.org/10.1145/3786484.3786539",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-4",
    "title": "A Defence-Oriented Study of API Security in CI/CD Pipelines",
    "authors": "Sabbir M. Saleh, Md Nafiz Al Ifat, Nazim H. Madhavji, John Steinbacher",
    "publish": "Proceedings of the 2025 10th International Conference on Cloud Computing and Internet of Things",
    "url": "https://doi.org/10.1145/3785520.3785526",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-4",
    "title": "Linear Regression-Based Cloud Resource Demand Forecasting and Dynamic Scheduling",
    "authors": "Yung-Feng Lu, Hung-Ming Chen, Chin-Fu Kuo, Shu-Ping Lu, Hong-Sheng Sun",
    "publish": "Proceedings of the International Conference on Research in Adaptive and Convergent Systems",
    "url": "https://doi.org/10.1145/3769002.3769964",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-4",
    "title": "Improving Flash Memory Reliability in High-Density Storage through Data-Aware Page Shuffling",
    "authors": "Bo-Jia Wu, Jen-Wei Hsieh",
    "publish": "Proceedings of the International Conference on Research in Adaptive and Convergent Systems",
    "url": "https://doi.org/10.1145/3769002.3769988",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-4",
    "title": "A Study on the Application of Digital Humanities to the Teaching of English Audiovisual Speaking in Universities",
    "authors": "Ligen Wei",
    "publish": "Proceedings of the 2025 International Conference on Artificial Intelligence and Sustainable Development",
    "url": "https://doi.org/10.1145/3786484.3786532",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-4",
    "title": "Idle Consumer GPUs as a Complement to Enterprise Hardware for LLM Inference: Performance, Cost and Carbon Analysis",
    "authors": "Aline Ribeiro de Almeida",
    "publish": "Proceedings of the 2025 6th International Artificial Intelligence and Blockchain Conference",
    "url": "https://doi.org/10.1145/3775043.3775047",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-4",
    "title": "Enhanced Debugging of CPython and Pytorch with GDB",
    "authors": "Shinhyeok Pakr, Minjae Kim, Jungsu Park, Juho Park, Jeongyun Lee, Hong Min",
    "publish": "Proceedings of the International Conference on Research in Adaptive and Convergent Systems",
    "url": "https://doi.org/10.1145/3769002.3769958",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-4",
    "title": "Grade Like a Human: Rethinking Automated Assessment with Large Language Models",
    "authors": "Wenjing Xie, Juxin Niu, Chun Jason Xue, Nan Guan",
    "publish": "Proceedings of the International Conference on Research in Adaptive and Convergent Systems",
    "url": "https://doi.org/10.1145/3769002.3769962",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-4",
    "title": "Meta-Model Design for Spiking Neural Network Simulation",
    "authors": "U Hyun Son, Junyoung Heo",
    "publish": "Proceedings of the International Conference on Research in Adaptive and Convergent Systems",
    "url": "https://doi.org/10.1145/3769002.3769966",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-4",
    "title": "The nonlinear effect of digital transformation on corporate greenwashing",
    "authors": "Wei Zhang, Ming Si",
    "publish": "Proceedings of the 2025 International Conference on Artificial Intelligence and Sustainable Development",
    "url": "https://doi.org/10.1145/3786484.3786503",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-4",
    "title": "Organizational Innovation Strategies for Chinese New Energy Vehicle Enterprises to Enhance Financial Performance: An Empirical Research Based on the QCA Method",
    "authors": "Yu He, Xiaohong Liu, Yi Luo",
    "publish": "Proceedings of the 2025 International Conference on Artificial Intelligence and Sustainable Development",
    "url": "https://doi.org/10.1145/3786484.3786492",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-4",
    "title": "Automatic Extraction and Cultural Creative Application of Intangible Cultural Heritage Patterns Based on Deep Learning",
    "authors": "Gu Fang, Dongmin Geng",
    "publish": "Proceedings of the 2025 International Conference on Artificial Intelligence and Sustainable Development",
    "url": "https://doi.org/10.1145/3786484.3786533",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-4",
    "title": "Research on Collision Avoidance Warning of High-Speed Maintenance Vehicle Based on Adaptive Algorithm",
    "authors": "Zongxue Yan, Zeyu Du, Han Li, Jiacan Lu, Yidou Xiao, Nan Gao",
    "publish": "Proceedings of the 2025 International Conference on Artificial Intelligence and Sustainable Development",
    "url": "https://doi.org/10.1145/3786484.3786543",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-4",
    "title": "Generative AI-Driven Procedural Character and Dialogue System for Interactive Digital Narratives",
    "authors": "Xuanjia Ren, Jinho Yim",
    "publish": "Proceedings of the 2025 International Conference on Artificial Intelligence and Sustainable Development",
    "url": "https://doi.org/10.1145/3786484.3786518",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-4",
    "title": "Smarter Spaces, Smoother Flows: Evaluating the Terrain Adaptability of LID Layouts via NSGA-II Optimization",
    "authors": "Yafeng Wan, An Xu, Ming Chen, Maolong Peng",
    "publish": "Proceedings of the 2025 International Conference on Artificial Intelligence and Sustainable Development",
    "url": "https://doi.org/10.1145/3786484.3786488",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-4",
    "title": "Development of Chinese Traditional Cheongsam's Modularization and Digital Resource Library",
    "authors": "Zifei Guo, Kai Ma",
    "publish": "Proceedings of the 2025 International Conference on Artificial Intelligence and Sustainable Development",
    "url": "https://doi.org/10.1145/3786484.3786514",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-4",
    "title": "An AI-Enhanced System with Microwave-Functionalized Water for Sustainable Cultivation of Dendrobium officinale",
    "authors": "Jinyong Wang, Paras Shah, Jiaxin Wang, Baozhu Du, Yuyin Tan, Yuanqi Wang, Lei Wang",
    "publish": "Proceedings of the 2025 International Conference on Artificial Intelligence and Sustainable Development",
    "url": "https://doi.org/10.1145/3786484.3786507",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-4",
    "title": "Attention-Enhanced Dual Network Framework for Remote Sensing Land Cover Classification",
    "authors": "Taimoor Khan, Namgyu Jung, Junho Yoon, Pankoo Kim, Chang Choi",
    "publish": "Proceedings of the International Conference on Research in Adaptive and Convergent Systems",
    "url": "https://doi.org/10.1145/3769002.3769976",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-4",
    "title": "Research on Intelligent Optimization of Water Injection Scheme for Water-Flooding Reservoirs Based on Improved Genetic Algorithm",
    "authors": "Yingqiu Lu",
    "publish": "Proceedings of the 2025 International Conference on Artificial Intelligence and Sustainable Development",
    "url": "https://doi.org/10.1145/3786484.3786544",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-4",
    "title": "The Application of the Random Forest Algorithm in the Intelligent Selection of Key Parameters for Shield Tunneling",
    "authors": "Zhenjian Zhou, Kai Wang, Huizhong Gao, Yong Dai, Yongbo Pan",
    "publish": "Proceedings of the 2025 International Conference on Artificial Intelligence and Sustainable Development",
    "url": "https://doi.org/10.1145/3786484.3786541",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-4",
    "title": "FoodHash: Context-Aware Proxy Interaction and Fusion for Food Image Retrieval",
    "authors": "Pindan Cao, Weiqing Min, Guorui Sheng, Yongqiang Song, Tao Yao, Lili Wang, Shuqiang Jiang",
    "publish": "ACM Transactions on Multimedia Computing, Communications, and Applications",
    "url": "https://doi.org/10.1145/3787854",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-4",
    "title": "Comparing XAI Methods for Identifying Critical Features and Expert Contributions in Multi-Expert Edge Computing Attack Detection",
    "authors": "Minh Hoang -Nguyen, Trong-Minh Hoang, Thi Trang Linh Le",
    "publish": "Proceedings of the 2025 10th International Conference on Cloud Computing and Internet of Things",
    "url": "https://doi.org/10.1145/3785520.3785524",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-4",
    "title": "Insights and predictive analytics for heart disease using Python and machine learning",
    "authors": "Jing Ke, Weijian Du, Jitao Li, Hui Lei, Beiqi Chen, Siyuan Huang, JunJie Yang",
    "publish": "Proceedings of the 2025 International Conference on Artificial Intelligence and Sustainable Development",
    "url": "https://doi.org/10.1145/3786484.3786528",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-4",
    "title": "Multi-agent Auto-Bidding with Latent Graph Diffusion Models.",
    "authors": "Dom Huh, Prasant Mohapatra",
    "publish": "Proceedings of the International Conference on Research in Adaptive and Convergent Systems",
    "url": "https://doi.org/10.1145/3769002.3769957",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-4",
    "title": "Optimizing Edge Inference with Divide-and-Conquer Segmentation and Multi-Pipeline Coordination",
    "authors": "Chin-Fu Kuo, Yu-Yi Chu, Yung-Feng Lu, Shu-Ping Lu",
    "publish": "Proceedings of the International Conference on Research in Adaptive and Convergent Systems",
    "url": "https://doi.org/10.1145/3769002.3769954",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-4",
    "title": "Research on Industrial Structure Upgrading Strategies Based on Multimodal Feature Fusion in the Context of the Digital Economy",
    "authors": "Jun Wang, Yawei Shi",
    "publish": "Proceedings of the 2025 International Conference on Artificial Intelligence and Sustainable Development",
    "url": "https://doi.org/10.1145/3786484.3786511",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-4",
    "title": "A Practical Evaluation of Paging Algorithm Smoothness: Trade-offs Between Competitiveness and Stability",
    "authors": "Nguyen Minh Tuan, Chau Van Van, Nguyen Hong Son",
    "publish": "Proceedings of the 2025 10th International Conference on Cloud Computing and Internet of Things",
    "url": "https://doi.org/10.1145/3785520.3785528",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-4",
    "title": "Research on Reinforcement Learning Integrated Game Intelligence about Multi-group Rescue",
    "authors": "Min Wang, Chong Sun, Yang Zhao, Jie Li, Rangcheng Wu, Xiangqian Shi",
    "publish": "Proceedings of the 2025 International Conference on Artificial Intelligence and Sustainable Development",
    "url": "https://doi.org/10.1145/3786484.3786549",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-4",
    "title": "Research on Carbon Emission Efficiency Based on Super-efficiency SBM and Malmquist Model",
    "authors": "Hongqi Hui, Yingnan Zhao",
    "publish": "Proceedings of the 2025 International Conference on Artificial Intelligence and Sustainable Development",
    "url": "https://doi.org/10.1145/3786484.3786489",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-4",
    "title": "SPARK: Share-Per-tick Adaptive Redistribution with Kernel-gating",
    "authors": "Ki Cheol Park, Yongjin Kwon, Jae Hoon An, Young Hwan Kim",
    "publish": "Proceedings of the International Conference on Research in Adaptive and Convergent Systems",
    "url": "https://doi.org/10.1145/3769002.3769978",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-4",
    "title": "Analysis of the characteristic sources of heavy metal pollution and health risk assessment in the sediments of the Yellow River in Lanzhou based on the PMF model",
    "authors": "Yi Chen, Jianxiu Hao",
    "publish": "Proceedings of the 2025 International Conference on Artificial Intelligence and Sustainable Development",
    "url": "https://doi.org/10.1145/3786484.3786490",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-4",
    "title": "A Study on the Effect of the STEM Method on Improving the Learning Thinking of Vocational School Students",
    "authors": "Xixi Gu, Si Li",
    "publish": "Proceedings of the 2025 International Conference on Artificial Intelligence and Sustainable Development",
    "url": "https://doi.org/10.1145/3786484.3786521",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-4",
    "title": "Synergy of Artificial Intelligence and Extended Reality in Patient-focused Health and Well-Being Applications – A Systematic Review",
    "authors": "Tim Schwirtlich, Cheolmin Matthew Lee, Molly Beestrum, David C. Mohr",
    "publish": "ACM Transactions on Computing for Healthcare",
    "url": "https://doi.org/10.1145/3793544",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-4",
    "title": "GT-FID: A Graph-Temporal Fusion Network for Host-Based Intrusion Detection from System Call Sequences",
    "authors": "Phuc Hao Do, Tran Duc Le, Truong Duy Dinh, Van Dai Pham, Thi Le Quyen Nguyen",
    "publish": "Proceedings of the 2025 10th International Conference on Cloud Computing and Internet of Things",
    "url": "https://doi.org/10.1145/3785520.3785522",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-4",
    "title": "ECDAR: An Energy-efficient, Channel- and Depth-Aware Adaptive Routing for Underwater Sensor Networks",
    "authors": "Cong-Minh Vo, Cong-Hung Tran, Thai-Khanh Pham, Huu-Dung Ngo, Khoa Tran Thi-Minh",
    "publish": "Proceedings of the International Conference on Research in Adaptive and Convergent Systems",
    "url": "https://doi.org/10.1145/3769002.3769960",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-4",
    "title": "Less Is More: Failing Test Generation with Large Language Models",
    "authors": "Tsz-On Li, Xiaochuan Yan, Wenxi Zong, Yibo Wang, Haoye Tian, Congying Xu, Ying Wang, Shing-Chi Cheung, Jeff Kramer",
    "publish": "ACM Transactions on Software Engineering and Methodology",
    "url": "https://doi.org/10.1145/3793675",
    "source": "ACM",
    "abstract": "None"
  }
]