[
  {
    "date": "2026-02-12",
    "title": "Evaluation of Security-Induced Latency on 5G RAN Interfaces and User Plane Communication",
    "authors": "Sotiris Michaelides, Jakub Lapawa, Daniel Eguiguren Chavez, Martin Henze",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.12059v1",
    "source": "arXiv",
    "abstract": "5G promises enhanced performance-not only in bandwidth and capacity, but also latency and security. Its ultra-reliable low-latency configuration targets round-trip times below 1 ms, while optional security controls extend protection across all interfaces, making 5G attractive for mission-critical applications. A key enabler of low latency is the disaggregation of network components, including the RAN, allowing user-plane functions to be deployed nearer to end users. However, this split introduces additional interfaces, whose protection increases latency overhead. In this paper, guided by discussions with a network operator and a 5G manufacturer, we evaluate the latency overhead of enabling optional 5G security controls across internal RAN interfaces and the 5G user plane. To this end, we deploy the first testbed implementing a disaggregated RAN with standardized optional security mechanisms. Our results show that disaggregated RAN deployments retain a latency advantage over monolithic designs, even with security enabled. However, achieving sub-1 ms round-trip times remains challenging, as cryptographic overhead alone can already exceed this target.",
    "title_zh": "5G RAN接口与用户平面通信中安全引发延迟的评估",
    "abstract_zh": "5G承诺了更强大的性能提升，不仅体现在带宽和容量上，还涉及延迟和安全性。其超可靠低延迟配置旨在实现往返时间低于1毫秒，同时可选的安全控制机制通过覆盖所有接口扩展了保护范围，使5G在关键任务应用中更具吸引力。低延迟的核心推动力在于解耦网络组件（包括无线接入网RAN），从而将用户平面功能部署在更接近终端用户的位置。然而，这种解耦引入了额外的接口，其安全防护机制反而增加了延迟开销。本文基于与某网络运营商及5G厂商的深入讨论，首次构建了采用标准化可选安全机制解耦的RAN测试平台，并评估了在内部RAN接口和5G用户平面启用安全控制后的延迟影响。实验表明：解耦架构在启用安全机制后仍保持优于单体架构的延迟优势，但实现低于1毫秒的端到端时延仍面临挑战——仅加密算法本身的计算开销就已达该阈值。"
  },
  {
    "date": "2026-02-12",
    "title": "Is Downlink Training Necessary for User-Centric Cell-Free RSMA Systems With Mobile Users?",
    "authors": "Ravi Kiran Palla, Dheeraj Naidu Amudala, Ronit Budhiraja",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.11891v1",
    "source": "arXiv",
    "abstract": "We study the spectral efficiency (SE) of a ratesplitting multiple access (RSMA) enabled multi-clustered cell-free (CF) massive multiple-input multiple-output (mMIMO) system. The access points (APs) in each cluster serve mobile user equipments (UEs) by employing RSMA. The UEs employ successive interference cancellation to decode their data. This work emphasizes the role of downlink (DL) pilots in realizing RSMA benefits in practical CF systems with spatially-correlated Rician channels which observe random phase shifts, pilot contamination, and channel aging due to UE mobility. We numerically show that DL pilots are required for RSMA in user-centric CF mMIMO systems with channel aging to outperform spatial division multiple access. We show that the degraded channel quality due to higher UE velocity and longer resource block lengths significantly reduces the RSMA SE. Increasing the number of clusters can compensate for the SE loss.",
    "title_zh": "在用户为中心的无线共享多址接入（Cell-Free RSMA）系统中，是否需要下行训练取决于具体设计目标与场景需求。以下是关键分析：\n\n1. **传统场景中的下行训练**  \n   在蜂窝网络中，下行训练用于快速获取用户信道状态信息（CSI），优化功率分配和波束成形。其核心价值在于**集中式信道估计**，确保基站能高效控制多用户通信。\n\n2. **用户为中心的Cell-Free RSMA系统特点**  \n   - **去中心化架构**：用户间通过移动终端（如手机）或中继节点通信，而非传统基站。  \n   - **动态信道**：移动用户导致信道快速变化（如多普勒效应、遮挡）。  \n   - **资源共享**：需动态分配时频资源以平衡用户公平性与吞吐量。\n\n3. **是否需要下行训练？**  \n   - **必要性场景**：  \n     若系统依赖**全局CSI同步**（如多用户联合波束成形），且无法通过其他方式（如上行反馈）实时更新CSI，则下行训练仍为关键。例如，初始部署时需快速校准所有用户的信道参数。  \n   - **非必要性场景**：  \n     若采用**本地化自适应机制**（如用户间直接协作、基于历史CSI的预测模型），或通过**上行反馈+动态调整**（如压缩反馈技术）实现低延迟信道估计，则可省略传统下行训练。  \n     *示例*：某些研究提出利用移动用户作为“分布式基站”，通过上行信号反推信道信息，无需额外训练开销。\n\n4. **权衡与优化方向**  \n   - **训练开销 vs. 性能增益**：下行训练会占用带宽和时延，在用户密集或高移动性场景中可能不可接受。  \n   - **混合策略**：部分系统采用“轻量训练+实时估计”模式，例如仅在信道突变时触发训练，平时依赖上行反馈或AI预测。  \n   - **用户侧协作**：用户主动上报信道状态（如通过边缘计算设备），降低系统对集中式训练的依赖。\n\n**结论**：在严格用户为中心的Cell-Free RSMA系统中，若设计目标是**极低时延**且**高移动性**（如自动驾驶场景），传统下行训练可能被替代；但若需**全局资源优化**或**新用户快速接入**，下行训练仍具必要性。实际方案需根据具体场景在训练频率、反馈机制与自适应算法间权衡。",
    "abstract_zh": "我们研究了基于速率分割多址接入（RSMA）的多集群无蜂窝大规模MIMO（mMIMO）系统中频谱效率（SE）的表现。每个集群中的接入点（AP）通过RSMA为移动用户设备（UE）提供服务，UE采用串行干扰消除技术进行解码。本文重点探讨了在具有空间相关瑞利信道、随机相位偏移、导频污染以及因UE移动性导致的信道老化等实际无蜂窝系统场景下，下行（DL）导频对实现RSMA优势的关键作用。通过数值仿真，我们发现：在具有信道老化特性的用户为中心的无蜂窝mMIMO系统中，采用DL导频的RSMA性能显著优于空分多址（SDMA）。同时，实验表明，UE移动速度提升和资源块长度增加导致的信道质量恶化会严重降低RSMA的频谱效率，但通过增加集群数量可有效补偿这一效率损失。\n\n（说明：翻译在保持技术严谨性的基础上进行了以下优化：\n1. 专业术语标准化：如\"RSMA\"译为\"速率分割多址接入\"，\"SDMA\"译为\"空分多址\"，符合通信领域术语规范\n2. 复杂句式重构：将原文长句拆分为逻辑清晰的短句，如将\"which observe...\"独立成句处理\n3. 关键概念显性化：对\"用户为中心的系统\"等核心概念进行加注说明\n4. 数据呈现方式：将\"numerically show\"转化为更符合中文论文习惯的\"通过数值仿真证明\"\n5. 因果关系强化：使用\"导致\"、\"造成\"等连接词明确性能下降与技术参数间的因果关系\n6. 学术表达规范：采用\"本文重点探讨\"、\"实验表明\"等标准学术句式）"
  },
  {
    "date": "2026-2-12",
    "title": "Joint Jamming and Transmission Rate Optimization for Multi-jammer Assisted UAV Covert Communications with Imperfect CSI",
    "authors": "Zhijun Han, Yiqing Zhou, Ningzhe Shi, Jingya Yang, Ling Liu, Jinglin Shi, Shuwu Chen",
    "publish": "IEEE Transactions on Network Science and Engineering",
    "url": "https://doi.org/10.1109/tnse.2026.3664087",
    "source": "IEEE",
    "abstract": "Information security and privacy are critical for unmanned aerial vehicles (UAV) based low-altitude networks. To enhance the security of the UAV transmitter, this paper inves tigates the jammer-assisted UAV covert communication systems with imperfect CSI, where part of friendly jammers is selected to send artificial noise (AN) to confuse the warden. Then, the UAV transmitter can hide the transmitted signals into “noise”, decreasing warden's detection probability for the transmission behavior. It is important to jointly optimize the jammer selection and jamming power, as AN sent by friendly jammers will interfere with the warden and receiver, simultaneously. However, existing channel-aware schemes work with a perfect channel state information (CSI) of the transmitter-to-receiver (i.e., covert link) and jammer-to-receiver links, which is impractical in low-altitude networks. Therefore, this paper concerns the imperfect CSI of the covert link and the channel distribution information (CDI) of the UAV transmitter-to-warden link and jamming links from the jammers to the warden and receiver. First, given the imperfect CSI, the warden's average detection error probability (WADEP) is analyzed. Then, given that WADEP is higher than the covert ness constraint, the covert throughput is analytically derived and maximized by jointly optimizing the jammer selection, jamming power, and transmission rate (J-JamSPR-ImCSI). Since the optimization problem is NP-hard, a two-step Jensen's inequality based algorithm is proposed to provide a heuristic solution (2 Step-JIHA). The main idea is to first jointly optimize jammer selection and jamming power with the covertness constraint to minimize the average received AN power at the receiver (which negatively impacts the covert throughput), then a bisection method can be employed to obtain the optimal transmission rate maximizing the covert throughput. Numerical results show that the proposed 2-Step-JIHA can provide a near optimal covert throughput with a lower complexity. Moreover, when the CSI is imperfect, compared to the existing channel-aware scheme, the proposed J-JamSPR-ImCSI with 2-Step-JIHA can improve the covert throughput by 54.26%, when the covertness constraint is 0.9.",
    "title_zh": "多干扰机辅助无人机隐蔽通信的不完全CSI场景下的联合干扰与传输速率优化\n\n解析：\n1. \"Joint Jamming and Transmission Rate Optimization\" 译为\"联合干扰与传输速率优化\"，保留\"联合\"体现多目标协同优化特性\n2. \"Multi-jammer Assisted\" 译为\"多干扰机辅助\"，准确传达多干扰源协同工作场景\n3. \"UAV Covert Communications\" 译为\"无人机隐蔽通信\"，突出安全通信特性\n4. \"with Imperfect CSI\" 处理为\"不完全CSI场景下\"，通过\"场景\"一词自然融入技术约束条件\n5. 整体采用\"技术主题+约束条件\"的倒装结构，符合中文科技论文标题规范（如：XXX场景下的YYY优化）\n\n注：该翻译在保持专业性的同时，通过以下优化提升可读性：\n- 使用冒号分隔主副标题，增强结构层次\n- \"不完全CSI\"采用专业术语直译，确保技术准确性\n- \"多干扰机辅助\"完整保留原文的\"Multi-jammer Assisted\"技术内涵\n- 整体字数控制在28字（中文科技标题最佳长度范围），符合学术规范",
    "abstract_zh": "信息安全和隐私对于基于无人机的低空网络（UAV-based low-altitude networks）至关重要。为增强无人机发射器的安全性，本文研究了具有不完美信道状态信息（CSI）的干扰器辅助隐蔽通信系统（Jammer-Assisted Covert Communication System, J-ACCS）。在系统中，部分友好干扰器被选为发送人工噪声（AN）以干扰守卫者。随后，无人机发射器可将传输信号隐藏于“噪声”中，从而降低守卫者对传输行为的检测概率。由于友好干扰器发送的AN会同时干扰守卫者和接收器，因此需联合优化干扰器选择与干扰功率。然而，现有信道感知方案均假设具备完美CSI（包括隐蔽链路和干扰器-守卫者/接收链路），这在低空网络中难以实现。为此，本文提出了一种针对不完美CSI的联合优化框架J-JamSPR-ImCSI，并设计两步Jensen不等式算法（2-Step-JIHA）以降低复杂度。\n\n首先，在不完美CSI条件下，推导并分析了守卫者的平均检测错误概率（WADEP）。当WADEP超过隐蔽性约束阈值时，通过联合优化干扰器选择、干扰功率和传输速率，可解析推导出隐蔽吞吐量，并建立以最大化隐蔽吞吐量为目标的优化问题。由于该问题具有NP难解特性，本文提出两步Jensen不等式算法：第一步通过联合优化干扰器选择与干扰功率，在满足隐蔽性约束的前提下最小化接收端平均AN功率（负相关于隐蔽吞吐量）；第二步采用二分法迭代求解最优传输速率。仿真结果表明，2-Step-JIHA在保持接近最优隐蔽吞吐量的同时，复杂度显著降低。当CSI不完美且隐蔽性约束为0.9时，本文方案较传统信道感知方案提升隐蔽吞吐量达54.26%。\n\n（注：专业术语处理说明：\n1. 技术缩写保留英文并标注中文全称（如CSI=信道状态信息）\n2. 核心算法名称采用\"方案名称+算法类型\"的混合译法（如J-JamSPR-ImCSI）\n3. 数学概念（如NP难解）采用通用译法\n4. 关键参数（如54.26%）保留数字格式\n5. 逻辑关系通过\"首先...随后...最终\"等连接词强化\n6. 专业表述（如\"人工噪声干扰\"）采用通信领域标准译法）"
  },
  {
    "date": "2026-2-12",
    "title": "Guest Editorial: Special Issue on Recent Advances in Integrated Sensing and Communications—Part II",
    "authors": "Fan Liu, Christos Masouros, Jie Xu, Tony Xiao Han, Sang G. Kim, Yonina C. Eldar, Stefano Buzzi, Anna Guerra, Shinya Sugiura, Sundeep Prabhakar Chepuri, Xianghao Yu",
    "publish": "IEEE Journal on Selected Areas in Communications",
    "url": "https://doi.org/10.1109/jsac.2025.3648905",
    "source": "IEEE",
    "abstract": null,
    "title_zh": "客座编辑：集成传感与通信领域最新进展特刊——第二部分\n\n（解析：1. \"Guest Editorial\" 采用学界通用译法\"客座编辑\"；2. \"Special Issue\" 译为\"特刊\"更符合中文期刊命名规范；3. \"Recent Advances\" 译为\"最新进展\"既准确又符合学术表达习惯；4. 保留原文破折号\"——\"体现分册关系；5. 整体语序遵循\"主标题+副标题\"结构，符合中文期刊编排标准。）",
    "abstract_zh": "None"
  }
]