[
  {
    "date": "2026-02-02",
    "title": "Two-Stage Coded-Sliding Beam Training and QoS-Constrained Sum-Rate Maximization for SIM-Assisted Wireless Communications",
    "authors": "Qian Zhang, Ju Liu, Yao Ge, Yufei Zhao, Wali Ullah Khan, Zheng Dong, Yong Liang Guan, Chau Yuen",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.02131v1",
    "source": "arXiv",
    "abstract": "Stacked intelligent metasurfaces (SIM) provide a cost-effective and scalable solution for large-scale antenna communications.However, efficient channel state information acquisition and phase shift optimization remain critical challenges. In this paper, we develop a unified framework of low-complexity algorithms for SIM-assisted communication systems to address these issues. Specifically, we propose a generalized two-step codebook construction (TSCC) method that leverages two-dimensional angular-domain decoupling to transform planar array beamformer design into two independent one-dimensional linear array beamformer design problems, efficiently solved via the Gerchberg-Saxton algorithm and our proposed majorization-minimization-based proximal distance (PDMM) algorithm. We further develop a two-stage coded-sliding beam training (TSCSBT) method for low-overhead and high-accuracy beam training, where error-correcting codes are embedded in the first-stage training to enhance robustness against noise, and sliding sampling is subsequently performed around the matched angular samples to improve angular resolution. The proposed framework is further extended to multi-path user channels. Finally, a variable decoupling-based block successive upper bound minimization (VD-BSUM) algorithm is proposed to directly solve the QoS-constrained sum-rate maximization problem through closed-form iterative updates with substantially reduced computational complexity. Simulation results demonstrate the effectiveness of the proposed methods in achieving precise beam pattern realization, improved beam training accuracy and angular resolution, and enhanced sum-rate performance.",
    "title_zh": "SIM辅助无线通信中的双阶段编码滑动束训练与服务质量约束下的总速率最大化\n\n解析：\n1. \"Two-Stage Coded-Sliding Beam Training\" 译为\"双阶段编码滑动束训练\"：\n   - \"Two-Stage\" 对应\"双阶段\"\n   - \"Coded\" 译为\"编码\"（指采用编码技术）\n   - \"Sliding Beam\" 译为\"滑动束\"（专业术语，指动态调整的波束技术）\n   - \"Training\" 译为\"训练\"（通信领域常用术语）\n\n2. \"QoS-Constrained Sum-Rate Maximization\" 译为\"服务质量约束下的总速率最大化\"：\n   - \"QoS-Constrained\" 对应\"服务质量约束下\"\n   - \"Sum-Rate\" 译为\"总速率\"（通信领域标准译法）\n   - \"Maximization\" 译为\"最大化\"（数学优化术语）\n\n3. \"SIM-Assisted Wireless Communications\" 译为\"SIM辅助无线通信\"：\n   - 保留专业缩写\"SIM\"（国际通用术语）\n   - \"Assisted\" 译为\"辅助\"（符合中文技术表述习惯）\n\n4. 整体结构：\n   - 采用\"技术方法+应用场景\"的中文标题结构\n   - 使用\"中\"字明确技术应用于SIM辅助通信场景\n   - 专业术语保持英文缩写（如SIM）以增强国际学术交流性\n\n注：该翻译在保持专业性的同时，符合中文科技论文标题的规范：\n- 字数控制在25字以内（中文标题最佳长度）\n- 技术关键词前置（双阶段编码滑动束训练）\n- 应用场景后置（SIM辅助无线通信中）\n- 约束条件（服务质量）与优化目标（总速率最大化）并列呈现",
    "abstract_zh": "堆叠智能超表面（SIM）为大规模天线通信提供了经济高效且可扩展的解决方案。然而，高效获取信道状态信息与优化相位偏移仍面临关键挑战。本文提出了一种针对SIM辅助通信系统的低复杂度算法统一框架，以解决上述问题。具体而言，我们提出了一种广义两步码本构建方法（TSCC），通过二维角域解耦技术将平面阵列波束成形器设计问题转化为两个相互独立的线性阵列波束成形器设计问题，并借助格赫伯-萨克斯顿算法和提出的基于极大化-极小化原理的近似距离（PDMM）算法高效实现。此外，我们进一步开发了两阶段编码滑动波束训练方法（TSCSBT），在第一阶段嵌入纠错码以增强抗噪能力，随后通过匹配角样本周围的滑动采样提升角分辨率，从而实现低开销高精度的波束训练。所提框架进一步扩展至多径用户信道场景。最后，我们提出了一种基于可变解耦的块逐上界最小化算法（VD-BSUM），通过闭合形式的迭代更新直接求解QoS约束下的总速率最大化问题，显著降低计算复杂度。仿真结果表明，所提方法能够实现高精度的波束模式生成、波束训练精度与角分辨率的提升，以及总速率性能的增强。\n\n（注：翻译过程中对部分术语进行了标准化处理，如\"Gerchberg-Saxton algorithm\"译为通用译名\"格赫伯-萨克斯顿算法\"，\"majorization-minimization-based\"译为\"基于极大化-极小化原理\"等。技术细节如算法缩写（TSCC、TSCSBT、VD-BSUM）均保留英文缩写以符合学术规范，并在首次出现时标注中文全称。整体译文在保持专业性的同时，通过分句和逻辑连接词优化了中文可读性。）"
  },
  {
    "date": "2026-2-2",
    "title": "Intelligent Reflecting Surface for Satellite Communications: Applications, Challenges, and Future Perspectives",
    "authors": "Yingying Wu, Bomin Mao, Hongzhi Guo, Yijie Xun, Nei Kato",
    "publish": "IEEE Wireless Communications",
    "url": "https://doi.org/10.1109/mwc.2025.3606867",
    "source": "IEEE",
    "abstract": "Satellite communications constitute a significant part of 6G to enable ubiquitous connectivity, seamless services, and ultra-high mobility, but pose challenges by long propagation paths and open broadcast environment. Fortunately, Intelligent Reflecting Surface (IRS) can address above challenges by dynamically adjusting the phase, amplitude, and polarization of reflecting signals, thus finally change the wavefront and enable the signal coherent superposition at receivers, resulting in improved signal quality, which can be further adopted to promote the performance of the Integrated Communication, Navigation, and remote Sensing (ICNS). Inspired by these advantages, this article investigates the potential applications of IRS in future satellite constellations. We first provide a comprehensive review of satellite communication systems and IRS, along with their capabilities. By leveraging their respective advantages and specific characteristics, we further explore the applications of IRS deployment in satellites, including the Internet of Everything (IoE), deep space exploration, positioning and navigation, and secret communications. A case study of the IRS-secured satellite framework is presented to prevent air and space Eavesdroppers (Eves), further demonstrating its security advantages. Finally, we discuss the future perspectives of IRS-assisted satellite communication systems.",
    "title_zh": "智能反射面在卫星通信中的应用、挑战与未来展望",
    "abstract_zh": "卫星通信是6G技术的重要组成部分，旨在实现泛在连接、无缝服务和超高移动性，但其面临长传播路径和开放传播环境带来的挑战。所幸，智能反射面（IRS）通过动态调整反射信号的相位、幅度和极化特性，能够有效应对上述挑战：一方面改变波前形态，使接收端实现信号相干叠加，从而提升信号质量；另一方面，该技术可进一步优化综合通信、导航与遥感（ICNS）系统的性能。基于这些优势，本文探讨了智能反射面在下一代卫星星座中的潜在应用场景。通过结合卫星通信系统和智能反射面的各自优势与特性，我们重点研究了IRS部署在卫星中的四大应用方向：万物互联（IoE）、深空探测、定位导航以及保密通信。通过展示基于IRS的卫星安全框架案例——该框架可有效防范空域和太空中的窃听者（Eve），凸显了其在信息安全领域的突出优势。最后，本文展望了IRS辅助卫星通信系统的未来发展方向。\n\n（说明：翻译过程中对原文进行了适度优化，如将\"open broadcast environment\"译为\"开放传播环境\"以更符合技术语境，将\"Eavesdroppers (Eves)\"统一为\"窃听者（Eve）\"以保持术语规范。同时通过分段和标点调整，使长句更符合中文表达习惯，同时保留了原文的技术严谨性。）"
  },
  {
    "date": "2026-2-2",
    "title": "Beyond Algorithmic Proofs: Towards Implementation-Level Provable Security",
    "authors": "Jiahui Shang, Luning Zhang, Zhongxiang Zheng",
    "publish": "2025 IEEE 24th International Conference on Trust, Security and Privacy in Computing and Communications (TrustCom)",
    "url": "https://doi.org/10.1109/trustcom66490.2025.00215",
    "source": "IEEE",
    "abstract": "While traditional cryptographic research focuses on algorithm-level provable security, many real-world attacks exploit weaknesses in system implementations, such as memory mismanagement, poor entropy sources, and insecure key lifecycles. Existing approaches address these risks in isolation but lack a unified, verifiable framework for modeling implementation-layer security. In this work, we propose Implementation-Level Provable Security, a new paradigm that defines security in terms of structurally verifiable resilience against real-world attack surfaces during deployment. To demonstrate its feasibility, we present SEER (Secure and Efficient Encryption-based Erasure via Ransomware), a file destruction system that repurposes and reinforces the encryption core of Babuk ransomware. SEER incorporates key erasure, entropy validation, and execution consistency checks to ensure a well-constrained, auditable attack surface. Our evaluation shows that SEER achieves strong irrecoverability guarantees while maintaining practical performance. This work demonstrates a shift from abstract theoretical models toward practically verifiable implementation-layer security.",
    "title_zh": "超越算法证明：迈向实现层面的可证明安全性",
    "abstract_zh": "传统密码学研究主要关注算法层可证明安全性，但现实中的攻击往往利用系统实现层面的漏洞，例如内存管理不当、熵源质量不足或密钥生命周期不安全。现有方法虽能针对这些风险提出解决方案，却缺乏统一、可验证的框架来建模实现层安全。本文提出**实施层可证明安全（Implementation-Level Provable Security, ILPS）**这一新范式，将安全性定义为通过结构化可验证方式抵御部署阶段真实攻击面冲击的能力。为验证其可行性，我们提出**SEER（基于加密的擦除安全与高效勒索软件）**——一种文件销毁系统，通过重构并强化Babuk勒索软件的加密核心实现安全擦除。SEER集成密钥销毁、熵源验证和执行一致性检查，确保攻击面在严格约束和可审计范围内。实验表明，SEER在保证不可恢复性的同时仍具备实用性能。本研究标志着从抽象理论模型向可验证实现层安全方案的范式转变。\n\n（说明：翻译在保留技术严谨性的同时，对部分术语进行了本土化处理。例如：\n1. \"attack surfaces\"译为\"攻击面\"，符合密码学领域通用译法\n2. \"key erasure\"译为\"密钥销毁\"，更准确体现加密学中的密钥生命周期管理概念\n3. \"structurally verifiable\"译为\"结构化可验证\"，突出形式化验证特性\n4. 专有名词如SEER和Babuk保持英文原称，符合学术惯例）"
  },
  {
    "date": "2026-2-2",
    "title": "Latency-Aware Resource Allocation for Integrated Communications, Computation, and Sensing in Cell-Free mMIMO Systems",
    "authors": "Qihao Peng, Qu Luo, Zheng Chu, Zihuai Lin, Maged Elkashlan, Pei Xiao, George K. Karagiannidis, Christos Masouros",
    "publish": "IEEE Transactions on Wireless Communications",
    "url": "https://doi.org/10.1109/twc.2026.3657950",
    "source": "IEEE",
    "abstract": "In this paper, we investigate a cell-free massive multiple-input and multiple-output (MIMO)-enabled integration communication, computation, and sensing (ICCS) system, aiming to minimize the maximum overall latency to guarantee the stringent sensing requirements. We consider a two-tier offloading framework, where each multi-antenna terminal can optionally offload its local tasks to either multiple mobile-edge servers for distributed computation or the cloud server for centralized computation. The above offloading problem is formulated as a mixed-integer programming and non-convex problem, which can be decomposed into three sub-problems, namely, distributed offloading decision, beamforming design, and execution scheduling mechanism. First, the continuous relaxation and penalty-based techniques are applied to tackle the distributed offloading strategy. Then, the weighted minimum mean square error (WMMSE) and successive convex approximation (SCA)-based lower bound are utilized to design the integrated communication and sensing (ISAC) beamforming. Finally, the other resources can be judiciously scheduled to minimize the maximum latency. A rigorous convergence analysis and numerical results substantiate the effectiveness of our method. Furthermore, simulation results demonstrate the benefits of multi-point cooperation in cell-free massive MIMO-enabled ICCS and reveal the trade-off between the number of involved APs and the resulting latency, highlighting the inherent interplay among communication, sensing, and computation.",
    "title_zh": "面向集成通信、计算与感知的无蜂窝多用户MIMO系统的延迟感知资源分配\n\n解析：\n1. \"Latency-Aware\" 译为「延迟感知」，采用技术领域通用译法，准确传达对时延敏感的系统特性。\n2. \"Integrated Communications, Computation, and Sensing\" 处理为「集成通信、计算与感知」，通过「集成」体现多技术融合，使用「与」替代「和」更符合学术标题规范。\n3. \"Cell-Free mMIMO Systems\" 译为「无蜂窝多用户MIMO系统」，其中：\n   - \"Cell-Free\" 采用「无蜂窝」直译，准确描述无蜂窝网络架构\n   - \"mMIMO\" 译为「多用户MIMO」，既保留英文缩写又明确技术内涵\n4. 标题结构采用「面向...的...」句式，符合中文论文标题的常见范式：\n   - 面向（针对/面向）...（技术领域）\n   - 的...（核心方法）\n   - ...（应用场景）\n5. 专业术语处理：\n   - \"Resource Allocation\" 译为「资源分配」\n   - \"Cell-Free\" 译为「无蜂窝」而非「去中心化」等意译\n   - \"mMIMO\" 保留英文缩写并补充中文全称「多用户MIMO」\n\n该翻译在保持英文原意的基础上，通过：\n- 技术术语标准化（如延迟感知、多用户MIMO）\n- 学术标题结构优化（使用「面向...的...」句式）\n- 专业领域适配（保留英文缩写同时补充中文全称）\n实现了专业性与可读性的平衡，符合IEEE等国际期刊的中文标题规范。",
    "abstract_zh": "本文研究了基于无蜂窝大规模MIMO的通信、计算与感知（ICCS）集成系统，旨在通过最小化最大端到端延迟来满足严格的感知需求。我们提出一种两级卸载框架，其中每个多天线终端可自主选择将本地任务卸载至多个移动边缘服务器（分布式计算）或云端服务器（集中式计算）。该卸载问题被建模为混合整数规划与非线性优化问题，并分解为三个子问题：分布式卸载决策、集成通信与感知（ISAC）波束成形设计、以及执行调度机制。首先，通过连续松弛与惩罚机制解决分布式卸载策略；其次，采用加权最小均方误差（WMMSE）与逐次凸近似（SCA）方法构建ISAC波束成形下界；最后，通过智能资源调度优化系统性能。严格的理论收敛性分析与仿真实验验证了所提方法的有效性。进一步仿真结果表明，多节点协作在无蜂窝大规模MIMO-ICCS系统中具有显著优势，并揭示了参与接入点（AP）数量与系统延迟之间的权衡关系，突出了通信、感知与计算三者间的内在协同机制。"
  }
]