[
  {
    "date": "2025-12-25",
    "title": "Non-programmers Assessing AI-Generated Code: A Case Study of Business Users Analyzing Data",
    "authors": "Yuvraj Virk, Dongyu Liu",
    "publish": "2025 IEEE Symposium on Visual Languages and Human-Centric Computing (VL/HCC)",
    "url": "https://doi.org/10.1109/vl-hcc65237.2025.00044",
    "source": "IEEE",
    "abstract": "Non-technical end-users increasingly rely on AI code generation to perform technical tasks like data analysis. However, large language models (LLMs) remain unreliable, and it is unclear whether end-users can effectively identify model errors - especially in realistic and domain-specific scenarios. We surveyed marketing and sales professionals to assess their ability to critically evaluate LLM-generated analyses of marketing data. Participants were shown natural language explanations of the AI’s code, repeatedly informed the AI often makes mistakes, and explicitly prompted to identify them. Yet, participants frequently failed to detect critical flaws that could compromise decisionmaking, many of which required no technical knowledge to recognize. To investigate why, we reformatted AI responses into clearly delineated steps and provided alternative approaches for each decision to support critical evaluation. While these changes had a positive effect, participants often struggled to reason through the AI’s steps and alternatives. Our findings suggest that business professionals cannot reliably verify AIgenerated data analyses on their own and explore reasons why to inform future designs. As non-programmers adopt codegenerating AI for technical tasks, unreliable AI and insufficient human oversight poses risks of unsafe or low-quality decisions.",
    "title_zh": "非程序员评估AI生成代码：业务用户分析数据的案例研究",
    "abstract_zh": "非技术类终端用户越来越多地依赖人工智能代码生成来完成数据分析师等技术性任务。然而，大型语言模型（LLMs）仍不可靠，且尚不清楚终端用户是否能在真实、特定领域的情境下有效识别模型错误。我们对市场营销和销售专业人士进行了调查，以评估他们批判性评估AI生成的营销数据分析结果的能力。参与者被展示AI代码的自然语言解释，并反复被告知AI经常出错，同时被明确提示找出其中的错误。然而，参与者常常未能发现可能影响决策的关键缺陷，而这些缺陷中的许多根本无需技术知识即可识别。为探究原因，我们将AI的回应重新格式化为清晰分步的结构，并为每一步决策提供替代方案，以支持更有效的批判性评估。尽管这些改进带来了一定积极效果，参与者仍普遍难以理解AI的推理步骤及其替代方案。研究结果表明，商业专业人士无法独立可靠地验证AI生成的数据分析结果，本文也探讨了其背后的原因，以期为未来系统设计提供参考。随着非程序员越来越多地使用代码生成型AI完成技术任务，不可靠的AI与不足的人工监督共同带来了产生不安全或低质量决策的风险。"
  },
  {
    "date": "2025-12-25",
    "title": "ContractTrace: Retracing Smart Contract Versions for Security Analyses",
    "authors": "Fatou Ndiaye Mbodji, Boladji Vinny Adjibi, Moustapha Awwalou Diouf, Gervais Mendy, Kui Liu, Jacques Klein, Tegawendé F. Bissyandé",
    "publish": "2025 Cybersecurity4D (C4D)",
    "url": "https://doi.org/10.1109/c4d65382.2025.11306473",
    "source": "IEEE",
    "abstract": "Due to the inherent immutability of blockchain technology, smart contract updates require their deployment at new addresses rather than modifying existing ones, thus fragmenting version histories and creating critical blind spots for analyses. Indeed, for example, this fragmentation severely hinders security researchers’ ability to track vulnerability lifecycles across contract versions. While platforms like Etherscan provide detailed information about Ethereum smart contracts, they lack crucial functionality to trace predecessor-successor relationships within smart contract lineages, preventing systematic analysis of how vulnerabilities emerge, propagate, and potentially remain unresolved across versions.To address the challenge of tracing smart contract lineages, we adopt a Design Science Research (DSR) approach and introduce ContractTrace, an automated infrastructure that accurately identifies and links versions of smart contracts into coherent lineages. This tool enables the construction of lineageSet, an up-to-date, open-source dataset specifically designed to support security research on vulnerability, defect or any other property’s evolution patterns in smart contracts.Through a security-focused case study we demonstrate how ContractTrace reveals previously obscured vulnerability lifecycles within smart contract lineages, tracking whether critical security flaws persist or get resolved across versions. This capability is essential for understanding vulnerability propagation patterns and evaluating the effectiveness of security patches in blockchain environments. In the evaluation phase of our DSR approach, we validated our lineage detection methodology against an alternative approach using Locality-Sensitive Hashing (LSH) to cluster contract versions, confirming the security relevance and accuracy of our technique.",
    "title_zh": "ContractTrace：用于安全分析的智能合约版本回溯",
    "abstract_zh": "由于区块链技术的固有不可变性，智能合约的更新无法通过修改现有合约地址实现，而必须部署于新的地址，这导致合约版本历史被割裂，为分析工作带来了关键性的盲区。例如，这种割裂严重阻碍了安全研究人员追踪漏洞生命周期的能力，尤其是在不同合约版本之间的演变过程。尽管Etherscan等平台提供了以太坊智能合约的详细信息，但它们缺乏追踪合约谱系中前代与后代关系的关键功能，从而无法系统地分析漏洞如何产生、传播，甚至在多个版本间持续存在。\n\n为解决智能合约谱系追踪的挑战，我们采用设计科学研究（Design Science Research, DSR）方法，提出ContractTrace——一种自动化的基础设施，能够准确识别并关联智能合约的不同版本，构建连贯的合约演化谱系。该工具支持生成lineageSet，一个实时更新、开源的数据库，专门用于支持智能合约中漏洞、缺陷或其他属性演化模式的安全研究。\n\n通过一次聚焦安全性的案例研究，我们展示了ContractTrace如何揭示以往被掩盖的智能合约谱系中的漏洞生命周期，追踪关键安全缺陷是否在版本迭代中持续存在或得以修复。这一能力对于理解漏洞传播模式以及评估区块链环境中安全补丁的有效性至关重要。在DSR方法的评估阶段，我们将所提出的谱系检测方法与基于局部敏感哈希（Locality-Sensitive Hashing, LSH）的替代方案进行对比验证，结果确认了本方法在安全性相关性和准确性方面的优越性。"
  },
  {
    "date": "2025-12-25",
    "title": "Co-Advisor: Learning Programming Strategies in Context",
    "authors": "Maryam Arab, Hanning Li, Rushal Butala, Steve Oney",
    "publish": "2025 IEEE Symposium on Visual Languages and Human-Centric Computing (VL/HCC)",
    "url": "https://doi.org/10.1109/vl-hcc65237.2025.00045",
    "source": "IEEE",
    "abstract": "Programming instruction often focuses on syntax and algorithms. However, mastering programming also requires building strategic knowledge of skills such as debugging, problem solving, and program design. These critical skills are difficult to teach explicitly because they often involve tacit knowledge, context-specific understanding, and adaptive decision-making. Large Language Models (LLMs) can be effective in helping with syntactic and algorithmic questions but can fail to provide strategic knowledge. This is partly because strategic knowledge involves nuanced contexts that span code and runtime states, requires subjective judgments, and dynamically evolves based on the outcomes of users’ actions. We introduce Co-Advisor, a context-aware strategy recommendation tool that leverages LLM to evaluate problem context and monitor the programmer’s actions to provide personalized constructive feedback. Unlike prior work, Co-Advisor can dynamically align expert strategies with real-time programmer actions and code context, offering actionable, personalized strategic knowledge. In a formative evaluation with 14 programmers involved in two debugging tasks, we found that those using Co-Advisor to receive context-related feedback alongside expert strategies were significantly more successful than those without context-related feedback. They demonstrated greater engagement and had an improved learning experience, gaining insight into the reasons behind their mistakes, correcting them, and understanding the rationale behind their actions. Thus, Co-Advisor enhances conceptual understanding and strategic problem-solving.",
    "title_zh": "副导师：在情境中学习编程策略",
    "abstract_zh": "编程教学通常聚焦于语法和算法，但掌握编程还要求具备调试、问题解决和程序设计等策略性技能。这些关键能力难以通过显式教学传授，因为它们往往涉及隐性知识、情境化理解以及适应性决策。大型语言模型（LLMs）在处理语法和算法问题时表现良好，但在提供策略性知识方面却常常失效。这在一定程度上是因为策略性知识涉及跨越代码与运行时状态的复杂上下文，需要主观判断，并且会根据用户行为的结果动态演变。为此，我们提出了Co-Advisor——一种具有上下文感知能力的策略推荐工具，它利用大语言模型评估问题背景并监控程序员的操作，从而提供个性化、建设性的反馈。与以往工作不同，Co-Advisor能够将专家策略与程序员的实时操作及代码上下文动态对齐，提供可操作的、个性化的战略知识。在针对14名程序员进行的两项调试任务的形成性评估中，我们发现，使用Co-Advisor获得与上下文相关反馈并结合专家策略的参与者，其表现显著优于未获得上下文反馈的对照组。他们表现出更高的参与度，学习体验更佳，不仅深入理解了错误背后的原因，还能及时纠正错误，并领悟自身行为背后的逻辑。因此，Co-Advisor有效提升了概念理解力与战略性问题解决能力。"
  },
  {
    "date": "2025-12-25",
    "title": "ProDec: Automated Prompt Decomposition",
    "authors": "Ebtesam Al Haque, Brittany Johnson",
    "publish": "2025 IEEE Symposium on Visual Languages and Human-Centric Computing (VL/HCC)",
    "url": "https://doi.org/10.1109/vl-hcc65237.2025.00070",
    "source": "IEEE",
    "abstract": "Current AI-powered programming assistants generate large code blocks through single-shot interactions, violating established human-computer interaction principles and increasing cognitive load while reducing developer understanding and control. We present ProDec, a system that automatically decomposes complex programming prompts into structured subtasks with explicit dependencies, enabling interactive visual exploration and modification of AI reasoning steps. By transforming AIassisted programming from black-box code generation to transparent collaborative problem-solving tool, our approach aims to restore developer agency.",
    "title_zh": "ProDec：自动化提示分解",
    "abstract_zh": "当前的AI编程助手通过单次交互生成大段代码，违背了既定的人机交互原则，增加了认知负担，降低了开发者的理解力与控制力。我们提出了ProDec系统，该系统能够自动将复杂的编程任务分解为具有明确依赖关系的结构化子任务，支持对AI推理步骤进行交互式可视化探索与修改。通过将AI辅助编程从“黑箱式代码生成”转变为透明的协作式问题解决工具，我们的方法旨在重夺开发者的主导权。"
  },
  {
    "date": "2025-12-25",
    "title": "Exploring Direct Instruction and Summary-Mediated Prompting in LLM-Assisted Code Modification",
    "authors": "Ningzhi Tang, Emory Smith, Yu Huang, Collin McMillan, Toby Jia-Jun Li",
    "publish": "2025 IEEE Symposium on Visual Languages and Human-Centric Computing (VL/HCC)",
    "url": "https://doi.org/10.1109/vl-hcc65237.2025.00017",
    "source": "IEEE",
    "abstract": "This paper presents a study of using large language models (LLMs) in modifying existing code. While LLMs for generating code have been widely studied, their role in code modification remains less understood. Although “prompting” serves as the primary interface for developers to communicate intents to LLMs, constructing effective prompts for code modification introduces challenges different from generation. Prior work suggests that natural language summaries may help scaffold this process, yet such approaches have been validated primarily in narrow domains like SQL rewriting. This study investigates two prompting strategies for LLM-assisted code modification: Direct Instruction Prompting, where developers describe changes explicitly in free-form language, and SummaryMediated Prompting, where changes are made by editing the generated summaries of the code. We conducted an exploratory study with 15 developers who completed modification tasks using both techniques across multiple scenarios. Our findings suggest that developers followed an iterative workflow: understanding the code, localizing the edit, and validating outputs through execution or semantic reasoning. Each prompting strategy presented tradeoffs: direct instruction prompting was more flexible and easier to specify, while summary-mediated prompting supported comprehension, prompt scaffolding, and control. Developers’ choice of strategy was shaped by task goals and context, including urgency, maintainability, learning intent, and code familiarity. These findings highlight the need for more usable prompt interactions, including adjustable summary granularity, reliable summarycode traceability, and consistency in generated summaries.",
    "title_zh": "探索大语言模型辅助代码修改中的直接教学与摘要中介提示",
    "abstract_zh": "本文研究了大型语言模型（LLMs）在代码修改中的应用。尽管代码生成领域的LLM已得到广泛研究，但其在代码修改中的作用仍不够清晰。虽然“提示”（prompting）是开发者向LLM传达意图的主要方式，但在代码修改场景中构建有效提示所面临的挑战与代码生成有所不同。以往研究表明，自然语言摘要可能有助于引导这一过程，但此类方法主要在如SQL重写等狭窄领域中得到验证。本研究探讨了两种用于LLM辅助代码修改的提示策略：直接指令提示（Direct Instruction Prompting），即开发者以自由文本形式明确描述修改内容；以及摘要中介提示（SummaryMediated Prompting），即通过编辑代码生成的摘要来实现修改。我们对15名开发者进行了探索性研究，他们在多种场景下使用这两种技术完成修改任务。研究发现，开发者普遍采用一种迭代式工作流程：理解代码、定位修改点，并通过执行或语义推理来验证输出。每种提示策略均有其权衡：直接指令提示更具灵活性且更易于表达，而摘要中介提示则有助于理解、提示引导和控制。开发者的策略选择受任务目标和上下文因素的影响，包括紧迫性、可维护性、学习目的以及对代码的熟悉程度。这些发现凸显了对更易用的提示交互机制的需求，包括可调节的摘要粒度、可靠的摘要-代码可追溯性，以及生成摘要的一致性。"
  },
  {
    "date": "2025-12-25",
    "title": "Keyframer: A Design Probe for Exploring LLM Assistance in 2D Animation Design",
    "authors": "Tiffany Tseng, Ruijia Cheng, Andrew M. McNutt, Jeffrey Nichols",
    "publish": "2025 IEEE Symposium on Visual Languages and Human-Centric Computing (VL/HCC)",
    "url": "https://doi.org/10.1109/vl-hcc65237.2025.00014",
    "source": "IEEE",
    "abstract": "Creating 2D animations is challenging because it requires iterative refinement of movement and transitions across multiple elements within a scene. We explored the potential of LLMs to support animation design by first identifying current challenges in formative interviews with animation creators, and then developing a design probe and LLM-based animation design tool called Keyframer. From user-provided graphics and natural language prompts, Keyframer generates animation code, enables users to preview rendered animations inline, and supports direct edits for iterative design refinement. We utilized this design probe to uncover user prompting styles for describing animation in natural language and observe user strategies for iterating on animations in an exploratory user study with 13 novices and experts in animation design and programming. Through this study, we contribute a categorization of prompting styles users employed for specifying animation goals, along with design insights on supporting iterative refinement of animations through the combination of direct editing and natural language interfaces.",
    "title_zh": "Keyframer：一种用于探索大语言模型在二维动画设计中辅助作用的设计探针",
    "abstract_zh": "制作2D动画具有挑战性，因为需要对场景中多个元素的运动和过渡效果进行反复调整与优化。为了探索大型语言模型（LLM）在动画设计中的潜力，我们首先通过与动画创作者进行形成性访谈，识别了当前面临的主要挑战；随后开发了一种设计探针，并构建了一个基于LLM的动画设计工具——Keyframer。该工具可根据用户提供的图形素材和自然语言提示，自动生成动画代码，支持用户在线预览渲染后的动画效果，并允许直接编辑以实现迭代式设计优化。我们利用这一设计探针，在一项包含13名初学者和专家的探索性用户研究中，揭示了用户在用自然语言描述动画时所采用的不同提示风格，以及他们在迭代优化动画过程中的实际策略。本研究贡献了对用户用于表达动画目标的提示风格的分类体系，同时提出了结合直接编辑与自然语言交互界面来支持动画迭代优化的设计洞见。"
  },
  {
    "date": "2025-12-25",
    "title": "Bringing Probabilistic Reasoning to the IDE",
    "authors": "Leo St. Amour, Eli Tilevich",
    "publish": "2025 IEEE Symposium on Visual Languages and Human-Centric Computing (VL/HCC)",
    "url": "https://doi.org/10.1109/vl-hcc65237.2025.00048",
    "source": "IEEE",
    "abstract": "Exceptional behavior can be harmful to software quality and robustness. Like most modern programming languages, Java offers built-in mechanisms for expressing and handling exceptions. However, despite their languageintegrated design, exception handlers are easy to misuse. Researchers have identified exception-handling anti-patternsrecurring poor coding practices that threaten software quality. One of the most prevalent exception-handling anti-patterns-over-catching-occurs when a handler catches overly broad exception types, potentially obscuring the root cause of a failure. Integrated development environments (IDEs) play a critical role in helping developers identify and address software quality issues. Yet, existing tools can produce an overwhelming number of results, contributing to cognitive overload. To address this problem, we incorporate probabilistic reasoning into IDE-based exception-handling analysis. Exception Shipping & Handling (ESH), our prototype implementation, allows the IDE to present prioritized instances of the over-catch anti-patterns based on their likelihood of being problematic. We evaluate ESH through a user study focused on its usability for helping developers assess over-catching handlers. Our results show that participants found ESH intuitive and provide useful insights into how to integrate probabilistic reasoning into an IDE. Specifically, our study highlights the need for transparency and contextualized UI elements.",
    "title_zh": "将概率推理引入集成开发环境",
    "abstract_zh": "异常行为可能对软件的质量和健壮性造成损害。与大多数现代编程语言一样，Java 提供了内置机制来表达和处理异常。然而，尽管这些异常处理机制在语言层面已集成，开发者仍容易误用。研究人员已识别出一系列异常处理反模式——即反复出现的不良编码实践，这些实践会威胁软件质量。其中最普遍的异常处理反模式之一是“过度捕获”（over-catching），即异常处理器捕获过于宽泛的异常类型，从而可能掩盖故障的根本原因。集成开发环境（IDE）在帮助开发者识别和解决软件质量问题方面发挥着关键作用。然而，现有的工具往往产生大量结果，导致认知过载。为解决这一问题，我们将在基于 IDE 的异常处理分析中引入概率推理。我们开发的原型系统 Exception Shipping & Handling（ESH）能够根据异常被判定为有问题的可能性，优先展示“过度捕获”反模式的实例。我们通过一项用户研究评估了 ESH 在帮助开发者判断过度捕获异常处理器方面的可用性。研究结果表明，参与者认为 ESH 直观易用，并提供了关于如何在 IDE 中整合概率推理的宝贵见解。具体而言，我们的研究突显了透明度以及上下文化用户界面元素的重要性。"
  },
  {
    "date": "2025-12-25",
    "title": "Towards Secure BPF Kernel Extension with Hardware-enhanced Memory Isolation",
    "authors": "Lijian Huang, Hongyi Lu, Shuai Wang, Fengwei Zhang",
    "publish": "IEEE Transactions on Dependable and Secure Computing",
    "url": "https://doi.org/10.1109/tdsc.2025.3646179",
    "source": "IEEE",
    "abstract": "The Linux kernel extensively uses the Berkeley Packet Filter (BPF) to allow user-written BPF applications to execute in the kernel space. The BPF employs a verifier to check the security of user-supplied BPF code statically. Recent attacks show that BPF programs can evade security checks and gain unauthorized access to kernel memory, indicating that the verification process is not flawless. In this paper, we present MOAT, a novel hardware-assisted, cross-platform isolation framework designed to protect the kernel from malicious BPF programs. MOAT introduces a two-layer memory isolation scheme that leverages hardware features such as Intel MPK and Arm Stage-2 translation to enforce isolation. Our design overcomes several key challenges, including the limited scalability of available hardware isolation mechanisms and the risk of helper function abuse. We implement MOAT for Intel x86 and Arm on Linux (ver. 6.1.38), and our evaluation shows that MOAT delivers low-cost isolation of BPF programs under mainstream use cases, such as isolating a BPF packet filter with only 3% throughput loss.",
    "title_zh": "基于硬件增强内存隔离的可信BPF内核扩展",
    "abstract_zh": "Linux内核广泛使用伯克利数据包过滤器（BPF），以允许用户编写的BPF程序在内核空间中执行。BPF采用验证器对用户提供的BPF代码进行静态安全检查。然而，近期的攻击表明，BPF程序能够绕过安全检查，从而获得对内核内存的未授权访问，这说明当前的验证机制并不完善。本文提出了一种名为MOAT的新颖硬件辅助跨平台隔离框架，旨在保护内核免受恶意BPF程序的侵害。MOAT引入了一种两层内存隔离方案，利用Intel MPK和Arm Stage-2转换等硬件特性来强制实施隔离。我们的设计克服了多个关键挑战，包括现有硬件隔离机制的可扩展性有限以及辅助函数滥用的风险。我们在Linux（版本6.1.38）上实现了针对Intel x86和Arm架构的MOAT，并通过评估表明，在主流应用场景下，MOAT能够以极低的成本实现对BPF程序的有效隔离，例如在隔离BPF数据包过滤器时仅造成3%的吞吐量损失。"
  },
  {
    "date": "2025-12-25",
    "title": "Towards Trustworthy AI-Assisted Software Development",
    "authors": "Ebtesam Al Haque",
    "publish": "2025 IEEE Symposium on Visual Languages and Human-Centric Computing (VL/HCC)",
    "url": "https://doi.org/10.1109/vl-hcc65237.2025.00062",
    "source": "IEEE",
    "abstract": "AI assistants have become ubiquitous in software development, yet there are several challenges that remain to be addressed, undermining trust in these tools, thereby hindering effective human-AI collaboration. Using the PICSE framework, I identify areas of concern and propose addressing them through automated prompt decomposition to improve interaction paradigms and dynamic benchmarking to systematically evaluate AI-generated code reliability.",
    "title_zh": "值得信赖的AI辅助软件开发",
    "abstract_zh": "AI助手在软件开发中已变得无处不在，但仍有若干挑战亟待解决，这些挑战削弱了人们对这些工具的信任，从而阻碍了人与AI的有效协作。借助PICSE框架，我识别出相关关切领域，并提出通过自动化提示分解来改进交互范式，以及通过动态基准测试来系统评估AI生成代码的可靠性，以应对这些问题。"
  },
  {
    "date": "2025-12-25",
    "title": "Towards Practical Software Discrimination Testing",
    "authors": "Sadia Afrin Mim",
    "publish": "2025 IEEE Symposium on Visual Languages and Human-Centric Computing (VL/HCC)",
    "url": "https://doi.org/10.1109/vl-hcc65237.2025.00061",
    "source": "IEEE",
    "abstract": "Technological advancements over the years have led to increasingly complex software systems. The recent surge in artificial intelligence (AI) has, while reducing human effort, further contributed to this complexity. Among the growing concerns in this domain are the ethical implications of developing and using such systems. Regardless of whether a system explicitly incorporates AI, underlying software infrastructures have demonstrated instances of discriminatory behavior, resulting in undesired outcomes. To address this challenge, my research focuses on discrimination testing as a means to ensure equitable behavior in software systems. As part of this effort, I plan to build on insights from my earlier work, which involved compiling a list of existing tools and user studies on their effectiveness. My goal is to design a more explainable and generalizable discrimination testing tool that can be applied across various systems.",
    "title_zh": "面向实用的软件歧视测试",
    "abstract_zh": "多年来，技术的进步导致软件系统日益复杂。近年来人工智能（AI）的迅猛发展，在减少人类工作量的同时，也进一步加剧了这种复杂性。在这一领域中，人们日益关注的问题包括开发和使用这些系统所带来的伦理影响。无论一个系统是否明确包含人工智能，其底层的软件基础设施都曾表现出歧视性行为，导致不良后果。为应对这一挑战，我的研究聚焦于歧视性测试，旨在确保软件系统的行为具有公平性。作为这项工作的组成部分，我计划基于此前的研究成果——即整理现有工具并开展用户研究以评估其有效性——进一步推进。我的目标是设计一种更具可解释性和普适性的歧视性测试工具，使其能够广泛应用于各类系统之中。"
  },
  {
    "date": "2025-12-25",
    "title": "Lowering the Barriers to Designing and Creating Electronics-Based Tangibles for Learning Programming",
    "authors": "David Wong-Aitken",
    "publish": "2025 IEEE Symposium on Visual Languages and Human-Centric Computing (VL/HCC)",
    "url": "https://doi.org/10.1109/vl-hcc65237.2025.00056",
    "source": "IEEE",
    "abstract": "Tangible interfaces are a powerful medium for learning, yet their creation requires technical expertise in coding and electronics. My first research addressed this with TangiBooks, a system using sensor-augmented paper to simplify learning programming concepts. My subsequent research tried to lower the barrier to authoring tangible lessons using modular hardware and a web-based lesson editor, revealing a strong user demand for more flexible and capable tangible authoring tools, especially for creating novel interactions. This insight motivates my current research: investigate the tangible creation made radically simple by leveraging the opportunities that naturallanguage programming offers, especially for general audiences. Through an electronics toolkit with a natural language interface, users will be able to program interactive objects by describing their desired behavior effortlessly and learn from the generated code. The findings will contribute to understanding key HCI issues in lowering the barrier to tangibles for large audiences and let them create interactive experiences, free from technical constraints.",
    "title_zh": "降低设计与制作基于电子技术的实体教具以学习编程的门槛",
    "abstract_zh": "有形界面是一种强大的学习媒介，但其创建需要具备编程和电子技术方面的专业知识。我的第一项研究通过TangiBooks系统解决了这一问题，该系统利用传感器增强的纸张，简化了编程概念的学习过程。随后的研究尝试通过模块化硬件和基于网络的课程编辑器降低有形课程创作的门槛，结果发现用户对更灵活、功能更强的有形创作工具存在强烈需求，尤其是用于创造新颖交互方式的工具。这一洞察激励了我当前的研究：探索如何借助自然语言编程带来的机遇，使有形创作变得前所未有的简单，尤其面向普通大众。通过一款配备自然语言接口的电子工具包，用户将能够通过轻松描述期望的行为来编程互动对象，并从生成的代码中学习。研究成果将有助于理解在降低大众使用有形界面门槛方面涉及的关键人机交互（HCI）问题，使更多人能够摆脱技术限制，自由创造互动体验。"
  },
  {
    "date": "2025-12-25",
    "title": "Multiclass Prediction of Bug Resolution Time Using Context-Aware Machine Learning Models",
    "authors": "Maritza Vaca, Ricardo Flores-Moyano, Maria Baldeon-Calisto",
    "publish": "2025 IEEE Ninth Ecuador Technical Chapters Meeting (ETCM)",
    "url": "https://doi.org/10.1109/etcm67548.2025.11304484",
    "source": "IEEE",
    "abstract": "Accurately predicting bug resolution time is a persistent challenge in software development and is often complicated by subjective factors and noisy data. This work proposes a robust machine learning pipeline that classifies bug resolution time into four ordinal categories (Immediate, Fast, Normal, and Long) by leveraging project metadata from large-scale repositories, such as GitHub and Jira. The methodology includes comprehensive exploratory data analysis, statistical outlier removal, and advanced feature engineering to derive contextual variables that encapsulate historical projects and component-level behavior. Three machine learning classifiers (Random Forest, XGBoost, and MLPClassifier) were evaluated under various data balancing strategies. While tree-based models showed signs of overfitting, the MLP Classifier achieved superior generalization when enhanced with engineered features, which was validated through cross-validated learning curves and hyperparameter optimization. Our findings underscore the importance of contextual feature design and advance state-of-the-art bug resolution modeling by integrating multiclass classification, temporal context, and model interpretability.",
    "title_zh": "基于上下文感知机器学习模型的多类别缺陷修复时间预测",
    "abstract_zh": "准确预测软件缺陷的修复时间是软件开发中长期存在的挑战，常因主观因素和噪声数据而变得更加复杂。本文提出了一种稳健的机器学习流程，通过利用大规模代码仓库（如GitHub和Jira）中的项目元数据，将缺陷修复时间划分为四个有序类别（即时、快速、正常和长时间），实现精准分类。该方法包括全面的探索性数据分析、统计异常值剔除以及先进的特征工程，以提取能够反映历史项目特征和组件级行为的上下文变量。我们评估了三种机器学习分类器（随机森林、XGBoost和MLP分类器）在不同数据平衡策略下的表现。尽管基于树的模型表现出一定的过拟合迹象，但经过特征工程增强后的MLP分类器在交叉验证的学习曲线和超参数优化验证下展现出更优的泛化能力。研究结果强调了上下文特征设计的重要性，并通过引入多分类、时间上下文信息与模型可解释性，推动了当前缺陷修复时间建模技术的发展。"
  },
  {
    "date": "2025-12-25",
    "title": "FPGA-Based RISC-V SoC with Intra-Frame H.264 Encoder",
    "authors": "Minh-Phat Le Tang, Anh-Khoi Nguyen, Phuoc-Tai Dao, Hoai-Nhan Nguyen, Thanh-Khiet Cao, Hieu-Truong Ngo",
    "publish": "2025 6th International Conference on Communications, Information, Electronic and Energy Systems (CIEES)",
    "url": "https://doi.org/10.1109/ciees66347.2025.11300136",
    "source": "IEEE",
    "abstract": "This study presents the design and implementation of a System-on-Chip (SoC) on the Xilinx Virtex-7 VC707 field-programmable gate array platform. The system integrates a custom 32-bit RISC-V processor with an H.264 intra-frame video encoder, forming a tightly coupled architecture for efficient and scalable embedded video processing. The processor adopts a five-stage pipeline with mechanisms for handling data and control hazards and communicates with the encoder through an AXI-Lite interface. Video data in YUV 4:2:0 format is stored in external memory and transferred using a direct memory access unit to maintain continuous throughput. Operating with separate clock domains for the processor and encoder, the system ensures synchronized performance. Experimental results show correct RISC-V instruction execution and standard-compliant H.264 bitstream generation. The combination achieves a peak signal-to-noise ratio (PSNR) above 35 decibels at full high-definition resolution and 30 frames per second, confirming the effectiveness of integrating RISC-V with H.264 for high-quality, real-time video compression.",
    "title_zh": "基于FPGA的RISC-V SoC集成帧内H.264编码器",
    "abstract_zh": "本研究介绍了在Xilinx Virtex-7 VC707现场可编程门阵列平台上设计与实现的片上系统（SoC）。该系统将自定义的32位RISC-V处理器与H.264帧内视频编码器集成，形成一种紧密耦合的架构，以实现高效且可扩展的嵌入式视频处理。处理器采用五级流水线结构，并具备处理数据和控制冒险的机制，通过AXI-Lite接口与编码器通信。以YUV 4:2:0格式存储的视频数据置于外部存储器中，并通过直接内存访问（DMA）单元进行传输，以保证持续的数据吞吐量。处理器与编码器分别运行在独立的时钟域下，系统确保了性能的同步。实验结果表明，RISC-V指令执行正确，生成的H.264码流符合标准规范。该方案在全高清分辨率及每秒30帧的条件下，实现了超过35分贝的峰值信噪比，验证了将RISC-V与H.264相结合在高质量、实时视频压缩中的有效性。"
  },
  {
    "date": "2025-12-25",
    "title": "Automated Cross-Level Verification for Heterogeneous Systems Using Attribute Recursive Hypergraph and Fault-Tolerant Bus Resolver",
    "authors": "Keli Long, Fangfa Fu, Defu Hu, Liangquan Qiao, Jinghan Zhou, Jinxiang Wang",
    "publish": "IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems",
    "url": "https://doi.org/10.1109/tcad.2025.3648654",
    "source": "IEEE",
    "abstract": "In the post-Moore era, heterogeneous integrated systems—such as chiplet-based designs—exhibit increasingly complex functional interface interconnections, demanding scalable and accurate verification methods. Traditional manual approaches are time-consuming and error-prone, while mainstream EDA tools lack standardized cross-level models and comprehensive multi-level rule checking. To address these limitations, we propose an automated verification mechanism based on an Attribute Recursive Hypergraph (ARH). The method constructs a five-layer hierarchical mapping network (component → interface → signal cluster → signal → pad) to represent architecture-to-schematic relationships. Verification proceeds in two stages. First, a Fault-Tolerant Bus Resolver (FT-Bus Resolver) applies matrix operations to extract interface structures from pad-netlists and generates a multi-level hypergraph. These structures are compared with system architecture for consistency. Second, a hierarchical rule base, executed by a Rule Executor, validates electrical compatibility and bus-topology constraints across abstraction levels. The implementation integrates a reusable component model library, recursive hypergraph representations, and a rule execution framework, which bridges semantic gaps and supports complex constraint checking. Experiments demonstrate full coverage and 100% correctness for 54 interface-level rules, compared with only one rule supported by commercial EDA tools. Across 7,350 connections and 6,500 injected errors, the framework eliminates all false positives, reduces missed errors by 63%, achieves 1,125×/1,034× speedups for consistency and rule checking, and exhibits near-linear memory growth for scalable deployment. Together, these results demonstrate that the proposed mechanism offers a scalable, robust, and high-coverage solution for cross-level verification in emerging heterogeneous and chiplet-based systems.",
    "title_zh": "基于属性递归超图与容错总线解析器的异构系统自动化跨层级验证",
    "abstract_zh": "在后摩尔时代，异构集成系统（如基于小芯片的设计）展现出日益复杂的功能接口互联，对可扩展且精确的验证方法提出了更高要求。传统的手动验证方式耗时且易出错，而主流EDA工具则缺乏标准化的跨层级模型以及全面的多层级规则检查能力。为解决上述局限性，本文提出一种基于属性递归超图（Attribute Recursive Hypergraph, ARH）的自动化验证机制。该方法构建了一个五层分层映射网络（组件 → 接口 → 信号簇 → 信号 → 引脚），以表征从架构到原理图的映射关系。验证过程分为两个阶段：首先，容错总线解析器（Fault-Tolerant Bus Resolver, FT-Bus Resolver）通过矩阵运算从引脚网表中提取接口结构，并生成多层级超图；随后将这些结构与系统架构进行一致性比对。其次，由规则执行器（Rule Executor）驱动的分层规则库，在不同抽象层次上验证电气兼容性及总线拓扑约束。该实现集成了可复用的组件模型库、递归超图表示以及规则执行框架，有效弥合了语义鸿沟，支持复杂约束的高效检查。实验结果表明，本方法对54条接口级规则实现了全覆盖和100%正确率，而商用EDA工具仅能支持其中1条规则。在7,350个连接和6,500个注入错误的测试场景下，该框架成功消除所有误报，使漏检错误减少63%，在一致性检查和规则检查方面分别实现1,125倍和1,034倍的加速，且内存增长接近线性，具备良好的可扩展性。综上，所提出的验证机制为新兴的异构化与小芯片系统提供了可扩展、鲁棒性强且高覆盖率的跨层级验证解决方案。"
  },
  {
    "date": "2025-12-25",
    "title": "Enhancing Issue Labeling in Open-source Projects",
    "authors": "Amir Hossain Raj, Sadia Afrin Mim, Fairuz Nawer Meem",
    "publish": "2025 IEEE Symposium on Visual Languages and Human-Centric Computing (VL/HCC)",
    "url": "https://doi.org/10.1109/vl-hcc65237.2025.00066",
    "source": "IEEE",
    "abstract": "GitHub serves as the primary platform for software maintenance within the open-source community. Developers frequently report issues, ranging from bug reports to feature requests, on GitHub. The presence of well-maintained labels on these issues significantly enhances the problem-solving process by providing immediate context and facilitating the assignment of appropriate personnel, thereby expediting development. However, a substantial number of open-source repositories on GitHub lack consistent and comprehensive issue labeling. This paper addresses this challenge by proposing a classification framework for GitHub issues using ML, DNN & Transformer models. We conducted an extensive analysis of prominent GitHub opensource repositories and classified issues into common categories (e.g.,Documentation, Bug). Our empirical study demonstrates that DNN models consistently outperform ML & Transformer models in this classification task, achieving an accuracy of up to 83.75%. This work contributes to improving the efficiency of open-source software development by automating a crucial aspect of issue management.",
    "title_zh": "提升开源项目中的问题标注",
    "abstract_zh": "GitHub 是开源社区中软件维护的主要平台。开发者经常在 GitHub 上报告各类问题，从缺陷报告到功能请求不一而足。问题上若配有维护良好、清晰明确的标签，将显著提升问题解决效率，为快速提供上下文信息并合理分配责任人创造条件，从而加快开发进程。然而，大量 GitHub 开源仓库在问题标签的使用上缺乏一致性和完整性。本文针对这一挑战，提出一种基于机器学习（ML）、深度神经网络（DNN）与 Transformer 模型的 GitHub 问题分类框架。我们对多个知名 GitHub 开源项目进行了广泛分析，并将问题划分为常见类别（如“文档”、“缺陷”等）。实证研究表明，DNN 模型在此分类任务中表现优于 ML 与 Transformer 模型，最高准确率可达 83.75%。本研究通过自动化关键的问题管理环节，有助于提升开源软件开发的整体效率。"
  },
  {
    "date": "2025-12-25",
    "title": "Risk-Based Security Hardening in IoT Systems Using OWASP and Cyberattack Simulations",
    "authors": "Aarón Echeverría López, Mercedes Amor Pinilla, Henry Ramiro Carvajal Mora",
    "publish": "2025 IEEE Ninth Ecuador Technical Chapters Meeting (ETCM)",
    "url": "https://doi.org/10.1109/etcm67548.2025.11304523",
    "source": "IEEE",
    "abstract": "The Internet of Things (IoT) is a transformative technology, yet its adoption remains hindered by persistent security vulnerabilities. This paper presents a threat modeling framework to reduce the attack surface associated with the OWASP IoT Top 10. To validate the approach, we developed a controlled experimental environment using real IoT devices (Arduino Mega 2560 and Raspberry Pi 3B+), identifying key threats such as denial-of-service, brute force, and ARP poisoning. Security measures-including encrypted protocols (e.g., MQTT over TLS, HTTPS), non-standard ports, and access control rules-were implemented. A comparative risk assessment was conducted between a baseline system with default settings and a hardened system applying the proposed mitigations. Results show a substantial risk reduction: OWASP-related scores dropped from 10.2 to 2.4, and cyberattack risks from 16.0 to 2.0, shifting the system from critical to low-risk. This study provides a replicable methodology for IoT risk analysis, demonstrates the effectiveness of lightweight countermeasures, and underscores the importance of integrating security early in the design phase.",
    "title_zh": "基于风险的物联网系统安全强化：利用OWASP与网络攻击模拟",
    "abstract_zh": "物联网（IoT）是一项具有变革性意义的技术，但其广泛应用仍受到持续存在的安全漏洞的制约。本文提出了一种威胁建模框架，旨在降低与OWASP物联网十大安全风险相关的攻击面。为验证该方法的有效性，我们搭建了一个基于真实物联网设备（Arduino Mega 2560和Raspberry Pi 3B+）的受控实验环境，识别出拒绝服务、暴力破解和ARP欺骗等关键威胁。随后，实施了包括加密协议（如MQTT over TLS、HTTPS）、非标准端口以及访问控制规则在内的多项安全措施。通过对比基准系统（默认配置）与采用所提缓解措施的加固系统之间的风险评估，结果表明：OWASP相关评分从10.2降至2.4，网络攻击风险从16.0降至2.0，系统风险等级由“高危”转变为“低危”。本研究提供了一种可复现的物联网风险分析方法，验证了轻量级防护措施的有效性，并强调了在设计初期即集成安全机制的重要性。"
  },
  {
    "date": "2025-12-25",
    "title": "DevTales: A Tool for Providing Narrative Code Histories into Developer Workflows",
    "authors": "John Allen, Somin Park, Caitlin Kelleher",
    "publish": "2025 IEEE Symposium on Visual Languages and Human-Centric Computing (VL/HCC)",
    "url": "https://doi.org/10.1109/vl-hcc65237.2025.00013",
    "source": "IEEE",
    "abstract": "Understanding unfamiliar code often requires insight into the original developer’s intentions, design rationale, and on-the-fly problem-solving strategies. Traditional version-control systems capture only coarse commits, leaving web foraging and developer notes disconnected. We present DevTales, a VSCode extension that integrates fine-grained subgoal labels, captured web-foraging activity, and LLM-generated narrative summaries directly with code in the IDE. We evaluated DevTales in three mixed-methods user studies spanning debugging, understanding rationale, and code reuse. Results show that subgoal labels and “See in Code” links enable rapid top-down navigation and code localization, while embedded web resources clarify unfamiliar artifacts. Narrative summaries proved valuable for answering deep “why” questions by explicitly linking causal relationships among history items, but were avoided during quick sensemaking contexts due to their verbosity. We discuss design implications for history-aware code search, adaptive narrative summarization, and inference transparency in LLM-generated stories.",
    "title_zh": "DevTales：一种将叙事性代码历史融入开发者工作流程的工具",
    "abstract_zh": "理解陌生代码通常需要洞察原始开发者的意图、设计思路以及即时的问题解决策略。传统的版本控制系统仅记录粗粒度的提交信息，导致网络搜索活动与开发者笔记之间缺乏关联。我们提出了 DevTales——一款集成于 VSCode 的扩展工具，将细粒度的子目标标签、捕获的网络搜索行为以及由大语言模型生成的叙事摘要直接嵌入到 IDE 中的代码里。我们在三个混合方法的用户研究中评估了 DevTales，涵盖调试、理解设计动机和代码复用等场景。结果表明，子目标标签和“在代码中查看”链接能够实现快速的自上而下的导航与代码定位，而嵌入的网络资源有助于澄清不熟悉的代码元素。叙事摘要在回答深层次的“为什么”问题时尤为有价值，因为它能明确揭示历史事件之间的因果关系；但在需要快速理解的场景中，由于其内容冗长，用户往往选择跳过。本文还讨论了面向历史感知的代码搜索、自适应叙事摘要生成以及大语言模型生成故事中的推理透明性等方面的设计启示。"
  },
  {
    "date": "2025-12-25",
    "title": "Cracking CodeWhisperer: Analyzing Developers’ Interactions and Patterns During Programming Tasks",
    "authors": "Jeena Javahar, Tanya Budhrani, Manaal Basha, R. B. Cleidson de Souza, Ivan Beschastnikh, Gema Rodríguez-Pérez",
    "publish": "2025 IEEE Symposium on Visual Languages and Human-Centric Computing (VL/HCC)",
    "url": "https://doi.org/10.1109/vl-hcc65237.2025.00051",
    "source": "IEEE",
    "abstract": "The use of AI code-generation tools is becoming increasingly common, making it important to understand how software developers are adopting these tools. In this study, we investigate how developers engage with Amazon’s CodeWhisperer, an LLM-based code-generation tool. We conducted two user studies with two groups of 10 participants each, interacting with CodeWhisperer - the first to understand which interactions were critical to capture and the second to collect low-level interaction data using a custom telemetry plugin. Our mixed-methods analysis identified four behavioral patterns: 1) incremental code refinement, 2) explicit instruction using natural language comments, 3) baseline structuring with model suggestions, and 4) integrative use with external sources. We provide a comprehensive analysis of these patterns.",
    "title_zh": "破解 CodeWhisperer：分析开发者在编程任务中的交互与模式",
    "abstract_zh": "AI代码生成工具的使用正变得越来越普遍，因此理解软件开发人员如何采用这些工具显得尤为重要。在本研究中，我们探讨了开发者如何使用亚马逊推出的基于大语言模型（LLM）的代码生成工具——CodeWhisperer。我们开展了两轮用户研究，每轮研究包含10名参与者，分别与CodeWhisperer进行交互：第一轮旨在识别关键交互行为，第二轮则通过自定义遥测插件收集低层级的交互数据。通过混合方法分析，我们识别出四种行为模式：1）增量式代码优化；2）通过自然语言注释明确下达指令；3）以模型建议为基础进行基础结构搭建；4）结合外部资源进行整合使用。本文对这些行为模式进行了全面深入的分析。"
  },
  {
    "date": "2025-12-25",
    "title": "An Overview of GenAI 2.0 Partnering With Digital Twin to Enhance Decision Making",
    "authors": "Neel Dholakia, Madhu Shukla, Surbhi Bhatia Khan, Rajendrasinh Jadeja",
    "publish": "IEEE Communications Standards Magazine",
    "url": "https://doi.org/10.1109/mcomstd.2025.3644899",
    "source": "IEEE",
    "abstract": "Generative AI (GenAI) has moved on to a “2.0” level, where capability comes not only from better generators but from integrating generators with retrieval, tool use, and orchestration. The approach taken in this overview is a systems perspective, where a brief typology of families and of models is codified, along with a distillation of design patterns on how bare generators can be refined into reliable systems, namely containerized RAG, tool schemas, event-driven context, and conservative agent systems. In this position, we propose a practice-driven assessment perspective integrating task quality, along with Attribution, Robustness with respect to distribution shift & adversarial prompts, safety & governance (Privacy, IP, Provenance), and End-to-End Efficiency in Latency, Cost, & Energy. Text/Code, Vision-Language, Speech/Audio, Networks, Public Services, & Critical Infrastructure applications provide examples of these trends extending from benchmarking. The issues it brings to light include controllability and verifiability for long-range, multiple tool agents, scalable contamination aware assessment, traceability preserving data and model stewardship, as well as efficiency for resource-constrained and edge scenarios, while pointing towards near-term areas such as tool interface interoperability, traceability aware retrieval, lifecycle visibility, reporting card interoperability, and reliability assessment. Focusing on operational criteria, the research has contributed to creating a impact for making GenAI 2.0 Trustable AI. The blueprint can be utilized as a guide for future research.",
    "title_zh": "生成式人工智能2.0与数字孪生融合以提升决策能力的概览",
    "abstract_zh": "生成式人工智能（GenAI）已迈入“2.0”阶段，其能力不仅源于更优的生成模型，更来自于将生成器与检索、工具调用及系统编排相融合。本文从系统视角出发，对各类模型家族进行了简要分类，并提炼出将基础生成器转化为可靠系统的若干设计模式，包括容器化RAG（检索增强生成）、工具Schema、事件驱动上下文以及保守型智能体系统。在此框架下，我们提出一种以实践为导向的评估视角，涵盖任务质量，以及可归因性、在分布偏移与对抗性提示下的鲁棒性、安全性与治理（隐私、知识产权、来源可追溯性），以及端到端的效率（延迟、成本与能耗）。文本/代码、视觉-语言、语音/音频、网络系统、公共服务及关键基础设施等应用场景，展示了这些趋势在基准测试中的延伸。该研究揭示了诸多挑战：长程多工具智能体的可控性与可验证性、可扩展的污染感知评估、数据与模型管理的责任追溯、资源受限及边缘场景下的效率优化；同时指出了近期亟待突破的方向，如工具接口互操作性、可追溯性感知的检索、生命周期可视性、报告卡互操作性以及可靠性评估。聚焦于实际运行标准，本研究为实现GenAI 2.0阶段的可信人工智能做出了重要贡献。该蓝图可作为未来研究的重要指南。"
  },
  {
    "date": "2025-12-25",
    "title": "Designing Spatial Architectures for Sparse Attention: STAR Accelerator via Cross-Stage Tiling_supp1-3648055.pdf",
    "authors": "Yang Hu",
    "publish": "N/A",
    "url": "https://doi.org/10.1109/tc.2025.3648055/mm1",
    "source": "IEEE",
    "abstract": "Large language models (LLMs) rely on self–attention for contextual understanding, demanding high-throughput inference and large–scale token parallelism (LTPP). Existing dynamic sparsity accelerators falter under LTPP scenarios due to stage-isolated optimizations. Revisiting the end-to-end sparsity acceleration flow, we identify an overlooked opportunity: crossstage coordination can substantially reduce redundant computation and memory access. We propose STAR, a cross-stage computetation and memory–efficient algorithm–hardware co-design tailored for Transformer inference under LTPP. STAR introduces a leading-zero-based sparsity prediction using log-domain add only operations to minimize prediction overhead. It further employs distributed sorting and a sorted updating FlashAttention mechanism, guided by a coordinated tiling strategy that enables fine-grained stage interaction for improved memory efficiency and latency. These optimizations are supported by a dedicated STAR accelerator architecture, achieving up to 9.2× speedup and 71.2× energy efficiency over A100, and surpassing SOTA accelerators by up to 16.1× energy and 27.1× area efficiency gains. Further, we deploy STAR onto a multi-core spatial architecture, optimizing dataflow and execution orchestration for ultra-long sequence processing. Architectural evaluation shows that, compared to the baseline design, Spatial-STAR achieves a 20.1× throughput improvement.",
    "title_zh": "稀疏注意力的空间架构设计：通过跨阶段分块实现的STAR加速器_supp1-3648055.pdf",
    "abstract_zh": "大规模语言模型（LLMs）依赖自注意力机制实现上下文理解，这要求高吞吐量推理与大规模标记并行（LTPP）。现有动态稀疏性加速器在LTPP场景下表现不佳，主要受限于各计算阶段间的孤立优化。重新审视端到端的稀疏性加速流程，我们发现一个被忽视的关键机会：跨阶段协同能够显著减少冗余计算与内存访问。为此，我们提出STAR——一种面向Transformer推理在LTPP场景下的跨阶段计算与内存高效算法-硬件协同设计。STAR采用基于前导零的稀疏性预测方法，仅通过log域加法操作实现，极大降低了预测开销；同时引入分布式排序与有序更新的FlashAttention机制，并结合协调式分块策略，支持细粒度阶段间交互，从而提升内存效率与降低延迟。上述优化由专用的STAR加速器架构支撑，相较A100实现最高达9.2倍的加速比和71.2倍的能量效率提升，且在能效方面超越当前最优加速器高达16.1倍，在面积效率上更提升27.1倍。此外，我们将STAR部署于多核空间架构中，优化数据流与执行调度，以支持超长序列处理。架构评估表明，相较于基线设计，Spatial-STAR实现了20.1倍的吞吐量提升。"
  },
  {
    "date": "2025-12-25",
    "title": "TraceMate: Collaborating with AI in Test-Driven Programming",
    "authors": "Jinmiao Wu, Thomas Selig, Erick Purwanto",
    "publish": "2025 IEEE Symposium on Visual Languages and Human-Centric Computing (VL/HCC)",
    "url": "https://doi.org/10.1109/vl-hcc65237.2025.00035",
    "source": "IEEE",
    "abstract": "Large programming courses often use test-driven autograding systems (e.g., CodeRunner) for instant feedback, but these usually only show which tests failed without explaining why or how to fix the error. Novice students struggle with such minimal guidance and often resort to trial-and-error. Meanwhile, AI coding assistants (e.g., GitHub Copilot, ChatGPT) can provide hints and code suggestions, but novices may over-trust these outputs and lack the skills to verify them. To solve these issues, we present TraceMate, an IDE plugin that pairs the autograder’s tests with a conversational AI chatbot. TraceMate augments test feedback with context-aware explanations and inline suggestions for code modifications, and immediately validates each AI suggestion on the test suite. This workflow gives actionable hints while ensuring any AI-proposed changes are correct. In a user study with novice programmers, participants using TraceMate solved problems more effectively and reported higher confidence than those using only the autograder. These results suggest that pairing automated tests with an interactive AI assistant can enhance learning in introductory programming courses.",
    "title_zh": "TraceMate：在测试驱动编程中与AI协作",
    "abstract_zh": "大型编程课程通常使用测试驱动的自动评分系统（如CodeRunner）提供即时反馈，但这些系统通常仅显示哪些测试失败，而不会解释原因或指导如何修复错误。初学者在面对这种有限的指导时往往难以应对，常常只能通过试错来解决问题。与此同时，AI编程助手（如GitHub Copilot、ChatGPT）可以提供提示和代码建议，但初学者可能过度依赖这些输出，缺乏验证其正确性的能力。为解决这些问题，我们提出了TraceMate——一款集成于IDE的插件，将自动评分系统的测试与对话式AI聊天机器人相结合。TraceMate在测试反馈中增加了上下文感知的解释，并提供代码修改的内联建议，同时立即在测试套件上验证每一条AI提出的修改。这一工作流程不仅提供了可操作的提示，还确保了AI所建议的任何更改都是正确的。一项针对初学者程序员的用户研究显示，使用TraceMate的参与者比仅使用自动评分系统的对照组更有效地解决问题，并报告了更高的信心水平。结果表明，将自动化测试与交互式AI助手结合，能够有效提升入门级编程课程中的学习效果。"
  },
  {
    "date": "2025-12-25",
    "title": "MarkingVLM: Vision-Language Model for Few-Shot IC Marking Detection_supp1-3638609.pdf",
    "authors": "Yu Liu",
    "publish": "N/A",
    "url": "https://doi.org/10.1109/tii.2025.3638609/mm1",
    "source": "IEEE",
    "abstract": "Integrated circuit (IC) marking detection faces critical “Triple C” challenges: compact marking scales, complex multidirectional layouts, and costly annotation requirements. Traditional models struggle with data scarcity in dynamic manufacturing environments where fine-grained labeled data are expensive and time-consuming to obtain. This work presents MarkingVLM, a specialized vision-language model designed for IC marking detection with exceptional few-shot learning capabilities. MarkingVLM adapts cross-modal understanding from Contrastive Language-Image Pre-training (CLIP) through unique innovations: 1) dual-granularity detection combining patch-level semantic alignment with pixel-level visual decoding; 2) layout mirror module enabling efficient multidirectional text flow recognition through feature-level augmentation; and 3) enhanced prompt engineering with learnable contexts for effective domain adaptation. Extensive experiments across two IC marking datasets with distinct characteristics substantiate superior performance: 94.2% precision and 96.5% recall on Dataset-1, and 89.6% precision with 92.6% recall on the more challenging Dataset-2. Most significantly, MarkingVLM achieves 92.7% precision with 32 training samples and maintains over 80% recall with merely 8 samples, demonstrating notable data efficiency improvement over conventional methods. Results establish a new paradigm for industrial text detection by bridging open-domain vision-language knowledge with specialized manufacturing requirements.",
    "title_zh": "MarkingVLM：用于少样本IC标记检测的视觉-语言模型_supp1-3638609.pdf",
    "abstract_zh": "集成电路（IC）标记检测面临严峻的“三C”挑战：标记尺寸微小、布局复杂且多方向交织、标注成本高昂。在动态制造环境中，获取细粒度的标注数据往往代价高昂且耗时，导致传统模型普遍面临数据稀缺问题。本文提出一种专用于IC标记检测的视觉-语言模型MarkingVLM，具备卓越的少样本学习能力。MarkingVLM通过独特创新，从对比语言-图像预训练（CLIP）中迁移跨模态理解能力：1）采用双粒度检测机制，结合补丁级语义对齐与像素级视觉解码；2）引入布局镜像模块，通过特征层面增强实现高效多方向文本流识别；3）改进提示工程，引入可学习上下文以实现有效的领域自适应。在两个具有不同特性的IC标记数据集上进行的大量实验验证了其优越性能：在Dataset-1上达到94.2%的精确率和96.5%的召回率，在更具挑战性的Dataset-2上也实现了89.6%的精确率与92.6%的召回率。尤为关键的是，MarkingVLM仅需32个训练样本即可达到92.7%的精确率，并在仅8个样本的情况下仍保持超过80%的召回率，显著提升了数据利用效率，远超传统方法。本研究为工业文本检测树立了新范式，成功实现了开放域视觉-语言知识与专业化制造需求之间的有效衔接。"
  },
  {
    "date": "2025-12-25",
    "title": "Security Assessment of Mobile Banking Apps in West African Economic and Monetary Union",
    "authors": "Alioune Diallo, Aicha War, Moustapha Awwalou Diouf, Jordan Samhi, Steven Arzt, Tegawendé F. Bissyande, Jacques Klein",
    "publish": "2025 Cybersecurity4D (C4D)",
    "url": "https://doi.org/10.1109/c4d65382.2025.11306468",
    "source": "IEEE",
    "abstract": "Mobile banking adoption is soaring in Africa, particularly within the West African Economic and Monetary Union (WAEMU) states. These countries have witnessed financial institutions introducing mobile banking applications. These apps empower users to perform money transfers, bill payments, and account inquiries anytime, anywhere. However, this proliferation also raises significant security concerns. Poorly implemented security measures during app development can expose users and financial institutions to substantial financial risks through increased vulnerability to cyberattacks. Our study evaluated fifty-nine WAEMU mobile banking apps using static analysis techniques. We collected these mobile banking apps from the 160 banks and financial institutions of the eight WAEMU countries listed on the Central Bank of West African States (BCEAO) website. We identified security-related code issues that malicious actors could exploit. We investigated the issues found in the older versions to track their evolution across updates. Additionally, we identified some banks from regions such as Europe, the United States, and other developing countries and analyzed their mobile apps for a security comparison with WAEMU banking apps. Key findings include: (1) WAEMU apps exhibit security issues introduced during development, posing significant exploitation risks; (2) Despite frequent updates, underlying security issues often persist; (3) Compared to banking apps from developed countries, WAEMU apps exhibit fewer critical issues; and (4) Apps from banks that are branches of other non-WAEMU banks often inherit concerns from their parent apps while also introducing additional issues unique to their context. Our research underscores the need for robust security practices in WAEMU mobile banking app development to enhance user safety and trust in financial services.",
    "title_zh": "西非经济与货币联盟移动银行应用程序的安全评估",
    "abstract_zh": "非洲的移动银行采用率正在迅速上升，尤其是在西非经济与货币联盟（WAEMU）成员国。这些国家的金融机构纷纷推出了移动银行应用程序。这些应用使用户能够随时随地进行转账、支付账单和查询账户信息。然而，这种快速普及也带来了重大的安全挑战。在应用开发过程中若安全措施实施不当，将使用户和金融机构面临显著的财务风险，更容易受到网络攻击的威胁。本研究采用静态分析技术评估了59款WAEMU地区的移动银行应用。这些应用均来自西非国家中央银行（BCEAO）网站上列出的8个WAEMU国家共160家银行及金融机构。我们识别出了一些可能被恶意行为者利用的安全相关代码问题，并对旧版本中的问题进行了追踪，以观察其在后续更新中的演变情况。此外，我们还选取了来自欧洲、美国及其他发展中国家的部分银行，对其移动应用进行安全分析，以便与WAEMU地区的银行应用进行对比。主要发现包括：（1）WAEMU地区的应用在开发阶段就存在安全缺陷，带来严重的可被利用风险；（2）尽管频繁更新，但底层安全问题往往持续存在；（3）与发达国家的银行应用相比，WAEMU应用所存在的严重问题较少；（4）一些作为非WAEMU银行分支机构的本地银行应用，在继承母公司的安全问题的同时，还引入了与其特定运营环境相关的独特安全隐患。本研究强调，必须在WAEMU地区移动银行应用的开发中加强安全实践，以提升用户安全水平，增强对金融服务的信任。"
  },
  {
    "date": "2025-12-25",
    "title": "AI-Assisted Coding: Evaluating the Effectiveness of ML Model Development Using ChatGPT",
    "authors": "Blessing Okpe, Svetlana Stefanova",
    "publish": "2025 6th International Conference on Communications, Information, Electronic and Energy Systems (CIEES)",
    "url": "https://doi.org/10.1109/ciees66347.2025.11300224",
    "source": "IEEE",
    "abstract": "This study compared manual and ChatGPT-assisted workflows in developing machine learning (ML) models to evaluate ChatGPT’s effectiveness. Two datasets were used for classification and regression. Also, two workflows, manual and ChatGPT-assisted with results showing identical performance, but less time taken for ChatGPT. These findings suggest that once human oversight is maintained, AI can be used to speed up machine learning model development and prototyping without a compromise to the accuracy of the models.",
    "title_zh": "AI辅助编程：评估使用ChatGPT进行机器学习模型开发的有效性",
    "abstract_zh": "本研究比较了人工与ChatGPT辅助的工作流程在开发机器学习（ML）模型中的应用，以评估ChatGPT的有效性。研究使用了两个数据集进行分类和回归任务。两种工作流程——人工方式与ChatGPT辅助方式——的实验结果表现出相同的性能，但ChatGPT辅助方式所用时间更少。这些发现表明，在保持人类监督的前提下，人工智能可用于加速机器学习模型的开发与原型设计，且不会影响模型的准确性。"
  },
  {
    "date": "2025-12-25",
    "title": "SciConv: A Conversational Tool for Reproducibility",
    "authors": "Lázaro Costa, Susana Barbosa, Jacome Cunhá",
    "publish": "2025 IEEE Symposium on Visual Languages and Human-Centric Computing (VL/HCC)",
    "url": "https://doi.org/10.1109/vl-hcc65237.2025.00071",
    "source": "IEEE",
    "abstract": "Computational reproducibility remains a critical yet unresolved issue across scientific disciplines, often hindered by complex configuration requirements and technical barriers. We present SciConv, a novel conversational tool designed to assist researchers in creating and executing reproducible computational experiments using natural language. By leveraging large language models (llMs), SciConv automates the detection of dependencies and programming languages, and packages experiments into portable artifacts with minimal manual input. Unlike traditional platforms based on graphical user interfaces (e.g., web-based), SciConv features a chat-based interface that guides researchers interactively through the reproducibility workflow. This paper introduces the architecture, design principles, and interaction model of SciConv, and discusses its potential to lower the technical barriers to reproducibility.",
    "title_zh": "SciConv：一个用于可复现性的对话工具",
    "abstract_zh": "计算可复现性在各个科学领域中仍是一个关键但尚未解决的问题，常常受到复杂配置需求和技术障碍的制约。我们提出了 SciConv，一种新型的对话式工具，旨在帮助研究人员通过自然语言创建并执行可复现的计算实验。SciConv 利用大语言模型（LLMs），自动检测依赖关系和编程语言，并以最少的人工输入将实验打包为可移植的成果物。与基于图形用户界面（如基于网页的平台）的传统系统不同，SciConv 采用基于聊天的交互界面，能够以互动方式引导研究人员完成可复现性工作流程。本文介绍了 SciConv 的架构、设计原则及交互模式，并探讨了其在降低可复现性技术门槛方面的潜力。"
  },
  {
    "date": "2025-12-25",
    "title": "Debugging into Existence with Program Synthesis",
    "authors": "Guy Frankel, Shay Segal, Hila Peleg",
    "publish": "2025 IEEE Symposium on Visual Languages and Human-Centric Computing (VL/HCC)",
    "url": "https://doi.org/10.1109/vl-hcc65237.2025.00021",
    "source": "IEEE",
    "abstract": "When modifying an existing codebase to handle new functionality, programmers will often debug the program until the insertion point for the new code. This method, termed Debugging into Existence, helps programmers familiarize themselves with the surrounding code and runtime state. Despite its realworld usage, it is limited by the inability to test potential code past the first time the location is called, since added functionality would change the future state making it irrelevant. Prior work has pioneered Live Execution over partial programs, with extensions using the provided values for synthesis by Programming by Example. In this work, we present DeSynt, a debugger extension that integrates live execution and program synthesis to extend the Debugging into Existence interaction model. DeSynt grants programmers meaningful runtime information across many executions, by allowing them to manipulate program state according to the desired functionality. Based on the state provided by the programmer, DeSynt then synthesizes programs that capture this functionality. We evaluated DeSynt in a between-subjects study on 10 users, and found that in tasks that do not involve complex fault localization, deSynt reduces time to completion and concentrates programmer effort into fewer code locations. In addition, we found that users that used DeSynt spent more of their task time debugging, indicating DeSynt supports Debugging into Existence for those that already use it.",
    "title_zh": "通过程序合成调试存在",
    "abstract_zh": "在修改现有代码库以实现新功能时，程序员通常会通过调试程序来定位新代码的插入点。这种方法被称为“调试至存在”（Debugging into Existence），它有助于程序员熟悉周围代码和运行时状态。尽管该方法在实际开发中被广泛使用，但其局限性在于无法在首次调用位置之后测试潜在代码的后续行为，因为新增的功能会改变未来的程序状态，导致后续测试结果失去意义。以往的研究已探索了对部分程序进行实时执行的方法，并通过编程示例（Programming by Example）利用提供的值进行程序合成。在本研究中，我们提出了DeSynt——一种集成实时执行与程序合成的调试器扩展，旨在拓展“调试至存在”的交互模型。DeSynt允许程序员根据期望的功能操纵程序状态，并在多次执行中持续获得有意义的运行时信息。基于程序员提供的状态，DeSynt能够自动合成符合该功能的程序代码。我们在一项包含10名用户的组间对照实验中评估了DeSynt的效果，结果表明，在不涉及复杂故障定位的任务中，DeSynt显著缩短了完成任务的时间，并使程序员将更多精力集中在更少的代码位置上。此外，我们发现使用DeSynt的用户在任务过程中花费了更多的调试时间，这表明DeSynt有效支持了那些原本就采用“调试至存在”方法的程序员。"
  },
  {
    "date": "2025-12-25",
    "title": "AI-Guided Exploration of Large-Scale Codebases",
    "authors": "Yoseph Berhanu Alebachew",
    "publish": "2025 IEEE Symposium on Visual Languages and Human-Centric Computing (VL/HCC)",
    "url": "https://doi.org/10.1109/vl-hcc65237.2025.00053",
    "source": "IEEE",
    "abstract": "Modern software systems are large, complex, and continuously evolving. As systems grow in size and interconnectivity, developers face increasing challenges in understanding unfamiliar codebases—whether during onboarding, debugging, refactoring, or feature development. Prior research estimates that professional developers spend up to 70% of their time on program comprehension tasks [1]. This problem is especially pronounced in real-world systems involving layered abstractions, distributed modules, and sparse or inconsistent documentation.",
    "title_zh": "AI驱动的大规模代码库探索",
    "abstract_zh": "现代软件系统规模庞大、结构复杂且持续演进。随着系统规模的扩大和相互连接程度的提高，开发人员在理解陌生代码库时面临越来越大的挑战——无论是在入职初期、调试、重构还是功能开发过程中。先前的研究表明，专业开发人员将高达70%的时间用于程序理解任务[1]。这一问题在涉及分层抽象、分布式模块以及文档稀疏或不一致的实际系统中尤为突出。"
  },
  {
    "date": "2025-12-25",
    "title": "Distributed Modularization of Thought: Lets Small Rival Large LMs_supp1-3648050.txt",
    "authors": "Dario Bojanjac",
    "publish": "N/A",
    "url": "https://doi.org/10.1109/access.2025.3648050/mm1",
    "source": "IEEE",
    "abstract": "We present the Distributed Modularization of Thought (DMoT) approach for code generation using several small language models, fine-tuned for distinct phases of the code generation process. Instead of the conventional single-model approach in direct code generation, our DMoT method decomposes the task into a hierarchy of subtasks using hierarchical Multi-Level Reasoning (MLR) graphs. Each phase, from solving simple subproblems to verifying syntax and compliance with initial requirements, is handled by a dedicated fine-tuned model. Models were trained through knowledge distillation from a larger model (ChatGPT-4.1) using a quantized LoRA technique, enabling execution on accessible hardware. Experimental evaluation is conducted on the BigCodeBench benchmark, which includes realistic and complex programming tasks. These results show that a system composed of several specialized small models outperforms single-model approaches in terms of accuracy (pass@1) and structural quality (CodeBLEU). So, small fine-tuned language models can rival and even outperform larger models, offering a resource-efficient path in the code generation processes.",
    "title_zh": "思想的分布式模块化：让小型模型挑战大型语言模型_补充材料1-3648050.txt",
    "abstract_zh": "我们提出了一种名为分布式思维模块化（Distributed Modularization of Thought, DMoT）的方法，用于通过多个小型语言模型进行代码生成。这些小型模型针对代码生成过程的不同阶段进行了微调。与传统的直接代码生成中使用单一模型的方法不同，我们的DMoT方法利用分层的多级推理（Multi-Level Reasoning, MLR）图，将任务分解为一系列层次化的子任务。从解决简单子问题，到验证语法正确性及符合初始需求等各个阶段，均由专门微调过的模型负责处理。这些模型通过从大型模型（ChatGPT-4.1）中进行知识蒸馏，并采用量化LoRA技术进行训练，从而能够在普通硬件上高效运行。我们在BigCodeBench基准测试集上进行了实验评估，该基准包含真实且复杂的编程任务。实验结果表明，由多个专业化的小型模型组成的系统在准确率（pass@1）和结构质量（CodeBLEU）方面均优于单模型方法。因此，经过微调的小型语言模型不仅能够与大型模型相媲美，甚至在某些情况下表现更优，为代码生成过程提供了一条资源高效的实现路径。"
  },
  {
    "date": "2025-12-25",
    "title": "AutoPrint: Judging the Effectiveness of An Automatic Print Statement Debugging Tool",
    "authors": "Minhyuk Ko, Omer Ahmed, Yoseph Berhanu Alebachew, Chris Brown",
    "publish": "2025 IEEE Symposium on Visual Languages and Human-Centric Computing (VL/HCC)",
    "url": "https://doi.org/10.1109/vl-hcc65237.2025.00049",
    "source": "IEEE",
    "abstract": "Debugging is one of the most difficult and tedious tasks for software engineers. While various tools and techniques have been introduced to assist debugging, most programmers use print statement debugging to find and fix errors in their code. That is, they manually add code to print values to verify if the code is executing as expected and make sure a certain section of the program is reached. However, this process can be time-consuming and error-prone, especially in large and complex programs. To that end, we introduce AutoPrint, a tool that automatically inserts and removes print statements to streamline print statement debugging in Java code. We conducted a judgment study with 23 participants—students and practitioners—to elicit feedback on AutoPrint and gain insights on its utility in practical debugging tasks. Our results show participants perceive AutoPrint saves debugging time and effort through a faster, simpler, and more usable tool compared to other approaches.",
    "title_zh": "自动打印：评估一种自动打印语句调试工具的有效性",
    "abstract_zh": "调试是软件工程师工作中最困难且最乏味的任务之一。尽管已经引入了各种工具和技术来辅助调试，但大多数程序员仍然使用打印语句调试法来发现并修复代码中的错误。具体来说，他们手动添加代码以输出变量值，从而验证代码是否按预期执行，并确保程序的某个部分确实被访问到。然而，在大型复杂程序中，这一过程可能耗时且容易出错。为此，我们提出了AutoPrint，一种能够自动插入和移除打印语句的工具，旨在简化Java代码中的打印语句调试流程。我们对23名参与者（包括学生和从业者）进行了评估研究，以收集他们对AutoPrint的反馈，并深入了解该工具在实际调试任务中的实用性。研究结果表明，参与者普遍认为AutoPrint通过提供更快、更简单且更易用的调试方式，显著节省了调试的时间和精力。"
  },
  {
    "date": "2025-12-25",
    "title": "PipeBlocks: A Block-based Environment for CI/CD",
    "authors": "Hugo Da Gião, Rui Pereira, Jácome Cunha",
    "publish": "2025 IEEE Symposium on Visual Languages and Human-Centric Computing (VL/HCC)",
    "url": "https://doi.org/10.1109/vl-hcc65237.2025.00025",
    "source": "IEEE",
    "abstract": "Continuous Integration and Deployment (CI/CD) pipelines are essential for modern software delivery, yet configuring them remains a challenge due to the complexity of textbased formats like YAML. These configurations are error-prone and require substantial expertise, posing a barrier especially to novices. In this paper, we introduce PipeBlocks, a block-based CI/CD tool featuring a graphical interface for visually constructing pipelines through modular, drag-and-drop blocks. PipeBlocks seamlessly integrates with GitHub Actions, allowing users to design, validate, and execute pipelines entirely within the tool while maintaining full compatibility with existing YAML workflows. A key innovation is the ability to trigger and monitor pipeline runs directly in PipeBlocks, eliminating context-switching.",
    "title_zh": "PipeBlocks：一种基于区块的CI/CD环境",
    "abstract_zh": "持续集成与持续部署（CI/CD）流水线对于现代软件交付至关重要，但配置过程仍面临挑战，主要源于YAML等基于文本的格式复杂性。这类配置容易出错，且需要丰富的专业知识，对新手尤其构成障碍。本文提出PipeBlocks——一种基于模块化区块的CI/CD工具，配备图形化界面，用户可通过拖拽方式直观构建流水线。PipeBlocks无缝集成GitHub Actions，使用户可在工具内完成流水线的设计、验证与执行，同时保持与现有YAML工作流的完全兼容。其核心创新在于支持在PipeBlocks中直接触发并监控流水线运行，从而避免频繁上下文切换。"
  },
  {
    "date": "2025-12-25",
    "title": "Towards Human-AI Collaboration for Misapplication Detection in Programming Exercises",
    "authors": "Samuel D George, Zeqi Zhou, Ziqian Zhao, Mengyuan Zhu, Prasun Dewan",
    "publish": "2025 IEEE Symposium on Visual Languages and Human-Centric Computing (VL/HCC)",
    "url": "https://doi.org/10.1109/vl-hcc65237.2025.00031",
    "source": "IEEE",
    "abstract": "One persistent challenge in programming instruction is ensuring students correctly apply taught concepts during exercises. To address this issue, we enhanced an existing instructor dashboard to detect misapplication solutions-submissions that meet the requirements but misapply core concepts. We developed two complementary detection approaches. The first is a new reference-based method that embeds programs using instructordefined keywords (e.g., for, if, else) and identifies misapplications via an embedding and clustering algorithm. While effective, this approach requires instructors to (a) choose keywords, (b) label misapplications in prior student solutions, and (c) reuse unaltered problems. To mitigate these drawbacks, we introduce a referencefree method, novel in this area, that uses a Large Language Model (LLM) to detect misapplications without prior training or access to other student solutions. We evaluated both methods, along with a baseline edit-distance clustering technique, on two labeled programming exercises. In quantitative evaluations, our referencebased method outperformed the reference-free approach, but the reference-free method achieved similar results while avoiding the reference-based method’s limitations. We further evaluated both new approaches for in-progress misapplication detection and found similar results. To reduce instructor effort in the reference-based approach, we used an LLM to generate concept keywords from problem descriptions automatically. We found them accurate when used in our evaluations. Lastly, we examined the monetary cost of the reference-free approach and outlined tradeoffs to help instructors choose an approach based on effort, budget, and performance. This work contributes two novel misapplication-detection methods, demonstrates human-AI synergy to reduce instructor burden, and explores augmenting instructor user interfaces to improve their usefulness.",
    "title_zh": "面向编程练习中误用检测的人机协作",
    "abstract_zh": "编程教学中一个持续存在的挑战是如何确保学生在练习中正确应用所学概念。为解决这一问题，我们对现有的教师仪表板进行了改进，以检测“误用型”提交——即虽然满足题目要求但错误应用核心概念的程序。我们开发了两种互补的检测方法。第一种是基于参考的新方法，通过使用教师定义的关键字（如 for、if、else）对程序进行嵌入，并利用嵌入与聚类算法识别误用情况。尽管该方法有效，但仍需教师完成三项任务：(a) 选择关键字，(b) 在以往的学生解题中标注误用情况，以及 (c) 重复使用未修改的题目。为缓解这些局限性，我们提出了一种全新的无参考方法，该方法在该领域尚属首创，它利用大型语言模型（LLM）在无需预先训练或访问其他学生解题的情况下检测误用行为。我们在两个已标注的编程练习上对这两种方法，以及一个基准的编辑距离聚类技术进行了评估。定量分析显示，基于参考的方法表现优于无参考方法，但后者在避免前者局限性的前提下取得了相近的效果。我们还进一步评估了两种新方法在实时误用检测中的表现，结果类似。为了降低基于参考方法中教师的工作负担，我们使用 LLM 自动从题目描述中生成概念关键词，实验表明这些自动生成的关键词在评估中具有较高准确性。最后，我们分析了无参考方法的经济成本，并提出了权衡建议，帮助教师根据自身工作量、预算和性能需求选择合适的方法。本研究贡献了两种新颖的误用检测方法，展示了人机协同如何减轻教师负担，并探索了增强教师用户界面以提升其可用性的可能性。"
  },
  {
    "date": "2025-12-25",
    "title": "Frontend Diffusion: Empowering Self-Representation of Researchers and Designers with Multi-agent System",
    "authors": "Zijian Ding, Qinshi Zhang, Mohan Chi, Ziyi Wang",
    "publish": "2025 IEEE Symposium on Visual Languages and Human-Centric Computing (VL/HCC)",
    "url": "https://doi.org/10.1109/vl-hcc65237.2025.00011",
    "source": "IEEE",
    "abstract": "With the continuous development of generative AI’s logical reasoning abilities, AI’s growing code-generation potential poses challenges for both technical and creative professionals. But how can these advances be directed toward empowering junior researchers and designers who often require additional help to build and express their professional and personal identities? We introduce Frontend Diffusion, a multiagent coding system transforming user-drawn layouts and textual prompts into refined website code, thereby supporting selfrepresentation goals. A user study with 13 junior researchers and designers shows AI as a human capability enhancer rather than a replacement, and highlights the importance of bidirectional human-AI alignment. We then discuss future work such as leveraging AI for career development and fostering bidirectional human-AI alignment of multi-agent systems.",
    "title_zh": "前端扩散：基于多智能体系统赋能研究人员与设计师的自我表达",
    "abstract_zh": "随着生成式人工智能逻辑推理能力的持续发展，AI日益增强的代码生成潜力对技术与创意专业人士构成了挑战。然而，这些进展如何被引导以赋能那些常常需要额外帮助来构建和表达其专业与个人身份的初级研究人员和设计师呢？我们提出了前端扩散（Frontend Diffusion）——一种多智能体编码系统，能够将用户绘制的布局和文本提示转化为优化的网站代码，从而支持自我表达的目标。一项针对13名初级研究人员和设计师的用户研究显示，AI更应被视为人类能力的增强工具而非替代品，并强调了双向人机对齐的重要性。随后，我们探讨了未来工作方向，例如利用AI促进职业发展，以及推动多智能体系统中双向人机对齐的实现。"
  },
  {
    "date": "2025-12-25",
    "title": "AgentPbD: Interactive Agentic Workflow Generation from User Demonstration on Web Browsers",
    "authors": "Jiawen Li, Zheng Ning, Yuan Tian, Toby Jia-Jun Li",
    "publish": "2025 IEEE Symposium on Visual Languages and Human-Centric Computing (VL/HCC)",
    "url": "https://doi.org/10.1109/vl-hcc65237.2025.00064",
    "source": "IEEE",
    "abstract": "Programming by Demonstration (PbD) enables users to automate tasks through examples, but traditional systems generate low-level scripts that are hard to generalize or reuse. Recent advances in Large Language Models (LLMs) offer the potential to infer higher-level task structures, but rely on ambiguous natural language input. We present AgentPbD, a system that synthesizes task-level agentic workflows from a single user demonstration. By capturing browser actions and contextual metadata, AgentPbD automatically infers user goals and intentions, transforming user demonstrations into an editable, modular LLM agent workflow, and displays it on the browser extension interface. Users can further review and modify the workflow through visual programming. We demonstrate how AgentPbD bridges PbD and LLM planning, enabling interpretable and generalizable automation of complex web tasks.",
    "title_zh": "AgentPbD：基于用户在浏览器中操作示范的交互式智能体工作流生成",
    "abstract_zh": "演示编程（Programming by Demonstration, PbD）使用户能够通过示例自动化任务，但传统系统生成的通常是低层级脚本，难以泛化或复用。近年来，大型语言模型（LLMs）的发展为推断高层级任务结构提供了可能，但其依赖模糊的自然语言输入。我们提出了AgentPbD，一个能够从单一用户示范中合成任务级智能体工作流的系统。通过捕捉浏览器操作及上下文元数据，AgentPbD可自动推断用户的意图与目标，将用户示范转化为可编辑、模块化的LLM智能体工作流，并在浏览器扩展界面中展示。用户可通过可视化编程进一步审查和修改该工作流。我们展示了AgentPbD如何弥合演示编程与LLM规划之间的鸿沟，实现对复杂网络任务的可解释且可泛化的自动化。"
  },
  {
    "date": "2025-12-25",
    "title": "From Tool to Partner: Exploring the Roles of Embodiment on AI Agent in Pair Programming",
    "authors": "Xiaoran Yang, Yang Zhan, Noboru Matsuda, Qiao Jin",
    "publish": "2025 IEEE Symposium on Visual Languages and Human-Centric Computing (VL/HCC)",
    "url": "https://doi.org/10.1109/vl-hcc65237.2025.00033",
    "source": "IEEE",
    "abstract": "Pair programming with AI often faces challenges in productive communication and engagement. Integrating embodiment offers a promising solution by making AI a more engaging and context-aware programming partner. To explore how embodied AI agent supports programming learning and affects user experiences, we designed a virtual reality (VR) programming environment with Wizard-of-Oz-controlled AI agents. Our study collected data from 18 participants through knowledge acquisition assessments and interviews. The results showed that embodiment improved engagement, enhanced communication efficiency, and offered emotional support. Specifically, the incorporation of embodied actions allows users to perceive the AI agent as a “programming partner” and introduces many interactions that resemble those shared with real-life partners. However, the effectiveness of embodied actions in supporting users with programming tasks depends on the timing and accuracy of those actions. This study reveals the potential of embodied AI agents in advancing programming education and provides valuable design insights for creating more intuitive and supportive AI programming partners.",
    "title_zh": "从工具到伙伴：探索具身性在AI代理于配对编程中的角色",
    "abstract_zh": "与AI进行结对编程时常面临沟通效率低和参与度不足的挑战。引入具身性（embodiment）为解决这些问题提供了有前景的方案，使AI成为更具吸引力且情境感知能力更强的编程伙伴。为了探究具身AI代理如何支持编程学习并影响用户体验，我们设计了一个由“巫师之 Oz”控制的AI代理的虚拟现实（VR）编程环境。研究通过知识获取评估和访谈收集了18名参与者的数据。结果表明，具身性显著提升了用户参与度，增强了沟通效率，并提供了情感支持。具体而言，融入具身行为使用户更倾向于将AI代理视为“编程伙伴”，并促成了许多类似于与真实伙伴互动的交流形式。然而，具身行为在支持编程任务方面的有效性，取决于这些行为发生的时间和准确性。本研究揭示了具身AI代理在推动编程教育发展方面的潜力，并为设计更加直观、富有支持性的AI编程伙伴提供了宝贵的设计启示。"
  },
  {
    "date": "2025-12-25",
    "title": "Bridging Natural Language and SQL with an LLM-Powered Visual Interface",
    "authors": "Supriya Kottam",
    "publish": "2025 IEEE Symposium on Visual Languages and Human-Centric Computing (VL/HCC)",
    "url": "https://doi.org/10.1109/vl-hcc65237.2025.00055",
    "source": "IEEE",
    "abstract": "In many organizations, business analysts and decisionmakers frequently need to query structured data to extract insights, generate reports, or monitor key metrics. While the data itself is readily available in enterprise databases, accessing it often requires writing Structured Query Language (SQL) - a task that remains challenging for users without formal technical training. As a result, these users typically rely on data engineers or analysts to manually translate their questions into SQL, creating delays, bottlenecks, and communication gaps.",
    "title_zh": "利用大语言模型驱动的可视化界面连接自然语言与SQL",
    "abstract_zh": "在许多组织中，业务分析师和决策者经常需要查询结构化数据，以获取洞察、生成报告或监控关键指标。尽管企业数据库中的数据本身易于获取，但访问这些数据通常需要编写结构化查询语言（SQL），而这一任务对没有接受过正式技术培训的用户来说仍然具有挑战性。因此，这些用户通常依赖数据工程师或分析师手动将他们的提问转化为SQL语句，从而导致延迟、瓶颈以及沟通不畅等问题。"
  },
  {
    "date": "2025-12-25",
    "title": "Interruptions and Recovery: Leveraging Dynamic Code History in Development",
    "authors": "Vo Thien Tri Pham, Haixin Zhou, Caitlin Kelleher",
    "publish": "2025 IEEE Symposium on Visual Languages and Human-Centric Computing (VL/HCC)",
    "url": "https://doi.org/10.1109/vl-hcc65237.2025.00012",
    "source": "IEEE",
    "abstract": "Programmer interruptions are common and disruptive. While research has focused on understanding their nature, impact, and associated recovery cost, others have looked at visual reminders of recent development actions as recovery support mechanisms. Until now, however, these have only extended as far as the timeline of source code change alone. Thus, there are opportunities to improve this information in a codebase’s history to better support programmers’ interruption recovery. We conducted a within-subjects exploratory study investigating how developers use code history during interruption recovery. We compared a new sub-goal history interface, which contextually organized code changes and web activity into sub-goals, with an existing chronological timeline tool support identified in the literature. Our findings reveal that developers significantly leveraged the sub-goal history interface more frequently during post-interruption recovery, suggesting its potential to improve how developers navigate past work. While not leading to a significant reduction in overall recovery time in this study, sub-goal history provided valuable support for integrating external resources, facilitated faster initial re-engagement, and showed a generally better recovery success rate. We observed developers employing diverse, multimodal strategies, and, importantly, our results highlight recovery as a multi-stage process rather than a single event. These insights emphasize the crucial role of history-aware tool support for recovery workflows and underscore the need for designs that balance contextual detail with usability and adaptability to effectively support both developers’ passive (reading through information) and active (searching for information) engagement with the recovery tool support.",
    "title_zh": "中断与恢复：在开发中利用动态代码历史",
    "abstract_zh": "程序员在工作中常遭遇中断，这不仅常见且极具干扰性。尽管已有研究聚焦于理解中断的性质、影响及其恢复成本，另一些研究则关注通过视觉提示来帮助开发者回顾近期开发活动，以支持其从中断中恢复。然而，迄今为止，这些提示仅限于源代码变更的时间线信息。因此，在代码库的历史记录中进一步丰富和优化此类信息，仍存在巨大改进空间，以更好地支持程序员的中断恢复工作。我们开展了一项组内对照的探索性研究，考察开发者在中断恢复过程中如何利用代码历史信息。研究将一种新型的“子目标历史”界面（sub-goal history interface）与文献中已有的时间线工具进行了对比。该子目标界面将代码变更和网页活动等行为按上下文组织为若干子目标，而传统工具则仅提供线性时间顺序的展示。\n\n研究结果表明，开发者在中断后的恢复阶段更频繁地使用了子目标历史界面，显示出其在帮助开发者导航过往工作方面具有显著潜力。虽然本研究中并未观察到整体恢复时间的显著缩短，但子目标历史界面在整合外部资源方面提供了重要支持，促进了更快的初始重新投入，并表现出更高的整体恢复成功率。我们还观察到，开发者采用了多样化的、多模态的恢复策略。尤为重要的是，研究结果揭示了恢复过程并非单一事件，而是一个多阶段的复杂过程。\n\n这些发现强调了具备历史感知能力的工具支持在恢复工作流中的关键作用，也凸显出设计需在上下文细节与可用性之间取得平衡，以有效支持开发者在使用恢复工具时的被动（如浏览信息）与主动（如搜索信息）两种参与模式。未来的设计应更加注重适应性与灵活性，从而真正服务于开发者的实际需求。"
  },
  {
    "date": "2025-12-25",
    "title": "The Design Space of LLM-Based AI Coding Assistants: An Analysis of 90 Systems in Academia and Industry",
    "authors": "Sam Lau, Philip J. Guo",
    "publish": "2025 IEEE Symposium on Visual Languages and Human-Centric Computing (VL/HCC)",
    "url": "https://doi.org/10.1109/vl-hcc65237.2025.00041",
    "source": "IEEE",
    "abstract": "Over the past few years, millions of people have been using LLM-based AI tools to aid in programming, data analysis, and software engineering tasks. These AI coding assistants range from specialized tools like GitHub Copilot to general-purpose chatbots like Claude. In parallel, academics have published dozens of papers on forward-looking prototypes to expand our collective thinking beyond present-day industry trends. However, despite rapid advances in both sectors in recent years, we still lack an understanding of how their designs relate to one another and what tradeoffs are commonly made. At this key moment in 2025 when design patterns are starting to emerge, it is important to zoom out to see the forest instead of the trees. To do so, we performed the first comprehensive design analysis of 90 LLM-based AI coding assistants. We categorized the feature sets of 58 industry products and 32 academic projects, then formulated a design space that captures key variations in their user experiences. Our design space covers $\\mathbf{1 0}$ dimensions related to UI modalities, system inputs, capabilities, and outputs. We use this design space to reveal trends in both industry and academic projects across three eras ranging from autocomplete to chat to agent-based interfaces. Lastly, to address the question of who the target users of these tools are, we present six user personas whose preferences lie in different regions of our design space: professional software engineers, HCI researchers and hobbyist programmers, UX designers, conversational programmers (e.g., product managers and marketers), data scientists, and students.",
    "title_zh": "基于大语言模型的AI编程助手的设计空间：对学术界与工业界90个系统的分析",
    "abstract_zh": "近年来，数以百万计的人开始使用基于大语言模型（LLM）的AI工具来辅助编程、数据分析和软件工程等任务。这些AI编程助手涵盖从GitHub Copilot这类专用工具，到Claude等通用型聊天机器人等多种类型。与此同时，学术界也发表了数十篇前瞻性原型研究论文，旨在拓展我们对当前产业趋势之外的未来可能性的思考。然而，尽管这两个领域近年来都取得了飞速进展，我们仍缺乏对它们设计之间关系的理解，以及普遍存在的权衡取舍。在2025年这一关键节点——设计模式正逐步显现之际，我们更需要跳出细节，纵观全局。为此，我们首次对90个基于大语言模型的AI编程助手进行了全面的设计分析。我们对58款工业产品和32个学术项目的功能集进行了分类，并构建了一个设计空间，用以捕捉其用户体验中的关键差异。该设计空间涵盖了与用户界面模态、系统输入、功能能力及输出结果相关的**10个维度**。利用这一设计空间，我们揭示了从代码补全、对话式交互到基于代理（agent-based）界面的三个发展阶段中，工业界与学术界项目的整体趋势。最后，为回答“这些工具的目标用户是谁”这一问题，我们提出了六种用户角色画像，它们的偏好分布在设计空间的不同区域：专业软件工程师、人机交互（HCI）研究人员与业余编程爱好者、用户体验（UX）设计师、对话式程序员（如产品经理和市场营销人员）、数据科学家，以及学生。"
  },
  {
    "date": "2025-12-25",
    "title": "HiLDE: Intentional Code Generation via Human-in-the-Loop Decoding",
    "authors": "Emmanuel Anaya González, Raven Rothkopf, Sorin Lerner, Nadia Polikarpova",
    "publish": "2025 IEEE Symposium on Visual Languages and Human-Centric Computing (VL/HCC)",
    "url": "https://doi.org/10.1109/vl-hcc65237.2025.00032",
    "source": "IEEE",
    "abstract": "While AI programming tools hold the promise of increasing programmers’ capabilities and productivity to a remarkable degree, they often exclude users from essential decisionmaking processes, causing many to effectively “turn off their brains” and over-rely on solutions provided by these systems. These behaviors can have severe consequences in critical domains, like software security. We propose Human-in-the-Loop Decoding, a novel interaction technique that allows users to observe and directly influence LLM decisions during code generation, in order to align the model’s output with their personal requirements. We implement this technique in HiLDE, a code completion assistant that highlights critical decisions made by the LLM and provides local alternatives for the user to explore. In a within-subjects study ($\\mathrm{N}=18$) on security-related tasks, we found that HiLDE led participants to generate significantly fewer vulnerabilities and better align code generation with their goals compared to a traditional code completion assistant.",
    "title_zh": "HiLDE：通过人机协同解码实现有意的代码生成",
    "abstract_zh": "尽管AI编程工具在显著提升程序员能力与生产力方面具有巨大潜力，但它们往往将用户排除在关键决策过程之外，导致许多用户实际上“关闭了大脑”，过度依赖系统提供的解决方案。这种行为在软件安全等关键领域可能带来严重后果。为此，我们提出了“人在回路中的解码”（Human-in-the-Loop Decoding）这一新型交互技术，使用户能够在代码生成过程中观察并直接干预大语言模型（LLM）的决策，从而确保模型输出符合用户的个人需求。我们将在HiLDE这一代码补全助手系统中实现该技术，该系统会突出显示LLM做出的关键决策，并为用户提供本地化的替代方案以供探索。在一项针对安全相关任务的组内对比研究中（N=18），我们发现，相较于传统的代码补全助手，使用HiLDE的参与者生成的安全漏洞显著减少，且代码生成更符合其目标。"
  },
  {
    "date": "2025-12-25",
    "title": "AI Chatbot Adoption in Programming Education: An Extended TAM2 with Cybersecurity and Academic Expectations",
    "authors": "Radiana De Salma, Rio Guntur Utomo, Ayu Qatrunnada Istiqfarri",
    "publish": "2025 IEEE 11th Information Technology International Seminar (ITIS)",
    "url": "https://doi.org/10.1109/itis67966.2025.11309196",
    "source": "IEEE",
    "abstract": "The rapid rise of Artificial Intelligence chatbots in programming education offers both pedagogical opportunities and cybersecurity challenges. This study examines Indonesian STEM students’ acceptance of AI chatbots through an extended Technology Acceptance Model 2 (TAM2), which is used for programming learning with academic motivation while security issues are a concern. TAM2 was selected for its incorporation of output quality, where critical in programming where students evaluate AI-generated code accuracy, and its parsimonious framework directly linking perceived usefulness and ease of use to behavioral intention. Four contextual factors were integrated: Perceived Cybersecurity Risk (PCR), Expected Academic Achievement (EAA), Output Quality (Q), and SelfEfficacy (SE). Using PLS-SEM on 400 valid responses from six regions in Indonesia, findings show that Perceived Usefulness and Expected Academic Achievement are the strongest predictors of intention to use, while Self-Efficacy drives ease of use. PCR revealed a dual effect: reducing adoption intention yet unexpectedly increasing perceived usefulness, indicating security-conscious students apply more sophisticated evaluation frameworks. The model explained 51.7% of variance in intention and 52.4% in usefulness. Findings reveal that programming students adopt AI chatbots through pragmatic, outcome-oriented perspectives prioritizing demonstrable academic benefits, contributing to technology acceptance theory by exposing complex risk-benefit tradeoffs in high-cognition learning environments.",
    "title_zh": "人工智能聊天机器人在编程教育中的应用：基于扩展的TAM2模型融合网络安全与学术期望",
    "abstract_zh": "人工智能聊天机器人在编程教育中的迅速兴起，既带来了教学上的机遇，也引发了网络安全方面的挑战。本研究通过扩展的技术接受模型2（TAM2），探讨了印度尼西亚STEM学生对AI聊天机器人的接受度，重点关注编程学习中的学术动机，同时考虑安全问题的影响。TAM2被选中，因其引入了“输出质量”这一维度——在编程学习中至关重要，学生需评估AI生成代码的准确性；且其简洁的框架能直接将感知有用性和易用性与使用意图相联系。研究整合了四个情境因素：感知网络安全风险（PCR）、预期学术成就（EAA）、输出质量（Q）和自我效能感（SE）。基于来自印度尼西亚六个地区的400份有效问卷，采用偏最小二乘结构方程模型（PLS-SEM）进行分析，结果表明：感知有用性和预期学术成就对使用意图具有最强预测力，而自我效能感则显著影响易用性感知。感知网络安全风险表现出双重效应：一方面降低使用意愿，另一方面却意外提升了感知有用性，表明注重安全的学生会采用更复杂的评估标准来判断AI输出。该模型解释了使用意图51.7%的方差和感知有用性52.4%的方差。研究发现，编程学习者采纳AI聊天机器人主要基于务实、以成果为导向的视角，优先关注可量化的学业收益。这一发现丰富了技术接受理论，揭示了高认知学习环境中复杂的风险—收益权衡机制。"
  },
  {
    "date": "2025-12-25",
    "title": "A Type Language for Blockly",
    "authors": "Robin Stunic, Friedrich Steimann",
    "publish": "2025 IEEE Symposium on Visual Languages and Human-Centric Computing (VL/HCC)",
    "url": "https://doi.org/10.1109/vl-hcc65237.2025.00019",
    "source": "IEEE",
    "abstract": "Google’s Blockly library provides rudimentary support for types that constrain how blocks can be connected to form larger fragments. We argue that Blockly’s current type language does not reach beyond the level of context-freeness, and show how this can be changed — in a non-disruptive way — by adopting elements from attribute grammar and constraint-based typing. We demonstrate the generality of our approach by applying it to different languages, and describe our implementation and integration into Blockly.",
    "title_zh": "Blockly 的类型语言",
    "abstract_zh": "Google的Blockly库提供了基础的类型支持，用于限制积木之间的连接方式，从而构建更大的程序片段。我们认为，Blockly当前的类型语言尚未超越上下文无关性（context-freeness）的层次，而通过引入属性语法和基于约束的类型系统中的元素，可以非破坏性地实现改进。我们通过将其应用于多种语言，展示了该方法的通用性，并详细描述了其实现方式及其在Blockly中的集成。"
  },
  {
    "date": "2025-12-25",
    "title": "The Prompt–Refactor–Verify (PRV) Cycle: A Human-Centered Framework for AI-Assisted Programming",
    "authors": "Nikolay Yanev, Iglika Getova, Elizabet Mihaylova, Iva Kostadinova, Milena Bankovska, Georgi Dimitrov",
    "publish": "2025 6th International Conference on Communications, Information, Electronic and Energy Systems (CIEES)",
    "url": "https://doi.org/10.1109/ciees66347.2025.11300239",
    "source": "IEEE",
    "abstract": "The widespread adoption of large language models (LLMs) in software development has given rise to vibe coding—a practice in which developers rely on conversational prompts to generate and refine code. While this approach accelerates prototyping and lowers barriers to entry, it also introduces risks including frequent and unstable code changes, reduced readability, and a lack of accountability. To address these challenges, this paper proposes the Prompt–Refactor– Verify (PRV) cycle, a lean, human-centered framework that adapts prompt engineering techniques to AI-assisted programming.",
    "title_zh": "提示-重构-验证（PRV）循环：一种以人为中心的AI辅助编程框架",
    "abstract_zh": "大型语言模型（LLMs）在软件开发中的广泛应用催生了“氛围编程”（vibe coding）这一实践，即开发者通过对话式提示来生成和优化代码。尽管这种做法加速了原型开发并降低了入门门槛，但也带来了诸多风险，如频繁且不稳定的代码变更、可读性下降以及责任缺失。为应对这些挑战，本文提出了一种名为“提示—重构—验证”（Prompt–Refactor–Verify, PRV）的循环框架。该框架是一种轻量级、以人类为中心的方法，将提示工程技巧融入AI辅助编程流程中，旨在提升代码质量与开发可控性。"
  },
  {
    "date": "2025-12-25",
    "title": "Codigen: Enhancing Personalized Programming Education with Visual Authoring and LLMs",
    "authors": "Mohamed Ez-Zaouia, Yazid Boumarafi",
    "publish": "2025 IEEE Symposium on Visual Languages and Human-Centric Computing (VL/HCC)",
    "url": "https://doi.org/10.1109/vl-hcc65237.2025.00038",
    "source": "IEEE",
    "abstract": "Computer programming is an essential skill for the 21st-century workforce. However, mastering programming is challenging, especially for beginners. Recently, digital tools have become popular in supporting programming education. However, creating engaging programming materials remains difficult due to the many factors that need consideration. We introduce Codigen, an interactive tool powered by large language models (LLMs) that integrates visual authoring and prompt engineering to support programming education with various learning strategies. A user study with 29 participants showed that Codigen can assist teachers in generating quality programming materials. Statistical analysis showed that Codigen supports learners’ confidence and learning outcomes in programming. The perceived utility and engagement with the tool were also statistically significant. We discuss our findings to guide the design and use of LLM-powered authoring tools for educational purposes.",
    "title_zh": "Codigen：通过可视化创作与大语言模型提升个性化编程教育",
    "abstract_zh": "计算机编程是21世纪职场中一项至关重要的技能。然而，对于初学者而言，掌握编程极具挑战性。近年来，数字工具在支持编程教育方面变得越来越流行。但受多种因素影响，设计引人入胜的编程教学材料仍然十分困难。我们提出了Codigen，这是一个由大型语言模型（LLMs）驱动的交互式工具，通过整合可视化创作与提示工程，支持采用多种学习策略的编程教育。一项包含29名参与者的用户研究显示，Codigen能够帮助教师生成高质量的编程教学材料。统计分析表明，Codigen有助于提升学习者在编程学习中的自信心和学习成效，同时用户对工具的实用性和参与度也表现出显著的积极评价。本文讨论了研究发现，旨在为基于大语言模型的教育创作工具的设计与应用提供指导。"
  }
]