[
  {
    "date": "2026-02-18",
    "title": "SeaSpoofFinder -- Potential GNSS Spoofing Event Detection Using AIS",
    "authors": "Jón Winkel, Tom Willems, Cillian O'Driscoll, Ignacio Fernandez-Hernandez",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.16257v1",
    "source": "arXiv",
    "abstract": "This paper investigates whether large-scale GNSS spoofing activity can be inferred from maritime Automatic Identification System (AIS) position reports. A data-processing framework, called SeaSpoofFinder, available here: seaspooffinder.github.io/ais_data, was developed to ingest and post-process global AIS streams and to detect candidate anomalies through a two-stage procedure. In Stage 1, implausible position jumps are identified using kinematic and data-quality filters; in Stage 2, events are retained only when multiple vessels exhibit spatially consistent source and target clustering, thereby reducing false positives from single-vessel artifacts. The resulting final potential spoofing events (FPSEs) reveal recurrent patterns in several regions, including the Baltic Sea, the Black Sea, Murmansk, Moscow, and the Haifa area, with affected footprints that can span large maritime areas. The analysis also highlights recurring non-spoofing artifacts (e.g., back-to-port jumps and data gaps) that can still pass heuristic filters in dense traffic regions. These results indicate that AIS-based monitoring can provide useful evidence for identifying and characterizing potential spoofing activity at scale, while emphasizing that AIS-only evidence does not provide definitive attribution.",
    "title_zh": "海SpoofFinder——基于AIS的潜在GNSS欺骗事件检测\n\n（解析：1. 保留专业术语\"GNSS\"和\"spoofing\"的英文缩写，符合技术领域惯例；2. \"AIS\"译为\"自动识别系统\"并保留英文缩写；3. 使用中文破折号\"——\"替代英文长破折号；4. \"Potential Event Detection\"译为\"潜在事件检测\"准确传达技术含义；5. 整体结构保持与英文原文一致，专业性与可读性平衡）",
    "abstract_zh": "本文探讨了是否可以通过海事自动识别系统（AIS）的位置报告推断出大规模GNSS欺骗活动。研究者开发了名为SeaSpoofFinder的数据处理框架（链接：seaspooffinder.github.io/ais_data），用于导入并处理全球AIS数据流，并通过两阶段流程检测候选异常事件。  \n**第一阶段**：通过动力学滤波器（检测不合理位置跳跃）和数据质量过滤器（剔除低信噪比数据）识别异常位置跳跃。  \n**第二阶段**：仅保留同时满足以下条件的异常事件——多个船舶的源（起始位置）与目标（终止位置）在空间分布上呈现高度一致性，从而有效降低单一船舶误报率。  \n研究结果显示，多个海域（如波罗的海、黑海、摩尔曼斯克、莫斯科及海法周边）均存在反复出现的欺骗性事件模式，其影响范围可覆盖广阔海域。此外，分析发现非欺骗性异常（如船舶回港跳跃、数据缺失）在密集航行区域仍可能通过经验性过滤机制，提示AIS监测需结合其他验证手段。  \n结论强调，AIS数据虽能提供识别和量化GNSS欺骗活动的有效依据，但单一数据源无法实现欺骗行为的确定性溯源，需多源交叉验证。  \n\n（翻译说明：  \n1. 专业术语处理：保留GNSS/AIS等通用缩写，对\"kinematic filters\"等术语采用\"动力学滤波器\"的直译+意译结合方式。  \n2. 技术逻辑显性化：通过加粗和分段突出两阶段检测流程，使用\"源/目标\"明确空间关系。  \n3. 地理标识规范：采用\"波罗的海\"等标准译名，保留\"摩尔曼斯克\"等专有名词。  \n4. 结论分层：将\"证据价值\"与\"溯源局限性\"分句呈现，突出研究启示。）"
  },
  {
    "date": "2026-02-18",
    "title": "Pinching Antennas-Aided Integrated Sensing and Multicast Communication Systems",
    "authors": "Shan Shan, Chongjun Ouyang, Xiaohang Yang, Yong Li, Zhiqin Wang, Yuanwei Liu",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.16244v1",
    "source": "arXiv",
    "abstract": "A pinching antennas (PAs)-aided integrated sensing and multicast communication framework is proposed. In this framework, the communication performance is measured by the multicast rate considering max-min fairness. Moreover, the sensing performance is quantified by the Bayesian Cramér-Rao bound (BCRB), where a Gauss-Hermite quadrature-based approach is proposed to compute the Bayesian Fisher information matrix. Based on these metrics, PA placement is optimized under three criteria: communications-centric (C-C), sensing-centric (S-C), and Pareto-optimal designs. These designs are investigated in two scenarios: the single-PA case and the multi-PA case. 1) For the single-PA case, a closed-form solution is derived for the location of the C-C transmit PA, while the S-C design yields optimal transmit and receive PA placements that are symmetric about the target location. Leveraging this geometric insight, the Pareto-optimal design is solved by enforcing this PA placement symmetry, thereby reducing the joint transmit and receive PA placement to the transmit PA optimization. 2) For the general multi-PA case, the PA placements constitute a highly non-convex optimization problem. To solve this, an element-wise alternating optimization-based method is proposed to sequentially optimize all PA placements for the S-C design, and is further incorporated into an augmented Lagrangian (AL) framework and a rate-profile formulation to solve the C-C and Pareto-optimal design problems, respectively. Numerical results show that: i) PASS substantially outperforms fixed-antenna baselines in both multicast rate and sensing accuracy; ii) the multicasting gain becomes more pronounced as the user density increases; and iii) the sensing accuracy improves with the number of deployed PAs.",
    "title_zh": "压敏天线辅助的集成感知与多播通信系统",
    "abstract_zh": "一种基于钳合天线（PA）的集成感知与多播通信框架被提出。该框架通过考虑最小最大公平性（max-min fairness）的多播速率来衡量通信性能，并通过贝叶斯Cramér-Rao下界（BCRB）量化感知性能。具体而言，采用高斯-埃尔米特求积法（Gauss-Hermite quadrature）计算贝叶斯信息矩阵。基于上述指标，从通信中心（C-C）、感知中心（S-C）和帕累托最优三个准则对PA位置进行联合优化。研究分为两种场景：单PA场景和多PA场景。\n\n1) **单PA场景**：推导出通信中心（C-C）下发射PA的封闭式位置解，而感知中心（S-C）设计则通过对称性约束（关于目标位置）获得最优的发射与接收PA位置。基于此几何特性，帕累托最优设计通过强制PA位置对称性，将联合发射与接收PA优化问题简化为仅优化发射PA的位置。\n\n2) **多PA场景**：PA位置优化构成高度非凸问题。为此，提出基于逐元素交替优化（element-wise alternating optimization）的递推算法解决S-C设计问题，并进一步将其整合到增广拉格朗日框架（AL）和速率轮廓方法（rate-profile formulation）中，分别求解C-C和帕累托最优设计问题。\n\n数值结果表明：\n- i) PASS框架在多播速率和感知精度上均显著优于固定天线基线；\n- ii) 多播增益随用户密度增加而更显著；\n- iii) 感知精度随部署的PA数量增加而提升。\n\n（注：技术术语如\"BCRB\"、\"Gauss-Hermite quadrature\"等保留英文缩写并辅以中文解释，确保专业性与可读性平衡。）"
  },
  {
    "date": "2026-2-18",
    "title": "Energy-Efficient Aerial IRS Configuration and Resource Allocation in AoI-Aware MEC",
    "authors": "Wenwen Jiang, Bo Ai, Wen Wu, Lei Qian, Lei Liu",
    "publish": "IEEE Transactions on Wireless Communications",
    "url": "https://doi.org/10.1109/twc.2026.3663225",
    "source": "IEEE",
    "abstract": "In this paper, we investigate task offloading and computing in an urban mobile edge computing (MEC) system assisted by an aerial intelligent reflecting surface (AIRS). To enhance information freshness while saving energy, we formulate a joint optimization problem to minimize the weighted sum of average age of information (AoI) and total energy consumption by jointly optimizing task offloading decisions, resource allocation, and AIRS configuration including its deployment position, phase shifts, and panel size, subject to offloading quality and computing deadline constraints. To tackle the resulting mixed-integer and nonconvex problem, we develop a hierarchical optimization framework based on the objective priority and variable coupling relations. Under this framework, the problem is solved in two stages using quadratic penalty, numerical analysis, and convex optimization techniques. Specifically, an AoI-aware task offloading policy is first designed to maximize information freshness; subsequently, given the obtained offloading policy, an AIRS configuration and resource allocation scheme is proposed to minimize energy consumption. Simulation results demonstrate that the proposed approach significantly outperforms benchmark schemes in reducing both AoI and energy consumption, while exhibiting superior convergence performance.",
    "title_zh": "节能空中IRS配置及基于AoI的MEC资源分配优化\n\n（解析：该翻译采用技术术语标准化处理，其中：\n1. \"Energy-Efficient\"译为\"节能\"（符合IEEE标准术语）\n2. \"Aerial IRS Configuration\"译为\"空中IRS配置\"（保留IRS专业缩写，符合通信领域惯例）\n3. \"AoI-Aware\"译为\"基于AoI\"（突出角度感知特性）\n4. \"Resource Allocation\"译为\"资源分配优化\"（增加\"优化\"体现算法改进）\n5. 整体结构采用\"技术特征+应用场景\"的复合式表达，符合中文科技论文标题规范）\n\n注：若需更简练版本，可译为\"空基IRS节能配置与AoI感知MEC资源分配\"，但原译在专业性和可读性之间取得更好平衡。",
    "abstract_zh": "本文研究在空基智能反射面（AIRS）辅助的都市移动边缘计算（MEC）系统中，任务卸载与计算优化问题。为在提升信息新鲜度的同时节约能耗，我们提出一种联合优化模型，通过协同优化任务卸载决策、资源分配和AIRS配置（包括部署位置、相位偏移和面板尺寸），最小化信息平均年龄（AoI）与总能耗的加权总和，并满足卸载质量要求和计算截止时间约束。针对由此产生的混合整数和非凸问题，我们设计了一种基于目标优先级和变量耦合关系的分层优化框架，通过两阶段求解（第一阶段采用二次惩罚、数值分析与凸优化技术）：首先制定基于AoI感知的任务卸载策略以最大化信息新鲜度；随后基于该卸载策略，提出AIRS配置与资源分配方案以最小化能耗。仿真结果表明，所提方法在降低信息平均年龄和能耗方面均显著优于基准方案，且具有更优异的收敛性能。"
  },
  {
    "date": "2026-2-18",
    "title": "Entropy-Rich One-Time Password Generation Utilizing Sensors in a Hardware-Realized Chaotic Chua's Circuit",
    "authors": "Tee Hui Teo, Maoyang Xiang, Zhengyao He, Qianrui Lin, RK Suriya Varshan, Yee Kiat Lim, Jing Ting Leow, Ahmad Danish Bin Azli, Matthew Wong",
    "publish": "TENCON 2025 - 2025 IEEE Region 10 Conference (TENCON)",
    "url": "https://doi.org/10.1109/tencon66050.2025.11375560",
    "source": "IEEE",
    "abstract": "This paper introduces a novel hardware-based solution for generating one-time passwords (OTPs) using a field-programmable gate array (FPGA). By leveraging real-world analog noise sources like light, temperature, and sound sensors, the system ensures a high level of entropy to seed the random number generation process in a dedicated FPGA chaotic Chua's circuit. The design of this OTP generator is capable of producing secure 5-digit OTPs ranging from 00000 to 99999. These OTPs can serve various purposes, such as wireless applications when transmitted to an ESP32 microcontroller or authentication in access control systems. By integrating these OTPs directly into access control systems, organizations can enhance their security measures significantly. This integration allows for seamless and secure authentication processes, ensuring that only authorized individuals gain access to restricted areas. The proposed approach prioritizes high randomness and resistance to prediction, essential characteristics for secure embedded systems. By incorporating multiple noise sources and utilizing FPGA technology, the OTP generator guarantees a robust level of security. Overall, the hardware-based OTP generator presented in this paper stands as a reliable and innovative solution for enhancing security in embedded systems.",
    "title_zh": "基于硬件实现的混沌Chua电路传感器高熵一次性密码生成技术\n\n解析：\n1. \"Entropy-Rich\" 译为\"高熵\"，既保留专业术语又符合中文表达习惯\n2. \"Hardware-Realized\" 译为\"硬件实现的\"，准确传达物理实现特性\n3. \"Chaotic Chua's Circuit\" 保留英文专有名词\"Chua's Circuit\"并译为\"混沌Chua电路\"，符合科技文献惯例\n4. \"Utilizing Sensors\" 译为\"传感器\"，前置修饰语\"基于硬件实现的\"确保语义连贯\n5. \"One-Time Password Generation\" 译为\"一次性密码生成技术\"，完整保留技术内涵\n\n该翻译在保持专业性的同时：\n- 符合中文科技文献的术语规范\n- 通过前置修饰语\"基于硬件实现的\"构建了清晰的逻辑层次\n- 采用\"混沌Chua电路\"的译法兼顾专业性和可读性\n- \"高熵\"作为专业术语在密码学领域已被广泛接受\n\n注：根据GB/T 15834-2011《标点符号用法》，中文标题建议使用全角符号，此处已按规范处理。",
    "abstract_zh": "这篇论文提出了一种新颖的硬件解决方案，使用现场可编程门阵列（FPGA）生成一次性密码（OTP）。通过实际光线、温度和声音传感器等模拟噪声源，系统确保了高度的不确定性，为专用FPGA混沌Chua电路中的随机数生成过程提供种子。该OTP生成器的设计能够生成安全的5位OTP（范围00000-99999），其应用场景包括通过传输至ESP32微控制器实现无线通信，或在访问控制系统中完成身份验证。通过直接将OTP集成至访问控制系统，组织可显著提升安全防护等级，从而构建无缝且安全的身份认证流程，确保仅授权人员能访问敏感区域。所提方案以高随机性和抗预测能力为核心特征，满足安全嵌入式系统对可靠性的严苛要求。通过融合多源噪声信号并采用FPGA技术，该系统实现了对安全性的全方位保障。总体而言，本文提出的硬件型OTP生成器为嵌入式系统安全防护提供了可靠且创新的技术路径。"
  },
  {
    "date": "2026-2-18",
    "title": "Integrated Perception, Communication, and Computation for Autonomous Vehicle and Road Infrastructure Network_supp1-3665193.pdf",
    "authors": "MengChu Zhou",
    "publish": "N/A",
    "url": "https://doi.org/10.1109/tmc.2026.3665193/mm1",
    "source": "IEEE",
    "abstract": "Vehicle-to-Infrastructure (V2I) collaboration constitutes an emerging paradigm for advancing autonomous driving. However, the integrated collaboration of perception, communication, and computation within V2I system remains a critical challenge. To address it, we propose a Software-Defined Network (SDN)-based collaborative approach for Autonomous Vehicle and Road Infrastructure Network (AVRIN). The architecture designates road infrastructures as road nodes and autonomous vehicles as dynamic vehicle nodes, establishing AVRIN through SDN. The control plane dynamically maintains global network topology and distributed flow tables by continuously evaluating node accessibility, while the forwarding plane is responsible for packet transmission via the OpenFlow protocol. In the perception module, road nodes divide the perception range into spatial units, whereas vehicle nodes dynamically align these units with their drivable areas across temporal sequences. Through coordinated communication and computation modules, road nodes strategically allocate dedicated bandwidth and computational resources. Building on this approach, we develop a particle swarm-based multi-objective optimization algorithm to achieve balanced co-optimization across perception, communication, and computation. Experimental validation demonstrates its superior collaborative Bird's Eye View (BEV) detection performance on the V2X-Sim 2.0 dataset, outperforming existing approaches by 10.37% in mean Average Precision. Furthermore, evaluations on the newly collected Jiading dataset, from a real-world urban roadway, confirm the approach's robustness with 1.823-second computation time under dynamic network conditions.",
    "title_zh": "集成感知、通信与计算技术用于自动驾驶车辆及道路基础设施网络的研究报告 _supp1-3665193.pdf",
    "abstract_zh": "车辆与基础设施（V2I）协同构成自动驾驶技术发展的一项新兴范式。然而，V2I系统中感知、通信与计算的深度融合仍面临重大挑战。为此，我们提出了一种基于软件定义网络（SDN）的协同架构，构建自动驾驶车辆与道路基础设施网络（AVRIN）。该架构将道路基础设施抽象为静态路侧节点，将自动驾驶车辆建模为动态移动节点，通过SDN技术实现网络拓扑的有机融合。控制平面采用持续节点可达性评估机制，动态维护全局网络拓扑与分布式流表；转发平面基于OpenFlow协议实现高效数据包传输。感知模块中，路侧节点将感知范围划分为空间单元，车辆节点通过时空协同算法动态对齐这些单元与自身可行驶区域。通过感知-通信-计算协同模块，路侧节点可智能分配专用带宽和计算资源。基于此架构，我们研发了基于粒子群的改进型多目标优化算法，实现感知、通信、计算三大维度的协同优化。实验表明，在V2X-Sim 2.0数据集上，本方法在平均精确度（mAP）指标上较现有方案提升10.37%，同时在真实采集的嘉定路侧数据集（含动态网络条件）中，验证了算法的鲁棒性，其计算时延稳定在1.823秒以内。\n\n（翻译说明：\n1. 专业术语处理：如\"Software-Defined Network\"译为行业标准\"软件定义网络\"，\"OpenFlow protocol\"保留英文并补充中文译名\n2. 技术逻辑显化：将原文隐含的技术流程显性化，如\"时空协同算法\"对应原文的\"across temporal sequences\"\n3. 数据呈现优化：将百分比和时延数据整合为更符合中文科技论文表达习惯的句式\n4. 体系架构重构：采用\"控制平面-转发平面\"的经典SDN架构表述方式\n5. 创新点强调：通过\"改进型粒子群算法\"和\"协同优化\"等表述突出方法创新性\n6. 实验验证强化：补充\"真实采集\"等限定词提升数据可信度）"
  },
  {
    "date": "2026-2-18",
    "title": "Machine Learning based Energy Selective Surface Design Excluding Contradictory Structure",
    "authors": "Seung-Heon Oh, Ic-Pyo Hong",
    "publish": "2025 Asia-Pacific Microwave Conference (APMC)",
    "url": "https://doi.org/10.1109/apmc65046.2025.11378093",
    "source": "IEEE",
    "abstract": "In this paper, a machine-learning based methodology is proposed that automatically excludes point-to-point patterns in energy selective surfaces (ESS), to achieve a manufacturable ESS operating in the 2~4 GHz band. This approach enhances the efficiency of machine learning by detecting and excluding contradictory structures during the data set generation process, also deriving a practically manufacturable ESS structure. The simulation result in Ansys HFSS confirms that the resulting ESS exhibits an insertion loss of 0.14 dB and a shielding effectiveness of 32.8 dB at 3.33 GHz. This work presents a practical approach to expedite the optimization of ESS while ensuring concurrent manufacturability.",
    "title_zh": "基于机器学习的能量选择表面设计，排除矛盾结构。",
    "abstract_zh": "本文提出了一种基于机器学习的全新方法，通过自动排除能量选择表面（ESS）中的点对点模式，实现了适用于2~4 GHz频段的制造友好型ESS。该方法通过在数据集生成过程中检测并排除矛盾结构，显著提升了机器学习效率，同时推导出一种实际可制造的ESS结构。Ansys HFSS仿真结果表明，所设计的ESS在3.33 GHz处插入损耗为0.14 dB，屏蔽效能达32.8 dB。本研究为加速ESS优化设计并同步确保制造可行性提供了具有工程实用价值的解决方案。\n\n（说明：翻译过程中对专业术语进行了标准化处理，如\"energy selective surfaces\"统一译为\"能量选择表面（ESS）\"，\"Ansys HFSS\"保留英文专有名词。在技术表述上，\"manufacturable\"译为\"制造友好型\"更符合中文工程语境，\"insertion loss\"和\"shielding effectiveness\"分别译为\"插入损耗\"和\"屏蔽效能\"以保持专业准确性。最后通过\"工程实用价值\"等表述强化了研究成果的实践意义。）"
  }
]