[
  {
    "date": "2025-12-12",
    "title": "Machine-interpretable Engineering Design Standards for Valve Specification",
    "authors": "Anders Gjerver, Rune Frostad, Vedrana Barisic, Melinda Hodkiewicz, Caitlin Woods, Mihaly Fekete, Arild Braathen Torjusen, Johan W Kluwer",
    "publish": "IEEE Access",
    "url": "https://doi.org/10.1109/access.2025.3643528",
    "source": "IEEE",
    "abstract": "Engineering design processes use technical specifications and must comply with standards. Product specifications, product type data sheets, and design standards are still mainly document-centric despite the ambition to digitalize industrial work. In this paper, we demonstrate how to transform information held in engineering design standards into modular, reusable, machine-interpretable ontologies and use the ontologies in quality assurance of the plant design and equipment selection process. We use modelling patterns to create modular ontologies for knowledge captured in the text and in frequently referenced tables in International Standards for piping, material and valve design. These modules are exchangeable, as stored in a W3C compliant format, and interoperable as they are aligned with the top-level ontology ISO DIS 23726-3: Industrial Data Ontology (IDO). We test these ontologies, created based on international material and piping standards and industry norms, on a valve selection process. Valves are instantiated in semantic asset models as individuals along with a semantic representation of the environmental condition at their location on the asset. We create \"functional location tags\" as OWL individuals that become instances of OWL class Valve Data Sheet (VDS) specified valves. Similarly we create instances of manufacturer product type. Our approach enables automated validation that a specific VDS is compliant with relevant industry standards. Using semantic reasoning and executable design rules, we also determine whether the product type meets the valve specification. Creation of shared, reusable IDO-based modular ontologies for design standards enables semantic reasoning to be applied to equipment selection processes and demonstrates the potential of this approach for Standards Bodies wanting to transition to digitized Smart Standards.",
    "title_zh": "阀门规格的机器可读工程设计标准",
    "abstract_zh": "工程设计过程依赖于技术规范，并需符合相关标准。尽管工业工作数字化的愿景日益明确，但产品规格、产品类型数据表以及设计标准仍主要以文档为中心。本文展示了如何将工程设计标准中的信息转化为模块化、可重用且机器可读的本体，并利用这些本体在工厂设计与设备选型的质量保证过程中发挥作用。我们采用建模模式，为国际管道、材料及阀门设计标准中常见的文本内容和频繁引用的表格所承载的知识创建模块化本体。这些模块以符合W3C标准的格式存储，具备可交换性；同时，由于其与顶层本体ISO DIS 23726-3：工业数据本体（IDO）对齐，因此具有互操作性。我们将基于国际材料与管道标准及行业规范构建的本体应用于阀门选型流程中进行测试。阀门在语义资产模型中被实例化为个体，并与其所在位置的环境条件共同以语义形式表示。我们创建了“功能位置标签”作为OWL个体，使其成为指定为OWL类“阀门数据表（VDS）”的实例。同样，我们也创建了制造商产品类型的实例。该方法实现了对特定VDS是否符合相关行业标准的自动化验证。通过语义推理与可执行的设计规则，我们还能判断某产品类型是否满足阀门规格要求。基于IDO的共享、可重用模块化本体的建立，使语义推理能够应用于设备选型过程，充分展示了该方法在标准制定机构向数字化“智能标准”转型中的巨大潜力。"
  },
  {
    "date": "2025-12-12",
    "title": "LLM-based Fuzzing Method Using UI-based Input Value Generation for IoT Devices",
    "authors": "Hibiki Nakanishi, Kento Hasegawa, Seira Hidano, Kazuhide Fukushima, Nozomu Togawa",
    "publish": "2025 IEEE 14th International Conference on Consumer Electronics - Berlin (ICCE-Berlin)",
    "url": "https://doi.org/10.1109/icce-berlin67488.2025.11277733",
    "source": "IEEE",
    "abstract": "The widespread adoption of IoT devices has raised concerns about security, especially as these devices increasingly handle sensitive data. Many modern IoT devices are operated via web-based user interfaces (UIs), which may block communications not via the UI by existing protocol fuzzing due to authentication mechanisms. To address this, we propose a UI-based fuzzing approach that generates test inputs using a large language model (LLM) and mutates the generated inputs. Evaluation experiments on an IoT device demonstrate the effectiveness of the proposed method in detecting vulnerabilities.",
    "title_zh": "基于大语言模型的模糊测试方法：利用基于用户界面的输入值生成技术对物联网设备进行测试",
    "abstract_zh": "物联网设备的广泛采用引发了人们对安全性的担忧，尤其是这些设备越来越多地处理敏感数据。许多现代物联网设备通过基于Web的用户界面（UI）进行操作，而现有的协议模糊测试方法由于认证机制的存在，可能会阻止非通过UI的通信。为解决这一问题，我们提出了一种基于UI的模糊测试方法，该方法利用大语言模型（LLM）生成测试输入，并对生成的输入进行变异。在一款物联网设备上的评估实验表明，所提出的方法在检测漏洞方面具有显著效果。"
  },
  {
    "date": "2025-12-12",
    "title": "The Design of Single-Bit Fully Parallel Pipeline FFT",
    "authors": "Wei Li, Shuo Wang",
    "publish": "2025 10th International Conference on Communication, Image and Signal Processing (CCISP)",
    "url": "https://doi.org/10.1109/ccisp67522.2025.11282122",
    "source": "IEEE",
    "abstract": "With the ongoing convergence of radar, electronic warfare, and communications, receivers demand real-time spectral analysis that is ultra-wideband, low-latency, and highthroughput. To meet these requirements under low-cost and small-form-factor constraints, we propose a real-time frequencymeasurement scheme that combines RFSoC direct sampling and 1-bit quantization with a fully parallel, pipelined FFT. The RF signal is directly sampled by the high-speed ADC integrated in the RFSoC, while a 256 -point, fully parallel, pipelined FFT is implemented on the PL side, yielding one spectrum per clock cycle. With 1-bit inputs, the core computation avoids DSP multipliers and is implemented primarily using LUT resources. The consistency verification based on MATLAB and Verilog shows that the main peak localization and spectral morphology are consistent with the reference spectrum. The platform adopts Zynq UltraScale+RFSoC. Under experimental conditions, the maximum sampling rate can reach <tex xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">$4.9 \\text{GS} / \\mathrm{s}$</tex>. After steady state, it can output the spectrum by beat and measure the frequency in real time. The scheme is suitable for instantaneous wideband frequency measurement, rapid signal-presence detection, and superheterodyne-assisted receiver front ends, among other scenarios.",
    "title_zh": "单比特全并行流水线FFT的设计",
    "abstract_zh": "随着雷达、电子战与通信系统的持续融合，接收机对实时频谱分析的需求日益提高，要求具备超宽带、低延迟和高吞吐量的特性。为在低成本、小尺寸的约束下满足这些需求，本文提出一种结合RFSoC直接采样与1比特量化技术的实时频率测量方案，并采用全并行流水线FFT架构。射频信号由RFSoC内部集成的高速ADC直接采样，同时在PL端实现256点全并行流水线FFT，实现每时钟周期输出一个频谱。由于输入为1比特数据，核心计算避免了DSP乘法器的使用，主要通过查找表（LUT）资源实现。基于MATLAB与Verilog的对比验证表明，主峰定位及频谱形态与参考谱具有一致性。系统平台采用Zynq UltraScale+ RFSoC，在实验条件下最大采样率可达4.9 GS/s。进入稳态后，可实时输出频谱结果并完成频率测量。该方案适用于瞬时超宽带频率测量、快速信号存在检测以及超外差辅助接收机前端等多种应用场景。"
  },
  {
    "date": "2025-12-12",
    "title": "Automated Generation of MDPs Using Logic Programming and LLMs for Robotic Applications_supp1-3643276.mp4",
    "authors": "Enrico Saccon",
    "publish": "N/A",
    "url": "https://doi.org/10.1109/lra.2025.3643276/mm1",
    "source": "IEEE",
    "abstract": "We present a novel framework that integrates Large Language Models (LLMs) with automated planning and formal verification to streamline the creation and use of Markov Decision Processes (MDP). Our system leverages LLMs to extract structured knowledge in the form of a Prolog knowledge base from natural language (NL) descriptions. It then automatically constructs an MDP through reachability analysis, and synthesises optimal policies using the Storm model checker. The resulting policy is exported as a state-action table for execution. We validate the framework in three human-robot interaction scenarios, demonstrating its ability to produce executable policies with minimal manual effort. This work highlights the potential of combining language models with formal methods to enable more accessible and scalable probabilistic planning in robotics.",
    "title_zh": "使用逻辑编程和大语言模型自动生成用于机器人应用的MDP_supp1-3643276.mp4",
    "abstract_zh": "我们提出了一种新颖的框架，将大型语言模型（LLMs）与自动化规划及形式化验证相结合，以简化马尔可夫决策过程（MDP）的创建与使用。该系统利用大型语言模型从自然语言（NL）描述中提取结构化知识，并构建为Prolog知识库。随后，通过可达性分析自动生成MDP，并使用Storm模型检测器合成最优策略。最终生成的策略以状态-动作表的形式导出，可供执行。我们在三个典型的人机交互场景中验证了该框架的有效性，证明其能够在极少人工干预的情况下生成可执行的策略。本研究展示了将语言模型与形式化方法相结合，在机器人领域实现更易用、可扩展的概率规划的巨大潜力。"
  },
  {
    "date": "2025-12-12",
    "title": "Distributed Mixture-of-Agents for Edge Inference with Large Language Models",
    "authors": "Purbesh Mitra, Priyanka Kaswan, Sennur Ulukus",
    "publish": "2025 IEEE 36th International Symposium on Personal, Indoor and Mobile Radio Communications (PIMRC)",
    "url": "https://doi.org/10.1109/pimrc62392.2025.11275145",
    "source": "IEEE",
    "abstract": "Mixture-of-Agents (MoA) has recently been proposed as a method to enhance performance of large language models (LLMs), enabling multiple individual LLMs to work together for collaborative inference. This collaborative approach results in improved responses to user prompts compared to relying on a single LLM. In this paper, we consider such an MoA architecture in a distributed setting, where LLMs operate on individual edge devices, each uniquely associated with a user and equipped with its own distributed computing power. These devices exchange information using decentralized gossip algorithms, allowing different device nodes to talk without the supervision of a centralized server. In the considered setup, different users have their own LLM models to address user prompts. Additionally, the devices gossip either their own user-specific prompts or augmented prompts to generate more refined answers to certain queries. User prompts are temporarily stored in the device queues when their corresponding LLMs are busy. Given the memory limitations of edge devices, it is crucial to ensure that the average queue sizes in the system remain bounded. In this paper, we address this by theoretically calculating the queuing stability conditions for the device queues under reasonable assumptions, which we validate experimentally as well. Further, we demonstrate through experiments, leveraging open-source LLMs for the implementation of distributed MoA, that certain MoA configurations produce higher-quality responses compared to others, as evaluated on AlpacaEval 2.0 benchmark. The implementation is available at: https://github.com/purbeshmitra/distributed_moa.",
    "title_zh": "面向大语言模型边缘推理的分布式混合智能体",
    "abstract_zh": "混合代理（Mixture-of-Agents, MoA）最近被提出作为一种提升大型语言模型（LLMs）性能的方法，使多个独立的LLM能够协同工作以实现联合推理。这种协作方式相较于依赖单一LLM，能显著提升对用户提示的响应质量。在本文中，我们研究了在分布式场景下的MoA架构，其中各个LLM运行于独立的边缘设备上，每个设备与特定用户绑定，并具备自身的分布式计算能力。这些设备通过去中心化的 gossip 算法进行信息交换，使得不同设备节点能够在无中央服务器监督的情况下相互通信。在此设定下，每位用户拥有自己的专属LLM来处理其请求；同时，设备之间会交换自身用户的特定提示或经过增强的提示，以生成更精确的回答。当对应LLM正在忙碌时，用户提示会被临时存储在设备队列中。由于边缘设备存在内存限制，确保系统中设备队列的平均长度保持有界至关重要。本文通过在合理假设下进行理论推导，计算了设备队列的排队稳定性条件，并通过实验加以验证。此外，我们利用开源LLM实现了分布式MoA系统，并通过实验表明，某些MoA配置在AlpacaEval 2.0基准测试中产生的回答质量优于其他配置。相关实现代码已公开：https://github.com/purbeshmitra/distributed_moa。"
  },
  {
    "date": "2025-12-12",
    "title": "Hardware Trojan Object Detection Based on Bidirectional Graph Neural Networks",
    "authors": "Dong Cheng, Xuanwei Lin, Chen Don, Ximeng Liu, Kun Guo, Yirui Huang",
    "publish": "IEEE Transactions on Computers",
    "url": "https://doi.org/10.1109/tc.2025.3642575",
    "source": "IEEE",
    "abstract": "The rapid growth of Internet of Things (IoT) devices has heightened hardware security concerns, particularly with the emergence of hardware Trojans (HTs) as malicious components in integrated circuits. These HTs pose significant threats to information privacy and system performance. The early detection methods rely on golden references and domain knowledge, limiting their implementation in large-scale integrated circuits. Traditional machine learning-based HT detections can effectively identify infected circuits without golden chips. However, locating and evaluating the specific behavior of HTs in vast and complex circuits is challenging. To address these challenges, this paper presents an HT Object Detection (HTOD) problem, which involves two primary tasks: identifying the boundaries and sizes of HTs within circuits and distinguishing between different HT behaviors. We have developed a two-stage HT object detection framework based on a bidirectional jumping knowledge network called HTOD-BGNN to solve the HTOD problem, which enables progressive refinement of localized regions. It incorporates enhanced base-type features to ensure scalability and information retention during modeling. Additionally, the implementation of sample augmentation alleviates the challenges of sample imbalance and scarcity. The proposed method enables more intelligent circuit detection, achieving 100% and 87.5% detection rates for Trojan triggering and payload behaviors, respectively. It demonstrates superior localization performance and effective generalization to unseen circuit scenarios via its region refinement mechanism, achieving F1-scores of 54.01% on TrustHub and 90.04% on TRIT datasets.",
    "title_zh": "基于双向图神经网络的硬件木马对象检测",
    "abstract_zh": "物联网（IoT）设备的迅速增长加剧了硬件安全方面的担忧，尤其是硬件木马（HTs）作为集成电路中恶意组件的出现，对信息隐私和系统性能构成了严重威胁。早期的检测方法依赖于黄金参考样本和领域知识，难以在大规模集成电路中实施。传统的基于机器学习的硬件木马检测方法虽能在无黄金芯片的情况下有效识别受感染电路，但在庞大而复杂的电路中定位并评估木马的具体行为仍面临巨大挑战。为应对这些难题，本文提出了一个硬件木马目标检测（HTOD）问题，包含两个核心任务：确定电路中木马的边界与尺寸，并区分不同类型的木马行为。为此，我们提出了一种基于双向跳跃知识网络（HTOD-BGNN）的两阶段硬件木马目标检测框架，以实现局部区域的逐步精炼。该框架引入了增强型基础特征，确保建模过程中的可扩展性与信息保留能力。此外，通过实施样本增强策略，有效缓解了样本不平衡与稀缺性问题。所提方法实现了更智能的电路检测，对木马触发行为和载荷行为的检测率分别达到100%和87.5%。其区域精炼机制展现出优越的定位性能，并在未见过的电路场景中表现出良好的泛化能力，在TrustHub数据集上取得54.01%的F1分数，在TRIT数据集上达到90.04%的F1分数。"
  },
  {
    "date": "2025-12-12",
    "title": "GMIML: Graph Multi-Instance Multi-Label Learning",
    "authors": "Yijun Duan, Xin Liu, Steven Lynden, Akiyoshi Matono, Qiang Ma",
    "publish": "2025 IEEE 14th Global Conference on Consumer Electronics (GCCE)",
    "url": "https://doi.org/10.1109/gcce65946.2025.11274871",
    "source": "IEEE",
    "abstract": "In this study, we discuss for the first time a novel and widely applicable weakly-supervised graph learning task: Graph Multi-Instance Multi-Label Learning (GMIML). We explore the definition and key challenges of GMIML, as well as its potential applications in the domain of large language models. We further propose a preliminary cascaded model and evaluate its performance on standard benchmark datasets.",
    "title_zh": "GMIML：图多实例多标签学习",
    "abstract_zh": "在本研究中，我们首次探讨了一项新颖且具有广泛适用性的弱监督图学习任务：图多实例多标签学习（GMIML）。我们深入分析了GMIML的定义、核心挑战及其在大语言模型领域中的潜在应用。此外，我们还提出了一种初步的级联模型，并在标准基准数据集上评估了其性能。"
  },
  {
    "date": "2025-12-12",
    "title": "Benchmarking Vector, Graph and Hybrid Retrieval Augmented Generation (RAG) Pipelines for Open Radio Access Networks (ORAN)",
    "authors": "Sarat Ahmad, Zeinab Nezami, Maryam Hafeez, Syed Ali Raza Zaidi",
    "publish": "2025 IEEE 36th International Symposium on Personal, Indoor and Mobile Radio Communications (PIMRC)",
    "url": "https://doi.org/10.1109/pimrc62392.2025.11274810",
    "source": "IEEE",
    "abstract": "Generative AI (GenAI) is expected to play a pivotal role in enabling autonomous optimization in future wireless networks. Within the ORAN architecture, Large Language Models (LLMs) can be specialized to generate xApps and rApps by leveraging specifications and API definitions from the RAN Intelligent Controller (RIC) platform. However, fine-tuning base LLMs for telecom-specific tasks remains expensive and resource-intensive. Retrieval-Augmented Generation (RAG) offers a practical alternative through in-context learning, enabling domain adaptation without full retraining. While traditional RAG systems rely on vector-based retrieval, emerging variants such as GraphRAG and Hybrid GraphRAG incorporate knowledge graphs or dual retrieval strategies to support multi-hop reasoning and improve factual grounding. Despite their promise, these methods lack systematic, metric-driven evaluations, particularly in high-stakes domains such as ORAN. In this study, we conduct a comparative evaluation of Vector RAG, GraphRAG, and Hybrid GraphRAG using ORAN specifications. We assess performance across varying question complexities using established generation metrics: faithfulness, answer relevance, context relevance, and factual correctness. Results show that both GraphRAG and Hybrid GraphRAG outperform traditional RAG. Hybrid GraphRAG improves factual correctness by 8%, while GraphRAG improves context relevance by 11%.",
    "title_zh": "面向开放无线接入网（ORAN）的向量、图及混合检索增强生成（RAG）管道基准测试",
    "abstract_zh": "生成式人工智能（GenAI）预计将在未来无线网络的自主优化中发挥关键作用。在开放无线接入网（ORAN）架构中，大型语言模型（LLMs）可通过利用RAN智能控制器（RIC）平台提供的规范和API定义，专门化生成xApps和rApps。然而，对基础LLM进行微调以适应电信领域特定任务仍成本高昂且资源消耗大。检索增强生成（RAG）通过上下文学习提供了一种实用的替代方案，能够在无需完整重训练的情况下实现领域适配。尽管传统RAG系统依赖于基于向量的检索，但新兴的变体如GraphRAG和混合图RAG引入了知识图谱或双重检索策略，支持多跳推理并提升事实准确性。尽管这些方法前景广阔，但在高风险领域（如ORAN）中仍缺乏系统性、以度量为导向的评估。在本研究中，我们基于ORAN规范对向量RAG、GraphRAG和混合图RAG进行了对比评估，并采用公认的生成指标（包括忠实性、答案相关性、上下文相关性和事实正确性），在不同复杂度问题下衡量其性能。结果表明，GraphRAG与混合图RAG均优于传统RAG；其中，混合图RAG将事实正确性提升了8%，而GraphRAG则使上下文相关性提高了11%。"
  },
  {
    "date": "2025-12-12",
    "title": "AI-Driven Framework for Automating Infrastructure Provisioning and Compliance Validation in Cloud-Native Environments",
    "authors": "Hephzibah A. Igwe",
    "publish": "2025 IEEE 14th International Conference on Consumer Electronics - Berlin (ICCE-Berlin)",
    "url": "https://doi.org/10.1109/icce-berlin67488.2025.11277463",
    "source": "IEEE",
    "abstract": "As consumer-facing systems scale in complexity and regulation, ensuring security and compliance throughout the software development lifecycle becomes critical. This work introduces an intelligent, automated approach for continuous compliance monitoring and secure infrastructure deployment in cloud-native environments. Using Google’s Vertex AI as a secure orchestration layer and AWS Systems Manager (SSM) and EventBridge as control mechanisms, we enable continuous enforcement of security policies. The approach integrates Infrastructure as Code (IaC), cloud event triggers, and machine learning models to detect anomalies and enforce controls at deploy-time. Our experimental validation demonstrates 92.4% accuracy in detecting security misconfigurations, 45% reduction in deployment latency, and $78 \\%$ decrease in manual security interventions. The framework successfully processed 3,250 deployment scenarios with an average response time of 3.1 seconds. Designed generically for regulated enterprise environments, this methodology minimizes manual error, accelerates secure deployments, and aligns with Zero Trust principles. We outline architecture elements, automation flows, and compatibility with services like GuardDuty and AWS Inspector, demonstrating that AI-orchestrated infrastructure security is not only feasible but increasingly necessary in future consumer ecosystems.",
    "title_zh": "面向云原生环境的AI驱动型基础设施自动化部署与合规性验证框架",
    "abstract_zh": "随着面向消费者系统的复杂性和监管要求不断增长，确保在整个软件开发生命周期中实现安全与合规变得至关重要。本文提出一种智能、自动化的持续合规监控与云原生环境安全基础设施部署方法。通过使用谷歌的Vertex AI作为安全编排层，并以AWS Systems Manager（SSM）和EventBridge作为控制机制，实现了安全策略的持续强制执行。该方法融合了基础设施即代码（IaC）、云事件触发以及机器学习模型，能够在部署时检测异常并实施控制。实验验证表明，该方案在检测安全配置错误方面准确率达92.4%，部署延迟降低45%，人工安全干预减少78%。该框架成功处理了3,250个部署场景，平均响应时间仅为3.1秒。该方法设计具有通用性，适用于受监管的企业环境，可最大限度减少人为错误，加速安全部署，并符合零信任原则。本文详细阐述了架构组件、自动化流程，以及与GuardDuty、AWS Inspector等服务的兼容性，证明了AI驱动的基础设施安全不仅可行，更是在未来消费者生态系统中日益迫切的需求。"
  },
  {
    "date": "2025-12-12",
    "title": "A Generative AI Mentoring System for Cultivating Cybersecurity Skills",
    "authors": "Moe Yamanaka, Keishiro Watanabe, Haruhisa Hasegawa",
    "publish": "2025 IEEE 14th Global Conference on Consumer Electronics (GCCE)",
    "url": "https://doi.org/10.1109/gcce65946.2025.11275072",
    "source": "IEEE",
    "abstract": "We propose a virtual mentoring system utilizing generative AI to cultivate cybersecurity skills and critical thinking. The system guides learners by encouraging reasoning, prompting \"why\" questions, and offering credible hints, instead of promoting rote memorization. It leverages Retrieval-Augmented Generation (RAG) to provide accurate information from authoritative sources, enhancing the applicability of large language models (LLMs) in specialized domains such as cybersecurity. Our evaluation demonstrates that retrieving high-credibility information enhances the quality of hints and support, leading to better guidance of thinking and deeper understanding. This study shows the substantial potential of generative AI, particularly when integrated with RAG, to support thinking-centered cybersecurity education.",
    "title_zh": "一种生成式人工智能辅导系统，用于培养网络安全技能",
    "abstract_zh": "我们提出了一种利用生成式人工智能的虚拟导师系统，旨在培养网络安全技能和批判性思维能力。该系统通过鼓励学习者进行推理、提出“为什么”类问题，并提供可信的提示，而非促进死记硬背的方式引导学习者。系统采用检索增强生成（RAG）技术，从权威来源获取准确信息，从而提升大型语言模型（LLMs）在网络安全等专业领域中的应用效果。我们的评估结果表明，获取高可信度信息能够显著提升提示与支持的质量，进而有效引导思维发展并促进更深层次的理解。本研究展示了生成式人工智能的巨大潜力，尤其是在与RAG技术结合时，能够有力支持以思维为核心的网络安全教育。"
  },
  {
    "date": "2025-12-12",
    "title": "Hypervisor-Mediated Co-Design of Cybersecurity and Functional Safety in Vehicle E/E Architectures: A Cross-Domain Assurance Framework",
    "authors": "Yuzheng Zhang, Yiming Shu, Zejian Deng, Huizhe Zheng, Chen Sun",
    "publish": "2025 21st IEEE International Conference on Mechatronic and Embedded Systems and Applications (MESA)",
    "url": "https://doi.org/10.1109/mesa68091.2025.11278875",
    "source": "IEEE",
    "abstract": "The rise of embodied intelligence in autonomous vehicles, driven by software-defined capabilities, demands a fundamental shift in their underlying Electrical/Electronic (E/E) architectures. While centralized architectures promise the computational power for advanced autonomy, they introduce critical challenges in ensuring safety and cybersecurity. The consolidation of mixed-criticality functions on shared hardware creates significant risks of fault propagation and vulnerability to cyber-attacks. This paper proposes a hypervisor-driven frame-work that provides a resilient foundation for intelligent vehicles. We present an E/E architecture that leverages a Type-1 hypervisor to enforce hardware-level isolation between functions. By partitioning the system into independent virtual machines, we safely co-locate ASIL-D (Automotive Safety Integrity Level) tasks with general-purpose applications, preventing interference and containing threats. Our evaluation demonstrates that this partitioned architecture improves fault coverage by 21.4% compared to non-isolated approaches, significantly enhancing system resilience. This approach ensures that the vehicle’s intelligent systems operate safely, securely, and deterministically, even under complex, dynamic conditions.",
    "title_zh": "基于虚拟机管理程序的汽车电子电气架构中网络安全与功能安全的协同设计：一种跨域保障框架",
    "abstract_zh": "由软件定义能力驱动的自动驾驶汽车中具身智能的兴起，要求其底层电气/电子（E/E）架构进行根本性变革。尽管集中式架构能够提供实现高级自主性的计算能力，但其在保障安全性和网络安全方面带来了严峻挑战。将不同重要性等级的功能集中于共享硬件上，显著增加了故障传播风险，并使系统易受网络攻击。本文提出一种基于虚拟机监控程序（hypervisor）的框架，为智能车辆构建了具备韧性的基础架构。我们设计了一种E/E架构，利用Type-1型虚拟机监控程序在硬件层面实现功能间的隔离。通过将系统划分为独立的虚拟机，我们能够安全地将ASIL-D（汽车安全完整性等级D）任务与通用应用共置，从而避免相互干扰并有效遏制威胁。评估结果表明，相较于非隔离方案，该分区架构的故障覆盖率提升了21.4%，显著增强了系统的韧性。该方法确保了车辆智能系统在复杂多变的运行条件下仍能安全、可靠且确定性地运行。"
  }
]