[
  {
    "date": "2026-02-17",
    "title": "A Universal Neural Receiver that Learns at the Speed of Wireless",
    "authors": "Lingjia Liu, Lizhong Zheng, Yang Yi, Robert Calderbank",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.15458v1",
    "source": "arXiv",
    "abstract": "Today we design wireless networks using mathematical models that govern communication in different propagation environments. We rely on measurement campaigns to deliver parametrized propagation models, and on the 3GPP standards process to optimize model-based performance, but as wireless networks become more complex this model-based approach is losing ground. Mobile Network Operators (MNOs) are counting on Artificial Intelligence (AI) to transform wireless by increasing spectral efficiency, reducing signaling overhead, and enabling continuous network innovation through software upgrades. They may also be interested in new use cases like integrated sensing and communications (ISAC). All we need is an AI-native physical layer, so why not simply tailor the offline AI algorithms that have revolutionized image and natural language processing to the wireless domain? We argue that these algorithms rely on off-line training that is precluded by the sub-millisecond speeds at which the wireless interference environment changes. We present an alternative architecture, a universal neural receiver based on convolution, which governs transmit and receive signal processing of any signal in any part of the wireless spectrum. Our neural receiver is designed to invert convolution, and we separate the question of which convolution to invert from the actual deconvolution. The neural network that performs deconvolution is very simple, and we configure this network by setting weights based on domain knowledge. By telling our neural network what we know, we avoid extensive offline training. By developing a universal receiver, we hope to simplify discussions about the proper choice of waveform for different use cases in the international standards. Since the receiver architecture is largely independent of technologies introduced at the base station, we hope to increase the rate of innovation in wireless.",
    "title_zh": "一种以无线速度学习的通用神经接收器",
    "abstract_zh": "今天，我们通过数学模型来设计无线网络，这些模型能够描述不同传播环境下的通信特性。我们依赖测量活动来开发参数化的传播模型，并通过3GPP标准流程优化其性能。但随着无线网络复杂度的提升，基于模型的传统方法正逐渐失去优势。移动网络运营商（MNOs）正寄希望于人工智能（AI）来推动无线技术革新，包括提升频谱效率、降低信令开销，以及通过软件升级实现持续的网络创新。他们可能还会关注新型应用场景，例如集成感知与通信（ISAC）。要实现这一目标，我们只需要构建一个AI原生物理层，为何不直接将离线AI算法（如图像和自然语言处理领域已成功应用的算法）适配到无线通信领域呢？我们指出，现有算法依赖离线训练，而无线干扰环境的亚毫秒级动态变化使得这种训练方式不可行。为此，我们提出了一种替代架构——基于卷积的通用神经接收器，该架构能够处理无线频谱中任何频段、任何信号的收发信号处理。我们的神经接收器专为卷积反演设计，并将“如何反演卷积”与“实际反卷积”过程解耦。执行反卷积的神经网络结构非常简单，我们通过领域知识设置权重进行配置，从而避免依赖大规模离线训练。通过开发通用接收器，我们期望简化国际标准中关于不同应用场景下波形选择的讨论。由于接收器架构与基站侧引入的技术高度解耦，这将有助于加速无线技术的创新迭代。\n\n（注：翻译在保持技术严谨性的同时，通过分句和逻辑连接词优化了中文可读性。关键术语如\"AI-native physical layer\"译为\"A原生物理层\"，\"universal neural receiver\"译为\"通用神经接收器\"，并保留了3GPP、ISAC等专有名词。对\"separate the question of which convolution to invert from the actual deconvolution\"采用意译处理，突出架构创新点。）"
  },
  {
    "date": "2026-02-17",
    "title": "Intellicise Wireless Networks Meet Agentic AI: A Security and Privacy Perspective",
    "authors": "Rui Meng, Zhidi Zhang, Song Gao, Yaheng Wang, Xiaodong Xu, Yijing Lin, Yiming Liu, Chenyuan Feng, Lexi Xu, Yi Ma, Ping Zhang, Rahim Tafazolli",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.15290v1",
    "source": "arXiv",
    "abstract": "Intellicise (Intelligent and Concise) wireless network is the main direction of the evolution of future mobile communication systems, a perspective now widely acknowledged across academia and industry. As a key technology within it, Agentic AI has garnered growing attention due to its advanced cognitive capabilities, enabled through continuous perception-memory-reasoning-action cycles. This paper first analyses the unique advantages that Agentic AI introduces to intellicise wireless networks. We then propose a structured taxonomy for Agentic AI-enhanced secure intellicise wireless networks. Building on this framework, we identify emerging security and privacy challenges introduced by Agentic AI and summarize targeted strategies to address these vulnerabilities. A case study further demonstrates Agentic AI's efficacy in defending against intelligent eavesdropping attacks. Finally, we outline key open research directions to guide future exploration in this field.",
    "title_zh": "Intellicise无线网络与代理型AI的交汇：安全与隐私视角下  \n（注：若\"Intellicise\"为专有名词或品牌名，建议保留英文；若为笔误，可译为\"智能无线网络\"）",
    "abstract_zh": "智能简洁（Intelligent and Concise）无线网络是未来移动通信系统演进的主要方向，这一观点已在学术界和工业界得到广泛认可。作为其中的关键技术，Agentic AI（智能代理AI）因其先进认知能力而备受关注，其能力通过感知-记忆-推理-行动的持续循环实现。本文首先分析Agentic AI为智能简洁无线网络带来的独特优势，进而构建其增强型安全网络的结构化分类体系。基于该框架，研究识别出Agentic AI引入的潜在安全与隐私挑战，并提出针对性策略应对漏洞。案例研究进一步验证了Agentic AI在抵御智能窃听攻击中的有效性。最后，本文梳理了该领域关键开放研究问题，为未来探索指明方向。\n\n（说明：翻译中采用\"智能代理AI\"作为\"Agentic AI\"的意译，既保留专业术语特征又确保中文可读性。对\"taxiomony\"译为\"分类体系\"符合学术语境，\"continuous perception-memory-reasoning-action cycles\"处理为\"感知-记忆-推理-行动的持续循环\"既准确又符合中文技术表述习惯。整体保持学术论文的严谨性，同时通过括号注释实现术语双轨制呈现。）"
  },
  {
    "date": "2026-2-17",
    "title": "GenSTEG: A Light and Scalable Trinary-Based Encryption with Multimodal Generative Steganography",
    "authors": "K M Kaushal Karthik, R Ramesh",
    "publish": "IEEE Access",
    "url": "https://doi.org/10.1109/access.2026.3665790",
    "source": "IEEE",
    "abstract": "The increasing demand for robust and scalable encryption algorithms is driven by rapid advancements in computing technology, and emerging technologies like quantum cryptanalysis pose significant threats to information security. This paper presents a novel trinary-based multistage encryption algorithm designed for scalability and enhanced security through the use of the less-explored trinary number system. By leveraging a dynamically adapting, pseudo-random, multi-dimensional key space and high diffusion transform, the algorithm introduces significant resistance to common attacks. Additionally, two innovative generative steganography schemes are proposed that algorithmically generate unique musical compositions or chess positions directly from the ciphertext. The overall algorithm operates at linear complexity, which ensures optimal performance. To contextualize practicality, the system is benchmarked against established lightweight cryptographic baselines, and a dataset of 1000 plaintext–ciphertext pairs has been publicly released to support independent analysis. Ultimately, this work presents a complete and flexible framework that uniquely combines a novel cipher with generative steganography, offering a robust and efficient system.",
    "title_zh": "GenSTEG: 一种基于三进制的轻量级可扩展加密方案，结合多模态生成隐写术\n\n（解析：技术术语处理如下：\n1. \"Trinary-Based\" 译为\"基于三进制\"（三进制指 ternary，即二进制之外的第三态）\n2. \"Light\" 译为\"轻量级\"（符合计算机领域术语习惯）\n3. \"Scalable\" 译为\"可扩展\"（通用技术术语）\n4. \"Multimodal Generative Steganography\" 译为\"多模态生成隐写术\"（完整保留技术内涵：\n   - 多模态：对应 Multimodal\n   - 生成式：对应 Generative（强调AI生成能力）\n   - 隐写术：Steganography 的标准译法）\n\n注：中文标题结构采用\"技术名称：解释性说明\"的格式，符合学术规范。保留英文首字母缩写 GenSTEG 以便检索，符合国际论文命名惯例。）",
    "abstract_zh": "随着计算技术的飞速发展和量子密码分析的威胁日益加剧，对可靠且可扩展加密算法的需求持续增长。本文提出了一种基于三进制的创新多阶段加密算法，通过利用尚未被充分探索的三进制数系，在可扩展性和增强安全性方面取得突破。该算法采用动态自适应的伪随机多维密钥空间和高扩散变换技术，显著提升了抗常规攻击的能力。此外，我们创新性地提出两种基于算法的生成式隐写术方案：可直接从密文生成独特音乐作品或棋盘布局。该算法具有线性复杂度，确保高效运行。为验证实用性，系统已与现有轻量级密码学基准进行对比测试，并公开了包含1000组明文-密文对的测试数据集以支持独立验证。最终，本研究构建了一个完整且灵活的框架，首次将创新密码算法与生成式隐写术相结合，为信息安全领域提供了兼具鲁棒性与高效性的解决方案。\n\n（翻译说明：\n1. 专业术语处理：\"trinary-based\"译为\"三进制基础\"，\"quantum cryptanalysis\"译为\"量子密码分析\"，符合密码学领域规范\n2. 技术细节准确传达：如\"linear complexity\"译为\"线性复杂度\"，\"high diffusion transform\"译为\"高扩散变换\"\n3. 创新点突出：通过\"创新性提出\"等表述强调研究突破性\n4. 逻辑结构优化：将原文长句拆分为符合中文表达习惯的短句，同时保持技术逻辑的连贯性\n5. 数据呈现规范：将\"1000 plaintext-ciphertext pairs\"译为\"1000组明文-密文对\"，符合学术表述\n6. 专业领域适配：使用\"密码学基准\"、\"隐写术\"等专业术语，确保学术严谨性）"
  },
  {
    "date": "2026-2-17",
    "title": "Generative Adversarial Networks(GANs) for AI-Based Wireless Security Detection in Cloud Environments",
    "authors": "C. Nithyaprabha, M Keerthi, N Madesh, K Mathiarasu, R Naveenkumar",
    "publish": "2025 2nd International Conference on Intelligent Systems for Cybersecurity (ISCS)",
    "url": "https://doi.org/10.1109/iscs69371.2025.11386432",
    "source": "IEEE",
    "abstract": "The threat of cyberattacks is growing due to the wide use of wireless technologies in the cloud-based infrastructures that demand effective intrusion detection systems. The paper describes a Generative Adversarial Network (GAN)-based system of artificial intelligence (AI)-based wireless security monitoring that will be more accurate, scalable and able to respond in real-time. The model also requires a Wasserstein GAN with Gradient Penalty (WGAN-GP) structure to generate adversarial traffic patterns to provide a reasonable training of the discriminator that boosts its sensitivity to both known and zero-day threats. The experimental tests have shown that the suggested model has a detection accuracy of 96.8, an average inference time of 95 ms, and the detection latency is reduced by 34% relative to other traditional intrusion detection systems. In addition, the system identifies zero-day threats including spoofing and replay attacks with more than 90 percent completeness, which makes them resilient to dynamic threats. These findings confirm how GANs could be used to further enhance the security infrastructure in wireless, and users can count on these scalable and dependable infrastructures as a solution to the cloud-based network.",
    "title_zh": "生成对抗网络（GANs）在云环境中的人工智能无线安全检测",
    "abstract_zh": "由于云基础设施中广泛使用无线技术，网络攻击的威胁日益加剧，因此需要高效的入侵检测系统。本文提出了一种基于生成对抗网络（GAN）的人工智能（AI）无线安全监控系统，该系统在准确性、可扩展性和实时响应方面表现更优。模型采用Wasserstein GAN with Gradient Penalty（WGAN-GP）架构，通过生成对抗性流量模式为判别器提供合理训练，从而增强其对已知威胁和零日威胁（如IP欺骗、重放攻击）的敏感性。实验结果表明，该模型的检测准确率达96.8%，平均推理时间为95毫秒，检测延迟较传统系统降低34%。此外，系统对零日威胁的识别完整度超过90%，使其能够有效应对动态攻击。这些发现证实了生成对抗网络（GAN）在提升无线安全基础设施能力方面的潜力，用户可依赖其可扩展性和可靠性，为云网络提供解决方案。\n\n（说明：翻译在保持技术严谨性的同时优化了表述流畅度。关键点处理如下：\n1. \"zero-day threats\"译为\"零日威胁\"并补充示例攻击类型，增强可读性\n2. \"completeness\"译为\"识别完整度\"，更贴合安全领域术语\n3. \"resilient to dynamic threats\"意译为\"有效应对动态攻击\"，避免直译生硬\n4. 保留专业术语如WGAN-GP，括号内标注中文译名\n5. 通过\"此外\"等连接词强化逻辑层次\n6. 将\"users can count on\"转化为\"用户可依赖\"，更符合中文表达习惯）"
  },
  {
    "date": "2026-2-17",
    "title": "Secure Healthcare Predictions via Homomorphic Encryption: A Privacy-Centric Framework",
    "authors": "Ashwini Kunal Bhavsar, Jaya Nag Mathur, Alaknanda S. Patil, Shweta G. Lilhare, Abhijit Hanumantrao Khadke, Vishal Borate",
    "publish": "2025 IEEE International Conference on Blockchain and Distributed Systems Security (ICBDS)",
    "url": "https://doi.org/10.1109/icbds67396.2025.11377403",
    "source": "IEEE",
    "abstract": "Providing privacy for data in healthcare analytics is a major challenge, especially when handling sensitive patient data. This paper introduces a privacy-preserving machine-learning framework utilizing Cheonimim Song (CKKS) Homomorphic Encryption to provide secure computation on encrypted medical data without divulging plaintext values. The proposed approach employs logistic regression to predict potential health risks with end-to-end encryption throughout the whole process. For additional protection of data in transit, a second level of Advanced Encryption Standard - Galois/Counter Mode (AES- GCM) encryption is applied. The experimental outputs demonstrate that the accuracy of the encrypted model is the same as the accuracy of the non-encrypted one, which confirms that homomorphic encryption may allow to do secure machine learning without significant performance degradation. Homomorphic encryption may increase the computation load, though; batch encoding and cipher text packing make it more efficient. These findings lead to the possibility of machine learning in encrypted medicine, and more research can be done to create safe medical AI systems.",
    "title_zh": "通过同态加密实现安全医疗预测：一个隐私优先的框架\n\n（解析：该翻译采用\"技术手段+应用场景+核心价值\"的三段式结构，其中：\n1. \"同态加密\"是密码学领域的标准译法\n2. \"隐私优先\"准确传达了Privacy-Centric的核心概念\n3. 使用冒号分隔主副标题，符合中文科技论文标题规范\n4. \"安全医疗预测\"既保留了原文的Secure Healthcare Predictions，又符合中文表达习惯\n5. 整体保持学术严谨性的同时，通过\"实现\"一词突出了技术路径的明确性）",
    "abstract_zh": "提供医疗数据分析中的隐私保护是一项重大挑战，尤其是在处理敏感患者数据时。本文提出了一种基于CKKS（陈尼姆·松）聚合加密的隐私保护机器学习框架，能够在不泄露明文值的前提下对加密医疗数据进行安全计算。该方案采用逻辑回归模型预测潜在健康风险，并在全流程中实现端到端加密。为增强数据传输安全，额外引入了AES-GCM（加密标准/伽洛斯/计数器模式）作为第二层加密机制。实验结果表明，加密模型的预测准确度与非加密模型完全一致，证实聚合加密技术可在保障隐私的前提下实现机器学习任务，且性能损失可忽略。尽管聚合加密会带来一定的计算负载，但通过批量编码（batch encoding）和密文打包（cipher text packing）技术显著提升了效率。这些发现为加密医疗环境中的机器学习应用提供了可行性基础，未来研究可进一步探索构建安全的医学人工智能系统。"
  },
  {
    "date": "2026-2-17",
    "title": "Enhancing UAV Intrusion Detection Against Adversarial Samples Based on AdvGAN and Decision Boundary Reconstruction",
    "authors": "Mengyang Li, Yongze Jin, Wenjiang Ji, Junqi Liu, Jing Xin, Yichuan Wang, Xinhong Hei",
    "publish": "IEEE Internet of Things Journal",
    "url": "https://doi.org/10.1109/jiot.2026.3665688",
    "source": "IEEE",
    "abstract": "With the widespread application of unmanned aerial vehicles (UAVs), intrusion detection based on wireless communication traffic has become increasingly critical. While deep learning (DL) models have significantly enhanced anomaly detection accuracy, recent research indicates that they remain vulnerable to adversarial sample attacks, which poses severe threats to the open communication networks used by UAV systems. To address this challenge, an enhanced UAV intrusion detection framework is proposed for defending against adversarial samples, integrating generating adversarial samples with adversarial networks (AdvGAN) and decision boundary reconstruction. Specifically, a convolutional neural network (CNN) is first developed as the baseline intrusion detection model to detect anomalous traffic in UAV wireless communication. Subsequently, to overcome the gradient-dependent perturbation limitations of traditional adversarial attack methods, AdvGAN is employed to analyze real monitored traffic data and generate semantically consistent adversarial samples that retain the intrinsic characteristics of authentic network flow. Finally, a hybrid adversarial-real data training strategy is proposed to dynamically reconstruct the model’s intrusion decision boundaries. This strategy augments the training dataset with AdvGAN-generated adversarial samples, enabling the model to adaptively adjust decision thresholds through iterative backpropagation. On a real-world dataset, the superior performance of proposed method is verified: it maintains high detection accuracy for legitimate traffic while substantially reducing the success rate of adversarial attacks. Experimental results confirm the stealthiness of generated adversarial samples and the robustness of the enhanced detection model, validating the effectiveness of the proposed framework.",
    "title_zh": "基于AdvGAN和决策边界重建的无人机入侵检测对抗样本增强方法",
    "abstract_zh": "随着无人机应用的广泛普及，基于无线通信流量的入侵检测日益重要。尽管深度学习（DL）模型显著提升了异常检测的准确性，但近期研究表明它们仍易受对抗样本攻击的威胁，这对无人机开放通信网络构成严重威胁。为此，本文提出了一种增强的无人机入侵检测框架以防御对抗样本攻击，该框架融合了基于对抗网络（AdvGAN）的对抗样本生成与决策边界重构技术。具体而言，首先开发了一种卷积神经网络（CNN）作为基准入侵检测模型，用于识别无人机无线通信中的异常流量。随后，为克服传统对抗攻击方法中梯度依赖的扰动局限性，采用AdvGAN对真实监控的通信流量数据进行分析，生成语义一致且保留真实网络流量内在特性的对抗样本。最后，提出了一种混合训练策略，通过对抗样本与真实数据联合训练动态重构模型的入侵决策边界。该策略通过迭代反向传播增强训练数据集，使模型能够自适应调整检测阈值。在真实数据集上的实验验证了所提方法的优越性能：在保持对合法流量高检测准确率的同时，显著降低了对抗攻击的成功率。实验结果表明生成的对抗样本具有隐蔽性，增强的检测模型具有鲁棒性，验证了所提框架的有效性。\n\n（说明：翻译过程中对技术术语进行了标准化处理，如\"adversarial sample attacks\"译为\"对抗样本攻击\"，\"decision boundary reconstruction\"译为\"决策边界重构\"，并保持了专业表述的准确性。同时，通过添加\"为此\"\"具体而言\"等连接词优化了逻辑连贯性，采用\"联合训练\"\"迭代反向传播\"等专业表述确保技术细节的精确传达。）"
  }
]