[
  {
    "date": "2026-1-2",
    "title": "Current Status of Cluster Analysis Application in Software Construction Activities: A Systematic Literature Review",
    "authors": "Álvaro Barradas-Fernández, Ángel J. Sánchez-García, Oscar Alonso-Ramírez, Xavier Limón",
    "publish": "2025 Mexican International Conference on Computer Science (ENC)",
    "url": "https://doi.org/10.1109/enc68268.2025.11311899",
    "source": "IEEE",
    "abstract": "This paper presents a Systematic Literature Review (SLR) on the application of Cluster Analysis (CA) in software construction activities. Following the guidelines of Kitchenham and Quasigold-standard, we identified and analyzed 28 primary studies published between 2019 and 2025. The review revealed nine CA algorithms applied in this context, with K-means being the most frequently adopted for its simplicity and efficiency, followed by Hierarchical Clustering, Fuzzy C-means, and DBSCAN. The findings show that CA has been used to group code fragments, support refactoring, classify developer profiles, automate code generation, organize APIs, and detect dependencies among modules. These applications contribute to improving software quality, scalability, and maintainability. However, challenges remain in selecting the optimal number of clusters, interpreting results reliably, and generalizing across heterogeneous software systems. Overall, CA demonstrates significant potential as a complementary approach to enhance efficiency and quality in software construction, providing practical benefits for software engineers while highlighting the need for methodological guidance and further research.",
    "title_zh": "聚类分析在软件构建活动中的应用现状：一项系统性文献综述",
    "abstract_zh": "本文对聚类分析（CA）在软件构建活动中的应用进行了系统性文献综述（SLR）。遵循Kitchenham和Quasi提出的金标准指南，我们识别并分析了2019年至2025年间发表的28项原始研究。综述结果显示，该领域共应用了九种聚类算法，其中K均值算法因其实现简单且效率高而被最频繁使用，其次是层次聚类、模糊C均值和DBSCAN。研究发现，聚类分析已被用于代码片段分组、支持重构、开发者画像分类、自动化代码生成、API组织以及模块间依赖关系检测。这些应用有助于提升软件的质量、可扩展性和可维护性。然而，在确定最优聚类数量、可靠地解释结果以及在异构软件系统之间进行泛化方面仍存在挑战。总体而言，聚类分析展现出显著潜力，可作为提升软件构建效率与质量的补充方法，为软件工程师带来实际益处，同时也凸显出亟需方法学指导及进一步研究的必要性。"
  },
  {
    "date": "2026-1-2",
    "title": "Session Summary Podcast: Session 3: Auto-Tuning, Compilation, and Code Generation",
    "authors": "N/A",
    "publish": "Proceedings of the International Conference for High Performance Computing, Networking, Storage and Analysis",
    "url": "https://doi.org/10.1145/3712285.3787170",
    "source": "ACM",
    "abstract": "None",
    "title_zh": "会话摘要播客：第三集 自动调优、编译与代码生成",
    "abstract_zh": "None"
  },
  {
    "date": "2026-1-2",
    "title": "Enhancing Automatic Grading of SQL Query Assignments Using Generative AI : A Case Study on SPJ Query Assignment",
    "authors": "Yosei Tsuboi, Tetsuro Kakeshita",
    "publish": "2025 10th International Conference on Intelligent Informatics and Biomedical Sciences (ICIIBMS)",
    "url": "https://doi.org/10.1109/iciibms66230.2025.11316731",
    "source": "IEEE",
    "abstract": "The grading of SQL query assignments is a timeconsuming task for instructors, especially in large classes where ensuring both accuracy and consistency is difficult. To address this issue, we developed and evaluated an automatic grading tool for SQL query design using generative AI in this paper. The system targets SPJ (Selection, Projection, Join) query tasks from the Information Systems Experiment course. By incorporating model answers, lecture materials, and common student errors into carefully designed prompts, the tool aimed to improve grading accuracy and feedback quality. Comparative experiments were conducted with different prompt configurations as well as with an existing rubric-based tool developed by Ando et al. The results demonstrated that the optimized GPT-based prompt design achieved 96.8% accuracy (387 out of 400 items correctly graded), while also providing detailed feedback that specified “what was wrong,” “why,” and “how to fix it.” This feedback was found to support student learning and reduce grading inconsistencies for instructors. The findings confirm the potential of GPT-based systems as effective complements to existing rubric-based methods. This research highlights the promise of generative AI in delivering scalable, fair, and pedagogically meaningful assessments in database education.",
    "title_zh": "利用生成式人工智能提升SQL查询作业的自动评分：以SPJ查询作业为例的案例研究",
    "abstract_zh": "SQL查询作业的评分对教师而言是一项耗时的任务，尤其是在大班教学中，确保评分的准确性和一致性尤为困难。为解决这一问题，本文开发并评估了一种基于生成式人工智能的SQL查询设计自动评分工具。该系统针对信息系统实验课程中的SPJ（选择、投影、连接）查询任务。通过将标准答案、授课材料以及学生常见错误融入精心设计的提示（prompt）中，该工具旨在提升评分的准确性与反馈质量。我们进行了对比实验，测试了不同提示配置的效果，并与Ando等人开发的现有基于评分量规的工具进行比较。结果表明，经过优化的GPT提示设计达到了96.8%的准确率（400项中正确评阅387项），同时提供了详尽的反馈，明确指出“哪里出错”、“原因是什么”以及“如何修正”。这些反馈被证实有助于学生学习，同时减轻了教师在评分一致性方面的负担。研究结果证实，基于GPT的系统可作为现有基于量规方法的有效补充。本研究凸显了生成式人工智能在数据库教育中实现可扩展、公平且具有教学意义的评估所蕴含的巨大潜力。"
  },
  {
    "date": "2026-1-2",
    "title": "Design of a UAV Rescue System for Mountainous Areas Integrating PEFT-Enhanced Voice Control and rPPG-Based Vital-Sign Detection",
    "authors": "Xiang-Shun Yang, Chi-Hung Wang",
    "publish": "2025 10th International Conference on Intelligent Informatics and Biomedical Sciences (ICIIBMS)",
    "url": "https://doi.org/10.1109/iciibms66230.2025.11316736",
    "source": "IEEE",
    "abstract": "Unmanned aerial vehicles (UAVs) are widely deployed in rescue operations in mountainous areas for terrain mapping, victim search, and material delivery. However, most systems still rely on manual operation, making it difficult for rescuers to manage control and vital-sign assessment in complex terrain. This study introduces a UAV rescue system that integrates natural language understanding and image-based vital-sign detection. With parameter-efficient fine-tuning (PEFT), LLaMA 3.2 achieves $95.33 \\%$ accuracy in converting speech to control commands. Under 5 G communication, the end-to-end latency from speech to action averages 165 ms, supporting real-time flight control. Remote photoplethysmography (rPPG) yields a mean absolute error of 3.733 bpm compared to electrocardiogram (ECG) for vital-sign monitoring. These preliminary results demonstrate the system’s feasibility and potential in voice-based UAV control and non-contact vital-sign detection.",
    "title_zh": "一种集成PEFT增强语音控制与rPPG生命体征检测的无人机救援系统设计——适用于山区环境",
    "abstract_zh": "无人飞行器（UAV）在山区救援中被广泛用于地形测绘、受困人员搜寻和物资投送。然而，大多数系统仍依赖人工操作，在复杂地形环境下，救援人员难以同时兼顾飞行控制与生命体征评估。本研究提出一种集成自然语言理解与基于图像的生命体征检测的无人机救援系统。通过参数高效微调（PEFT），LLaMA 3.2 在将语音转换为控制指令方面达到了 95.33% 的准确率。在 5G 通信支持下，从语音到执行动作的端到端延迟平均仅为 165 毫秒，可实现实时飞行控制。远程光电容积脉搏波描记法（rPPG）在生命体征监测中与心电图（ECG）相比，平均绝对误差为 3.733 bpm。这些初步结果表明，该系统在基于语音的无人机控制及非接触式生命体征检测方面具有可行性与应用潜力。"
  },
  {
    "date": "2026-1-2",
    "title": "Applying Multi-Agent LLMS to Threat Analysis and Risk Assessment in Automotive Security",
    "authors": "Anja Obradov, Bogdan Pavković, Dimitrije Stojanović, Nenad Četić",
    "publish": "2025 33rd Telecommunications Forum (TELFOR)",
    "url": "https://doi.org/10.1109/telfor67910.2025.11314224",
    "source": "IEEE",
    "abstract": "Threat Analysis and Risk Assessment (TARA) is essential for identifying threats and managing risks, but is often resource-intensive due to manual steps, expert involvement, and iterative revisions. To address this, we propose an automated TARA framework using LLM agents that generate threat scenarios, derive cybersecurity goals and requirements, and refine them through a writer-reviewer loop. The proof of concept, demonstrated on a keyless entry system, produces structured JSON artifacts, ensuring traceability and supporting compliance-driven cybersecurity engineering in automotive systems.",
    "title_zh": "将多智能体大语言模型应用于汽车安全中的威胁分析与风险评估",
    "abstract_zh": "威胁分析与风险评估（TARA）对于识别威胁和管理风险至关重要，但通常因需要人工操作、专家参与以及反复修订而耗费大量资源。为解决这一问题，我们提出一种基于大语言模型（LLM）智能体的自动化TARA框架，该框架能够自动生成威胁场景，推导网络安全目标与需求，并通过“撰写-评审”循环不断优化结果。以无钥匙进入系统为例的原型验证表明，该方法可生成结构化的JSON格式输出，确保可追溯性，有力支持面向合规性的汽车系统网络安全工程。"
  },
  {
    "date": "2026-1-2",
    "title": "Contents",
    "authors": "N/A",
    "publish": "2025 33rd Telecommunications Forum (TELFOR)",
    "url": "https://doi.org/10.1109/telfor67910.2025.11314209",
    "source": "IEEE",
    "abstract": null,
    "title_zh": "内容",
    "abstract_zh": "None"
  },
  {
    "date": "2026-1-2",
    "title": "Recommended Steps for Developing Optimized and Secure Smart Contracts",
    "authors": "Marko Štaka, Sonja Ristić, Miroslav Stefanović, Danilo Nikolić, Darko Stefanović",
    "publish": "2025 33rd Telecommunications Forum (TELFOR)",
    "url": "https://doi.org/10.1109/telfor67910.2025.11314357",
    "source": "IEEE",
    "abstract": "Blockchain technology and smart contracts are central to decentralized applications. Operating on blockchain introduces challenges in design, development, and execution costs. On Ethereum, gas fees make optimization essential. This paper analyzes common mistakes affecting gas consumption and outlines strategies to improve efficiency. Using literature review and error systematization, key issues are identified and practical steps proposed. These recommendations, grounded in scientific research, aim to help developers design optimized and cost-effective smart contracts.",
    "title_zh": "开发优化且安全的智能合约的推荐步骤：\n\n1. 明确需求与设计目标  \n   - 详细定义合约的功能、业务逻辑和预期行为。  \n   - 确定用户角色、权限控制和交互流程。\n\n2. 选择合适的编程语言与平台  \n   - 使用经过验证的语言（如 Solidity 或 Vyper）编写合约。  \n   - 根据项目需求选择区块链平台（如 Ethereum、Polygon、Solana 等），并考虑其性能、成本和安全性。\n\n3. 遵循安全最佳实践  \n   - 避免常见漏洞，如重入攻击、整数溢出/下溢、事务顺序依赖（time-of-check to time-of-use）、未授权访问等。  \n   - 使用 OpenZeppelin 等成熟库中的安全组件（如 Ownable、AccessControl）。  \n   - 对所有输入进行验证和清理（使用 require/assert 检查条件）。\n\n4. 编写清晰、可读的代码  \n   - 使用一致的命名规范和注释。  \n   - 将复杂逻辑拆分为小函数，提高可维护性。  \n   - 避免重复代码，采用继承或库复用。\n\n5. 进行静态分析与代码审查  \n   - 使用工具如 Slither、MythX、Securify 等进行自动化安全扫描。  \n   - 组织同行代码审查（Peer Review），确保逻辑正确性和安全性。\n\n6. 编写全面的测试用例  \n   - 使用单元测试（如 Hardhat、Foundry）覆盖正常路径与异常情况。  \n   - 测试边界条件、错误处理和状态变更。  \n   - 在本地测试网络（如 Hardhat Network、Ganache）中充分测试。\n\n7. 模拟部署与审计  \n   - 在测试网（Testnet）上部署合约，模拟真实环境。  \n   - 聘请第三方安全公司进行专业审计（如 CertiK、Cobalt、Hacken）。  \n   - 根据审计报告修复发现的问题。\n\n8. 实施部署与监控策略  \n   - 使用版本控制管理合约代码（如 Git）。  \n   - 采用代理模式（Proxy Pattern）实现升级能力，避免不可变性带来的限制。  \n   - 部署后持续监控合约行为，设置警报机制以应对异常活动。\n\n9. 文档化与透明公开  \n   - 提供清晰的技术文档，包括接口说明、使用示例和安全注意事项。  \n   - 公开源代码（在 GitHub 等平台）以增强信任和社区审查。\n\n10. 持续维护与更新  \n   - 定期检查合约运行状态，响应新出现的安全威胁。  \n   - 根据用户反馈和生态变化进行功能优化与安全加固。\n\n通过以上步骤，可显著提升智能合约的可靠性、效率与安全性，降低潜在风险。",
    "abstract_zh": "区块链技术和智能合约是去中心化应用的核心。在区块链上运行应用带来了设计、开发和执行成本方面的挑战。以以太坊为例，Gas费用使得优化变得至关重要。本文分析了影响Gas消耗的常见错误，并提出了提升效率的策略。通过文献综述与错误系统化分析，识别出关键问题并提出切实可行的改进措施。这些建议基于科学研究，旨在帮助开发者设计出更加优化且成本效益更高的智能合约。"
  },
  {
    "date": "2026-1-2",
    "title": "Research on the Impact of Generative Artificial Intelligence on Electronic Engineering",
    "authors": "Haoxiang Zhang, Chuanhao Nie",
    "publish": "Proceedings of the International Conference on Implementing Generative AI into Telecommunication and Digital Innovation 2025",
    "url": "https://doi.org/10.1145/3771792.3773856",
    "source": "ACM",
    "abstract": "None",
    "title_zh": "生成式人工智能对电子工程的影响研究",
    "abstract_zh": "None"
  },
  {
    "date": "2026-1-2",
    "title": "Simulation of Flash Memory Architecture Using VHDL in Xilinx ISE",
    "authors": "Ramírez-Cruz U. D., Zapata-Rodríguez U.G., Zapata-Rodríguez U.G., Mendoza-Barron G., Mabil-Espinosa P., Caldelas-González E.I., Martínez-Castillo J.",
    "publish": "2025 Mexican International Conference on Computer Science (ENC)",
    "url": "https://doi.org/10.1109/enc68268.2025.11311720",
    "source": "IEEE",
    "abstract": "The flash memory has become over time a fundamental component in modern digital systems due to its nonvolatile nature, high speed writing capabilities and high data store density. This paper presents the design and simulation of a NAND type flash memory model using VHDL in XILINX ISE VIVADO environment. This model implements main flash operations: read, write or program, and block erase and is validated both functionally and quantitatively. The simulation results show read, write and erase latencies of 45-55 ns, 180-220 ns, and <tex xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">$1.5-2 \\mu \\mathrm{s}$</tex> respectively, achieving a data throughput between 8 and 12 MB/s. The architecture was simplified to a 1 KB single page design with separate address and data lines for improved clarity for the study. Despite the restrictions, the model successfully replicates the essential behavior of NAND flash memory serves as a tool for understanding memory architecture, logic and hierarchical VHDL design. To test functionality a testbench was developed, generating clock signals and applying stimulus to simulate memory access. As a practical application sample ECG (electrocardiogram) data was stored and retrieved from memory demonstrating a potential use in biomedical signal and embedded healthcare systems. This simulation results confirm the correct data storage, ensuring the reliability for implementation in FPGA systems. This work could be implemented to develop a layout design.",
    "title_zh": "使用VHDL在Xilinx ISE中仿真闪存架构",
    "abstract_zh": "随着技术的发展，闪存因其非易失性、高速写入能力以及高数据存储密度，已成为现代数字系统中不可或缺的组成部分。本文在XILINX ISE VIVADO环境中，采用VHDL语言设计并仿真了一种NAND型闪存模型。该模型实现了闪存的主要操作功能：读取、写入（编程）和块擦除，并通过功能性和量化两方面的验证。仿真结果表明，读取、写入和擦除的延迟分别为45–55 ns、180–220 ns以及1.5–2 μs，数据吞吐量达到每秒8至12 MB。为提升研究清晰度，架构被简化为1 KB单页设计，并采用独立的地址线与数据线。尽管存在上述限制，该模型仍成功复现了NAND闪存的核心行为，可作为理解存储器架构、逻辑设计及分层VHDL设计的有效工具。为测试功能，开发了测试平台，生成时钟信号并施加激励以模拟内存访问过程。作为实际应用示例，心电图（ECG）数据被成功存入并从内存中读取，展示了其在生物医学信号处理与嵌入式医疗系统中的潜在应用价值。仿真结果证实了数据存储的正确性，确保了其在FPGA系统中实现的可靠性。本工作可进一步用于布局设计的开发。"
  },
  {
    "date": "2026-1-2",
    "title": "TinyML Unleashed: Accelerating TensorFlow Lite Micro Kernels with RISC-V Vector Extension",
    "authors": "Ahmed Mahmoudi, Christopher Horn, Saleh Mulhem, Rainer Buchty, Mladen Berekovic, Rolf Meyer",
    "publish": "2025 33rd Telecommunications Forum (TELFOR)",
    "url": "https://doi.org/10.1109/telfor67910.2025.11314213",
    "source": "IEEE",
    "abstract": "The widespread use of machine learning on embedded devices has intensified the demand for efficient inference acceleration. The RISC-V Instruction Set Architecture (ISA) integrates vector extensions that provide advanced data-processing capabilities to address this need. However, existing compiler autovectorization techniques remain limited. In this paper, we hence explore the capabilities of manual vectorization for common Machine Learning kernels using TensorFlow Lite for Microcontrollers (TFLM) as the runtime engine. Our optimizations achieve throughput improvements ranging from <tex xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">$4 \\times$</tex> to <tex xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">$28 \\times$</tex> compared to scalar implementations, and up to <tex xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">$25 \\times$</tex> compared to compiler auto-vectorization on a commercial RISC-V board.",
    "title_zh": "TinyML unleashed：利用RISC-V向量扩展加速TensorFlow Lite Micro内核",
    "abstract_zh": "嵌入式设备上机器学习的广泛应用加剧了对高效推理加速的需求。RISC-V指令集架构（ISA）集成了向量扩展，提供了先进的数据处理能力以应对这一挑战。然而，现有的编译器自动向量化技术仍存在局限性。本文中，我们探索了在TensorFlow Lite for Microcontrollers（TFLM）运行时引擎下，针对常见机器学习内核进行手动向量化的能力。我们的优化相较于标量实现，吞吐量提升幅度达到4倍至28倍；与商用RISC-V开发板上的编译器自动向量化相比，最高可提升25倍。"
  },
  {
    "date": "2026-1-2",
    "title": "A Large Language Model-Driven Multi-Agent Human-Machine Interaction Framework",
    "authors": "Libowen Wu, Huailin Zhao, Wen Zheng, Xiaohu Yuan",
    "publish": "2025 10th International Conference on Intelligent Informatics and Biomedical Sciences (ICIIBMS)",
    "url": "https://doi.org/10.1109/iciibms66230.2025.11316762",
    "source": "IEEE",
    "abstract": "This paper proposes a multi-agent humanmachine collaboration framework driven by large language models (LLMs) to support natural language-based task execution in office environments. The system employs a twostage pipeline-command preprocessing and task execution—integrating functional agents for instruction correction, intent clarification, task planning, and multi-robot scheduling. Experiments in a real office setting demonstrate the system’s effectiveness in handling ambiguous and multi-task instructions with high accuracy and interaction flexibility.",
    "title_zh": "大语言模型驱动的多智能体人机交互框架",
    "abstract_zh": "本文提出了一种由大型语言模型（LLMs）驱动的多智能体人机协作框架，旨在支持办公环境中基于自然语言的任务执行。该系统采用两阶段流程——命令预处理与任务执行——并集成多种功能型智能体，用于指令修正、意图澄清、任务规划及多机器人调度。在真实办公环境中的实验表明，该系统能够以高准确率和高度交互灵活性处理模糊及多任务指令。"
  },
  {
    "date": "2026-1-2",
    "title": "A Field Study of Prompt Programming with LLM",
    "authors": "Daichi Deguchi, Tomoya Senda, Yusuke Kajiwara",
    "publish": "2025 10th International Conference on Intelligent Informatics and Biomedical Sciences (ICIIBMS)",
    "url": "https://doi.org/10.1109/iciibms66230.2025.11316775",
    "source": "IEEE",
    "abstract": "This study investigates prompt programming for K-12 learners in anticipation of language-driven robot operations. We built an “AI programmer” platform that splits roles: learners plan and test in natural language (requirements, test criteria, defect reports) while a large language model (GPT40) designs and revises executable code. In a two-hour cameraapp workshop with 24 Japanese students aged 9-13 (no prior LLM programming), participants iteratively specified, generated, tested, and refined features. About 80% reached a self-defined challenge task; self-reports across process understanding, creativity, transfer, and post-interest averaged $\\approx 3 / 4$, with the achiever group scoring $\\geq 1$ point higher on completeness, transfer, interest after, and ease of addition/modification. Rapid arrival at a working artifact appeared to boost self-efficacy and creative expression. Frictions included response variability, fragile coordinate/dimension handling, and naming inconsistencies, motivating safety nets that combine automated tests, lightweight static checks, and self-repair prompts. Limitations include a single-country, short-term sample and one model; future work will broaden contexts and integrate automated testing pipelines.",
    "title_zh": "基于大语言模型的提示工程实地研究",
    "abstract_zh": "本研究探讨了面向K-12学习者的提示编程，以应对语言驱动机器人操作的未来需求。我们构建了一个“AI程序员”平台，将角色分工：学习者使用自然语言进行规划与测试（如需求描述、测试标准、缺陷报告），而大型语言模型（GPT-40）则负责设计和修改可执行代码。在一场持续两小时的相机应用工作坊中，24名年龄介于9至13岁的日本学生（均无先前LLM编程经验）通过迭代方式完成了功能的指定、生成、测试与优化。约80%的学生达成了自定义的挑战任务；自我报告结果显示，在过程理解、创造力、知识迁移及后续兴趣等方面平均得分约为3/4，其中达成目标组在完整性、迁移能力、后续兴趣以及功能添加/修改的便捷性上均高出至少1分。快速获得可用成果似乎显著提升了学生的自我效能感与创造性表达。然而，也存在一些摩擦点，包括响应结果的不一致性、坐标与尺寸处理的脆弱性，以及命名规则的不统一，这促使我们提出引入安全机制——结合自动化测试、轻量级静态检查与自我修复提示。研究局限在于样本仅来自单一国家且为短期实验，同时仅使用一种模型；未来工作将拓展应用场景，并集成自动化测试流程。"
  },
  {
    "date": "2026-1-2",
    "title": "Educational Integration of ESP32 Project-Based Learning with Generative AI: Design, Implementation, and Evaluation in Two Engineering Cohorts",
    "authors": "Jose Manuel Medina Pozos, Jose M. Nieto-Jalil",
    "publish": "2025 Mexican International Conference on Computer Science (ENC)",
    "url": "https://doi.org/10.1109/enc68268.2025.11311879",
    "source": "IEEE",
    "abstract": "Microcontroller education is shifting from syntaxfocused programming to engineering reasoning under real constraints. We report a five-week, project-based and cooperative learning module using ESP32 with Arduino, where generative <tex xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">$\\mathbf{A I}$</tex> is allowed as guided scaffolding under mandatory traceability and individual oral verification. Two independent cohorts (<tex xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">$n=14$</tex> and <tex xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">$n=15; N=29$</tex>) worked in triads with rotating roles and evidence boards. Summative assessment combined public prototype demonstration (50 percent) and individual viva (50 percent), while structured peer assessment supported accountability. The overall mean grade was 75.54 (SD 14.61); cohort means were 77.45 and 73.75, with a small between-cohort difference (Cohen d about 0.25). The approval rate was 72.4 percent. Peer assessment averaged 0.917 and correlated strongly with grades (<tex xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">$r$</tex> about 0.78 overall; 0.85 and 0.69 by cohort), indicating alignment between recognized contributions and summative performance. Student perception was high and homogeneous across teaching, guidance, environment, expertise, and challenge. We conclude that integrating traceable generative AI with product-viva-peer assessment can accelerate learning in short blocks without compromising validity, offering a replicable design for instrumentation and control courses. The study provides pedagogical insights into how GenAI-supported PBL can enhance engineering reasoning and accountability. It contributes an evidence-based design model that integrates authentic assessment, cooperative learning, and AI literacy for modern engineering education.",
    "title_zh": "基于生成式人工智能的ESP32项目式学习在教育中的融合：两个工程专业班级的设计、实施与评估",
    "abstract_zh": "微控制器教育正从以语法为中心的编程转向在真实约束条件下的工程思维训练。本文报告了一个为期五周、基于项目且强调协作学习的模块，采用ESP32与Arduino平台，允许在强制可追溯性及个人口头验证的前提下使用生成式人工智能（GenAI）作为引导性支架。两个独立的实验组（n=14 和 n=15；N=29）以三人小组形式开展学习，角色轮换，并使用证据板记录过程。总结性评估由公开原型展示（占50%）和个体口试（占50%）构成，结构化同伴互评则增强了责任意识。总体平均成绩为75.54（标准差14.61），两组平均分分别为77.45和73.75，组间差异较小（Cohen's d约为0.25）。通过率高达72.4%。同伴互评平均得分为0.917，与最终成绩高度相关（总体r≈0.78；各组分别为0.85和0.69），表明被认可的贡献与总结性表现之间具有一致性。学生对教学、指导、学习环境、教师专业性及挑战性的感知普遍较高且趋于一致。研究结论表明：在短期课程中，将可追溯的生成式AI与产品展示—口试—同伴互评相结合，可在不损害评估有效性的前提下加速学习进程，为仪器仪表与控制类课程提供了一种可复制的教学设计范式。本研究为生成式人工智能支持下的项目式学习如何提升工程推理能力与责任意识提供了教学法启示，并构建了一个融合真实评估、协作学习与AI素养的实证型教学设计模型，适用于现代工程教育的发展需求。"
  },
  {
    "date": "2026-1-2",
    "title": "IntelliTest: An Intelligent Framework for Agentic Functional Test Generation Using Multimodal Data and Domain Knowledge",
    "authors": "Akshat Sukhdeo Tiwari, Satya Ganesh Nutan Dev C, Pratik Madhukar Patole, Goutham Ponnamreddy, Srinivas Chinthalapudi, Durga Prasad Kattamanchi",
    "publish": "2025 IEEE Future Networks World Forum (FNWF)",
    "url": "https://doi.org/10.1109/fnwf66845.2025.11317278",
    "source": "IEEE",
    "abstract": "IntelliTest is an end-to-end, locally deployable framework that automates functional test generation and selection for complex embedded systems from two input modes: Software Change Artifacts (SCAs)—multimodal changelist data combining code diffs with textual metadata—and Natural-Language Queries (NLQs) for direct test requests. It employs a domainagnostic ontology defining procedural semantics, compiled into a structured procedural database and a specification knowledge graph for retrieval-augmented reasoning. The dual-agent architecture—Context-Analysis-and-Scoping Agent (CASA) and Constrained-Testcase-Synthesis Agent (CTSA)—interprets SCAs or NLQs, validates functionalities through ontology-grounded databases, and synthesizes constraint-compliant sequences. Dynamic coverage databases use greedy set-cover selection and cross-impact expansion to expose cousin bugs in adjacent modules. Human-in-the-loop feedback refines ontology instantiations. Deployed locally for data-security compliance, IntelliTest was validated on commercial modem firmware (>50,000 files, >250,000 functions), achieving 95% functionality identification, 92% code-change coverage, 90% constraint satisfaction, and a five-fold reduction in generation time, shrinking regression suites by 40–60% while maintaining comprehensive coverage",
    "title_zh": "IntelliTest：一种基于多模态数据与领域知识的智能代理式功能测试生成框架",
    "abstract_zh": "IntelliTest 是一个端到端、可本地部署的框架，能够自动为复杂的嵌入式系统生成和选择功能测试，支持两种输入模式：软件变更产物（SCAs）——结合代码差异与文本元数据的多模态变更数据，以及自然语言查询（NLQs），用于直接提出测试请求。该框架采用领域无关的本体论，定义了过程语义，并将其编译为结构化的程序数据库和规范知识图谱，以支持检索增强型推理。其双代理架构包括上下文分析与作用域确定代理（CASA）和约束测试用例合成代理（CTSA），能够解析 SCAs 或 NLQs，通过基于本体的数据库验证功能，并生成满足约束条件的测试序列。动态覆盖数据库采用贪心集合覆盖选择与交叉影响扩展策略，有效暴露相邻模块中的“堂兄弟”类缺陷。人机协同反馈机制进一步优化本体实例化。为满足数据安全合规要求，IntelliTest 采用本地部署方式。在商用调制解调器固件（超过 5 万文件，25 万余个函数）上的验证表明，其实现了 95% 的功能识别率、92% 的代码变更覆盖率、90% 的约束满足率，测试生成时间缩短五倍，回归测试套件规模减少 40%–60%，同时保持全面的测试覆盖。"
  },
  {
    "date": "2026-1-2",
    "title": "Session Summary Podcast: Session 8: Paper Session H - Artificial Intelligence/LLM &amp; Automated Tools",
    "authors": "N/A",
    "publish": "Proceedings of the 26th ACM Annual Conference on Cybersecurity &amp; Information Technology Education",
    "url": "https://doi.org/10.1145/3769694.3787146",
    "source": "ACM",
    "abstract": "None",
    "title_zh": "会话摘要播客：第八期会话 H - 纸质会话：人工智能/大语言模型与自动化工具",
    "abstract_zh": "None"
  },
  {
    "date": "2026-1-2",
    "title": "A Novel Integrated Architecture for Intent Based Approach and Zero Touch Networks",
    "authors": "Neelam Gupta, Dibakar Das, Tamizhelakkiya K, Uma Maheswari Natarajan, Sharvari Ravindran, Komal Sharma, Jyotsna Bapat, Debabrata Das",
    "publish": "2025 IEEE Future Networks World Forum (FNWF)",
    "url": "https://doi.org/10.1109/fnwf66845.2025.11317209",
    "source": "IEEE",
    "abstract": "Sixth Generation (6G) and beyond networks present challenges in managing quality of service (QoS) of diverse applications and meeting Service Level Agreements (SLAs) under varying network conditions. Hence, network management needs automation using machine Learning (ML) and artificial Intelligence (AI) to meet real-time requirements. Zero touch network (ZTN) is one of the frameworks to automate network management with mechanisms, such as, closed loop control to ensure that the goals are met perpetually. Intent-Based Networking (IBN) specifies the user intents with diverse network requirements which are then translated into specific network configurations and actions. This paper presents a novel architecture for integrating IBN and ZTN to serve the intent goals. Users provide the intent in natural language, e.g., English, which is then translated using natural language processing (NLP) techniques (e.g., retrieval augmented generation (RAG)) into Network Intent LanguagE (Nile). The Nile intent is passed to the BiLSTM and Q-learning based ZTN closed loop as a goal which maintains the intent under varying network conditions. The integrated architecture is also implemented on a testbed using OpenAirInterface (OAI). Additionally, to evaluate the architecture, an optimization problem is formulated which evaluated with Monte Carlo simulations. Results demonstrate how ZTN achieves goals set by user intent 98% of the duration. Simulation and testbed results are compared which show similar trend. Mean Opinion Score (MOS) for Quality of Experience (QoE) is also measured to indicate satisfaction of user intent.",
    "title_zh": "一种面向意图驱动方法与零接触网络的新型集成架构",
    "abstract_zh": "第六代（6G）及未来网络在管理多样化应用的服务质量（QoS）以及在不同网络条件下满足服务等级协议（SLA）方面面临诸多挑战。因此，网络管理亟需借助机器学习（ML）和人工智能（AI）实现自动化，以满足实时性要求。零接触网络（ZTN）是实现网络管理自动化的框架之一，其通过闭环控制等机制，确保目标能够持续达成。意图驱动网络（IBN）则通过用户意图来定义多样化的网络需求，并将其转化为具体的网络配置与操作指令。本文提出了一种创新架构，将IBN与ZTN相结合，以有效实现用户意图目标。用户以自然语言（如英语）表达其意图，随后利用自然语言处理（NLP）技术（例如检索增强生成，RAG）将其转换为“网络意图语言”（Nile）。该Nile格式的意图被作为目标输入基于BiLSTM与Q-learning的ZTN闭环系统，以在不断变化的网络条件下持续维持用户意图。该集成架构已在基于OpenAirInterface（OAI）的实验平台上实现。此外，为评估该架构性能，本文还构建了一个优化问题，并通过蒙特卡洛仿真进行验证。结果表明，ZTN在98%的时间内成功实现了用户设定的目标。仿真结果与测试平台实测结果趋势一致。同时，通过测量用户体验质量（QoE）的平均意见得分（MOS），进一步验证了用户意图的满足程度。"
  },
  {
    "date": "2026-1-2",
    "title": "From Front-End to Perception: A Chisel Generator for Low-Latency FMCW Radar Signal Processing",
    "authors": "Nikola Ž. Petrović, Marija Petrović, Vladimir Milovanović",
    "publish": "2025 33rd Telecommunications Forum (TELFOR)",
    "url": "https://doi.org/10.1109/telfor67910.2025.11314346",
    "source": "IEEE",
    "abstract": "A Chisel-based, highly configurable hardware generator for FMCW radar signal processing that emits synthesizable range-Doppler FFT pipelines tailored to front-end parameters and inter-ramp timing is presented. The generator parameters that include FFT size, pipeline depth, butterfly type, fixed-point word lengths, and rounding/saturation modes, make the latency/throughput/area trade-offs explicit, enabling rapid designspace exploration across operating regimes. Generated instances can be tailored to the specific radar front-end in use and integrate cleanly with higher-level perception stacks. In addition, a dedicated low-latency path for target range detection reduces end-to-end detection latency for near-field targets.",
    "title_zh": "从前端到感知：一种用于低延迟FMCW雷达信号处理的凿子生成器",
    "abstract_zh": "本文提出了一种基于Chisel的、高度可配置的FMCW雷达信号处理硬件生成器，能够根据前端参数和帧间时间关系生成可综合的范围-多普勒FFT流水线。该生成器的参数包括FFT大小、流水线深度、蝶形运算类型、定点字长以及舍入/饱和模式，这些参数使延迟/吞吐量/面积之间的权衡关系清晰可见，从而支持在不同工作模式下快速进行设计空间探索。生成的实例可根据实际使用的雷达前端进行定制，并能与上层感知模块无缝集成。此外，还专门设计了一条低延迟的目标距离检测路径，显著降低了近场目标的端到端检测延迟。"
  }
]